[
   {
      "title":"Eid-ul-Fitr and Eid-ul-Adha – What is the Difference?",
      "detail":"Eid, meaning ‘celebration’ or ‘festival’, is a prestigious word in Islam. There are two dedicated times of Eid in Islam that Muslims celebrate as per the Prophet Muhammad’s (PBUH) guidance: Eid ul-Fitr and Eid ul-Adha. These are times at which Allah (SWT) rejoices in His followers being happy and encourages joy amongst all.\nEid ul-Fitr and Eid ul-Adha often get confused, but they are two separate celebrations and have different meanings behind them. The two festivals are celebrated similarly, but they commemorate different things and as such, encompass two contrasting facets of Islam."
   },
   {
      "title":"What is Eid?",
      "detail":"As mentioned, Eid refers to a time of joyous celebration. There are two types of Eid: Eid ul-Fitr (sometimes called ‘small Eid’) and Eid ul-Adha (sometimes called ‘big Eid’, 'Qurbani Eid', ‘Bakra Eid’ or ‘Eid al-Kabir’)."
   },
   {
      "title":"When is Eid?",
      "detail":"The question of ‘when is Eid?’ depends on which type of Eid you’re referring to. If you’re wondering which Eid is after Ramadan, it is Eid ul-Fitr. This tends to be the more widely known Eid of the two amongst those who do not follow Islam, and that is despite it being the lesser of the two Eids.\nEid ul-Fitr follows Ramadan which takes place during the ninth month of the Islamic (lunar) calendar. This means Eid ul-Fitr comes before Eid ul-Adha and therefore is the first of the Eids. in the last 10 days of Ramadan is said to bring with it a thousand months’ worth of blessings, and there’s no better way to follow the month of fasting and charitable giving than with Eid celebrations. Officially, Eid ul-Fitr celebrations commence on the first day of Shawwal – the 10th month of the year\nQurbani is one of the holiest times of the year for Muslims and occurs during the 12th month of the lunar year. For Qurbani to commence, Eid ul-Adha prayers must have been observed. This places Eid ul-Adha after Eid ul-Fitr.\nAs a result of the Islamic calendar being based on the lunar cycle, exact dates for both the Eid’s changes every year."
   },
   {
      "title":"What is Eid ul-Fitr?",
      "detail":"Eid ul-Fitr marks the end of Ramadan and lasts for one day. It is a celebration of Allah (SWT) giving you the strength to get through the Ramadan fast. It entails:\nWaking up early and greeting the family\nPerforming Salah (prayers)\nPerforming ghusl (ablution)\nPreparing clothes (often new attire) and getting ready for the day ahead\nSitting down for breakfast with family and friends\nEnsuring Zakat-ul-Fitr is paid prior to Eid Salah\nPerforming Eid Salah in congregation\nGreeting all fellow Muslims and wishing them a blessed Eid\nVisiting family and friends and celebrating\nFor those who successfully managed to fast, they should thank Allah (SWT) for giving them the strength to get through the trying month of Ramadan. Anyone who missed or broke the fast and is liable to pay Fidya or Kaffarah must ask Allah (SWT) for mercy and the strength to pay their owed dues."
   },
   {
      "title":"Why is Eid ul-Fitr Important?",
      "detail":"Eid ul-Fitr is important because it follows one of the most sacred months of all: Ramadan. Ramadan is a time for Muslims to strengthen their bond with Allah (SWT), recite the Qur’an and exercise great will power. As a reward, Eid ul-Fitr is celebrated."
   },
   {
      "title":"How Many Days is Eid ul-Fitr?",
      "detail":"Eid ul-Fitr lasts for just one day, which is the first day of Shawwal."
   },
   {
      "title":"What is Eid ul-Adha?",
      "detail":"Following the Hajj pilgrimage comes Eid ul-Adha which is considered the great Eid because of its religious significance. Eid ul-Adha is a time to revere the devotion of the Prophet Ibrahim (AS) when he demonstrated his obedience through his preparation to sacrifice his son, Ismail, for Allah (SWT). Allah (SWT) spared Ismail’s (AS) life and swapped him for a ram at the last moment before the sacrifice, revealing that it had been a test.\nThis is commemorated during Eid ul-Adha in the form of Qurbani, the sacrifice of an animal in the name of Allah (SWT). This sacrifice is conducted immediately following the Eid Salah.\nAlthough many of the activities undertaken during Eid ul-Fitr will also happen during Eid ul-Adha, there are some key and important differences. Most notable of all is the act of Qurbani which is the sacrifice of an animal – usually a goat."
   },
   {
      "title":"How Many Day is Eid ul-Adha?",
      "detail":"Eid ul-Adha typically lasts three days."
   },
   {
      "title":"What Links Eid ul-Adha and Eid ul-Fitr?",
      "detail":"Despite the two Eids having different meanings, both are united by charity. Zakat ul-Fitr is given during Eid ul-Fitr at the end of Ramadan and is used to provide food for those who are hungry.\nEid ul-Adha encompasses Qurbani which is the sacrifice of an animal. The animal is then divided into three parts, one of which is given to those who are living in poverty.\nThe spirit of charity is crucial to Islam. It is a key expression of Allah's (SWT) love for us and we are privileged to be able to celebrate with our brothers and sisters around the world."
   }
]