[
   {
      "hadithName":"Revelation",
      "data":[
         {
            "arabic":"حَدَّثَنَا الْحُمَيْدِيُّ عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ ، قَالَ : حَدَّثَنَا سُفْيَانُ ، قَالَ : حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْأَنْصَارِيُّ ، قَالَ : أَخْبَرَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ التَّيْمِيُّ ، أَنَّهُ سَمِعَ عَلْقَمَةَ بْنَ وَقَّاصٍ اللَّيْثِيَّ ، يَقُولُ : سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ عَلَى الْمِنْبَرِ ، قَالَ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، يَقُولُ : \" إِنَّمَا الْأَعْمَالُ بِالنِّيَّاتِ ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى ، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى دُنْيَا يُصِيبُهَا أَوْ إِلَى امْرَأَةٍ يَنْكِحُهَا ، فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ",
            "englishTranslation":"Narrated 'Umar bin Al-Khattab: I heard Allah's Apostle saying, \"The reward of deeds depends upon the intentions and every person will get the reward according to what he has intended. So whoever emigrated for worldly benefits or for a woman to marry, his emigration was for what he emigrated for.",
            "urduTranslation":"´ہم کو حمیدی نے یہ حدیث بیان کی، انہوں نے کہا کہ ہم کو سفیان نے یہ حدیث بیان کی، وہ کہتے ہیں ہم کو یحییٰ بن سعید انصاری نے یہ حدیث بیان کی، انہوں نے کہا کہ مجھے یہ حدیث محمد بن ابراہیم تیمی سے حاصل ہوئی۔ انہوں نے اس حدیث کو علقمہ بن وقاص لیثی سے سنا، ان کا بیان ہے کہ میں نے مسجد نبوی میں منبر رسول صلی اللہ علیہ وسلم پر عمر بن خطاب رضی اللہ عنہ کی زبان سے سنا، وہ فرما رہے تھے کہ میں نے جناب رسول اللہ صلی اللہ علیہ وسلم سے سنا` آپ صلی اللہ علیہ وسلم فرما رہے تھے کہ تمام اعمال کا دارومدار نیت پر ہے اور ہر عمل کا نتیجہ ہر انسان کو اس کی نیت کے مطابق ہی ملے گا۔ پس جس کی ہجرت (ترک وطن) دولت دنیا حاصل کرنے کے لیے ہو یا کسی عورت سے شادی کی غرض ہو۔ پس اس کی ہجرت ان ہی چیزوں کے لیے ہو گی جن کے حاصل کرنے کی نیت سے اس نے ہجرت کی ہے۔"
         },
         {
            "arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ ، قَالَ : أَخْبَرَنَا مَالِكٌ ، عَنْ هِشَامِ بْنِ عُرْوَةَ ، عَنْ أَبِيهِ ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ رَضِيَ اللَّهُ عَنْهَا ، أَنَّ الْحَارِثَ بْنَ هِشَامٍ رَضِيَ اللَّهُ عَنْهُ سَأَل رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَقَالَ : يَا رَسُولَ اللَّهِ ، كَيْفَ يَأْتِيكَ الْوَحْيُ ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \"أَحْيَانًا يَأْتِينِي مِثْلَ صَلْصَلَةِ الْجَرَسِ ، وَهُوَ أَشَدُّهُ عَلَيَّ فَيُفْصَمُ عَنِّي ، وَقَدْ وَعَيْتُ عَنْهُ مَا قَالَ ، وَأَحْيَانًا يَتَمَثَّلُ لِي الْمَلَكُ رَجُلًا فَيُكَلِّمُنِي فَأَعِي مَا يَقُولُ \" ، قَالَتْ عَائِشَةُ رَضِيَ اللَّهُ عَنْهَا : وَلَقَدْ رَأَيْتُهُ يَنْزِلُ عَلَيْهِ الْوَحْيُ فِي الْيَوْمِ الشَّدِيدِ الْبَرْدِ فَيَفْصِمُ عَنْهُ ، وَإِنَّ جَبِينَهُ لَيَتَفَصَّدُ عَرَقًا .",
            "englishTranslation":"Narrated 'Aisha: (the mother of the faithful believers) Al-Harith bin Hisham asked Allah's Apostle \"O Allah's Apostle! How is the Divine Inspiration revealed to you?\" Allah's Apostle replied, \"Sometimes it is (revealed) like the ringing of a bell, this form of Inspiration is the hardest of all and then this state passes off after I have grasped what is inspired. Sometimes the Angel comes in the form of a man and talks to me and I grasp whatever he says.\" 'Aisha added: Verily I saw the Prophet being inspired divinely on a very cold day and noticed the sweat dropping from his forehead (as the Inspiration was over).",
            "urduTranslation":"´ہم کو عبداللہ بن یوسف نے حدیث بیان کی، ان کو مالک نے ہشام بن عروہ کی روایت سے خبر دی، انہوں نے اپنے والد سے نقل کی، انہوں نے ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا سے نقل کی آپ نے فرمایا کہ` ایک شخص حارث بن ہشام نامی نے نبی کریم صلی اللہ علیہ وسلم سے سوال کیا تھا کہ یا رسول اللہ! آپ پر وحی کیسے نازل ہوتی ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ وحی نازل ہوتے وقت کبھی مجھ کو گھنٹی کی سی آواز محسوس ہوتی ہے اور وحی کی یہ کیفیت مجھ پر بہت شاق گذرتی ہے۔ جب یہ کیفیت ختم ہوتی ہے تو میرے دل و دماغ پر اس (فرشتے) کے ذریعہ نازل شدہ وحی محفوظ ہو جاتی ہے اور کسی وقت ایسا ہوتا ہے کہ فرشتہ بشکل انسان میرے پاس آتا ہے اور مجھ سے کلام کرتا ہے۔ پس میں اس کا کہا ہوا یاد رکھ لیتا ہوں۔ عائشہ رضی اللہ عنہا کا بیان ہے کہ میں نے سخت کڑاکے کی سردی میں نبی کریم صلی اللہ علیہ وسلم کو دیکھا ہے کہ آپ صلی اللہ علیہ وسلم پر وحی نازل ہوئی اور جب اس کا سلسلہ موقوف ہوا تو آپ صلی اللہ علیہ وسلم کی پیشانی پسینے سے شرابور تھی۔"
         },
         {
            "arabic":"قَالَ ابْنُ شِهَابٍ : وَأَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ ، أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ الْأَنْصَارِيَّ ، قَالَ وَهُوَ يُحَدِّثُ عَنْ فَتْرَةِ الْوَحْيِ ، فَقَالَ فِي حَدِيثِهِ : بَيْنَا أَنَا أَمْشِي إِذْ سَمِعْتُ صَوْتًا مِنَ السَّمَاءِ فَرَفَعْتُ بَصَرِي ، فَإِذَا الْمَلَكُ الَّذِي جَاءَنِي بِحِرَاءٍ جَالِسٌ عَلَى كُرْسِيٍّ بَيْنَ السَّمَاءِ وَالْأَرْضِ ، فَرُعِبْتُ مِنْهُ فَرَجَعْتُ ، فَقُلْتُ : زَمِّلُونِي ، فَأَنْزَلَ اللَّهُ تَعَالَى : \" يَأَيُّهَا الْمُدَّثِّرُ { 1 } قُمْ فَأَنْذِرْ { 2 } \" سورة المدثر آية 1-2 ، فَحَمِيَ الْوَحْيُ وَتَتَابَعَ ، تَابَعَهُ عَبْدُ اللَّهِ بْنُ يُوسُفَ ، وَأَبُو صَالِحٍ ، وَتَابَعَهُ هِلَالُ بْنُ رَدَّادٍ ، عَنِ الزُّهْرِيِّ ، وَقَالَ يُونُسُ ، وَمَعْمَرٌ بَوَادِرُهُ .",
            "englishTranslation":"Narrated Jabir bin 'Abdullah Al-Ansari while talking about the period of pause in revelation reporting the speech of the Prophet \"While I was walking, all of a sudden I heard a voice from the sky. I looked up and saw the same angel who had visited me at the cave of Hira' sitting on a chair between the sky and the earth. I got afraid of him and came back home and said, 'Wrap me (in blankets).' And then Allah revealed the following Holy Verses (of Quran): 'O you (i.e. Muhammad)! wrapped up in garments!' Arise and warn (the people against Allah's Punishment),... up to 'and desert the idols.' (74.1-5) After this the revelation started coming strongly, frequently and regularly.",
            "urduTranslation":"´ابن شہاب کہتے ہیں مجھ کو ابوسلمہ بن عبدالرحمٰن نے جابر بن عبداللہ انصاری رضی اللہ عنہما سے یہ روایت نقل کی کہ` آپ صلی اللہ علیہ وسلم نے وحی کے رک جانے کے زمانے کے حالات بیان فرماتے ہوئے کہا کہ ایک روز میں چلا جا رہا تھا کہ اچانک میں نے آسمان کی طرف ایک آواز سنی اور میں نے اپنا سر آسمان کی طرف اٹھایا کیا دیکھتا ہوں کہ وہی فرشتہ جو میرے پاس غار حرا میں آیا تھا وہ آسمان و زمین کے بیچ میں ایک کرسی پر بیٹھا ہوا ہے۔ میں اس سے ڈر گیا اور گھر آنے پر میں نے پھر کمبل اوڑھنے کی خواہش ظاہر کی۔ اس وقت اللہ پاک کی طرف سے یہ آیات نازل ہوئیں۔ اے لحاف اوڑھ کر لیٹنے والے! اٹھ کھڑا ہو اور لوگوں کو عذاب الٰہی سے ڈرا اور اپنے رب کی بڑائی بیان کر اور اپنے کپڑوں کو پاک صاف رکھ اور گندگی سے دور رہ۔ اس کے بعد وحی تیزی کے ساتھ پے در پے آنے لگی۔ اس حدیث کو یحییٰ بن بکیر کے علاوہ لیث بن سعد سے عبداللہ بن یوسف اور ابوصالح نے بھی روایت کیا ہے۔ اور عقیل کے علاوہ زہری سے ہلال بن رواد نے بھی روایت کیا ہے۔ یونس اور معمر نے اپنی روایت میں لفظ «فواده» کی جگہ «بوادره» نقل کیا ہے۔"
         },
         {
            "arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ ، قَالَ : حَدَّثَنَا أَبُو عَوَانَةُ ، قَالَ : حَدَّثَنَا مُوسَى بْنُ أَبِي عَائِشَةَ ، قَالَ : حَدَّثَنَا سَعِيدُ بْنُ جُبَيْرٍ ، عَنِ ابْنِ عَبَّاسٍ ، فِي قَوْلِهِ تَعَالَى : \" لا تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ سورة القيامة آية 16 ، قَالَ : كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعَالِجُ مِنَ التَّنْزِيلِ شِدَّةً ، وَكَانَ مِمَّا يُحَرِّكُ شَفَتَيْهِ ، فَقَالَ ابْنُ عَبَّاسٍ : فَأَنَا أُحَرِّكُهُمَا لَكُمْ كَمَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحَرِّكُهُمَا ، وَقَالَ سَعِيدٌ : أَنَا أُحَرِّكُهُمَا كَمَا رَأَيْتُ ابْنَ عَبَّاسٍ يُحَرِّكُهُمَا ، فَحَرَّكَ شَفَتَيْهِ ، فَأَنْزَلَ اللَّهُ تَعَالَى : لا تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ { 16 } إِنَّ عَلَيْنَا جَمْعَهُ وَقُرْءَانَهُ { 17 } سورة القيامة آية 16-17 ، قَالَ : جَمْعُهُ لَهُ فِي صَدْرِكَ وَتَقْرَأَهُ ، فَإِذَا قَرَأْنَاهُ فَاتَّبِعْ قُرْءَانَهُ سورة القيامة آية 18 ، قَالَ : فَاسْتَمِعْ لَهُ وَأَنْصِتْ ثُمَّ إِنَّ عَلَيْنَا بَيَانَهُ سورة القيامة آية 19 ، ثُمَّ إِنَّ عَلَيْنَا أَنْ تَقْرَأَهُ ، فَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ ذَلِكَ إِذَا أَتَاهُ جِبْرِيلُ اسْتَمَعَ ، فَإِذَا انْطَلَقَ جِبْرِيلُ قَرَأَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا قَرَأَهُ",
            "englishTranslation":"Narrated Said bin Jubair: Ibn 'Abbas in the explanation of the statement of Allah \"Move not your tongue concerning (the Quran) to make haste therewith.\" (75.16) said \"Allah's Apostle used to bear the revelation with great trouble and used to move his lips (quickly) with the Inspiration.\" Ibn 'Abbas moved his lips saying, \"I am moving my lips in front of you as Allah's Apostle used to move his.\" Said moved his lips saying: \"I am moving my lips, as I saw Ibn 'Abbas moving his.\" Ibn 'Abbas added, \"So Allah revealed 'Move not your tongue concerning (the Qur'an) to make haste therewith. It is for Us to collect it and to give you (O Muhammad) the ability to recite it (the Quran)' (75.16-17) which means that Allah will make him (the Prophet) remember the portion of the Qur'an which was revealed at that time by heart and recite it. The statement of Allah: 'And when we have recited it to you (O Muhammad through Gabriel) then you follow its (Quran) recital' (75.18) means 'listen to it and be silent.' Then it is for Us (Allah) to make it clear to you' (75.19) means 'Then it is (for Allah) to make you recite it (and its meaning will be clear by itself through your tongue). Afterwards, Allah's Apostle used to listen to Gabriel whenever he came and after his departure he used to recite it as Gabriel had recited it.",
            "urduTranslation":"´موسیٰ بن اسماعیل نے ہم سے حدیث بیان کی، ان کو ابوعوانہ نے خبر دی، ان سے موسیٰ ابن ابی عائشہ نے بیان کی، ان سے سعید بن جبیر نے` انہوں نے ابن عباس رضی اللہ عنہما سے کلام الٰہی «لا تحرك به لسانك لتعجل به‏» الخ کی تفسیر کے سلسلہ میں سنا کہ رسول اللہ صلی اللہ علیہ وسلم نزول قرآن کے وقت بہت سختی محسوس فرمایا کرتے تھے اور اس کی (علامتوں) میں سے ایک یہ تھی کہ یاد کرنے کے لیے آپ اپنے ہونٹوں کو ہلاتے تھے۔ ابن عباس رضی اللہ عنہما نے کہا میں اپنے ہونٹ ہلاتا ہوں جس طرح آپ ہلاتے تھے۔ سعید کہتے ہیں میں بھی اپنے ہونٹ ہلاتا ہوں جس طرح ابن عباس رضی اللہ عنہما کو میں نے ہلاتے دیکھا۔ پھر انہوں نے اپنے ہونٹ ہلائے۔ (ابن عباس رضی اللہ عنہما نے کہا) پھر یہ آیت اتری کہ اے محمد! قرآن کو جلد جلد یاد کرنے کے لیے اپنی زبان نہ ہلاؤ۔ اس کا جمع کر دینا اور پڑھا دینا ہمارا ذمہ ہے۔ ابن عباس رضی اللہ عنہما کہتے ہیں یعنی قرآن آپ صلی اللہ علیہ وسلم کے دل میں جما دینا اور پڑھا دینا ہمارے ذمہ ہے۔ پھر جب ہم پڑھ چکیں تو اس پڑھے ہوئے کی اتباع کرو۔ ابن عباس رضی اللہ عنہما فرماتے ہیں (اس کا مطلب یہ ہے) کہ آپ اس کو خاموشی کے ساتھ سنتے رہو۔ اس کے بعد مطلب سمجھا دینا ہمارے ذمہ ہے۔ پھر یقیناً یہ ہماری ذمہ داری ہے کہ آپ اس کو پڑھو (یعنی اس کو محفوظ کر سکو) چنانچہ اس کے بعد جب آپ کے پاس جبرائیل علیہ السلام (وحی لے کر) آتے تو آپ (توجہ سے) سنتے۔ جب وہ چلے جاتے تو رسول اللہ صلی اللہ علیہ وسلم اس (وحی) کو اسی طرح پڑھتے جس طرح جبرائیل علیہ السلام نے اسے پڑھا تھا۔"
         },
         {
            "arabic":"حَدَّثَنَا عَبْدَانُ ، قَالَ : أَخْبَرَنَا عَبْدُ اللَّهِ ، قَالَ : أَخْبَرَنَا يُونُسُ ، عَنِ الزُّهْرِيِّ . ح وحَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ ، قَالَ : أَخْبَرَنَا عَبْدُ اللَّهِ ، قَالَ : أَخْبَرَنَا يُونُسُ وَمَعْمَرٌ ، عَنِ الزُّهْرِيِّ نَحْوَهُ ، قَالَ : أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ ، عَنِ ابْنِ عَبَّاسٍ ، قَالَ : \" كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَجْوَدَ النَّاسِ ، وَكَانَ أَجْوَدُ مَا يَكُونُ فِي رَمَضَانَ حِينَ يَلْقَاهُ جِبْرِيلُ ، وَكَانَ يَلْقَاهُ فِي كُلِّ لَيْلَةٍ مِنْ رَمَضَانَ فَيُدَارِسُهُ الْقُرْآنَ ، فَلَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَجْوَدُ بِالْخَيْرِ مِنَ الرِّيحِ الْمُرْسَلَةِ",
            "englishTranslation":"Narrated Ibn 'Abbas: Allah's Apostle was the most generous of all the people, and he used to reach the peak in generosity in the month of Ramadan when Gabriel met him. Gabriel used to meet him every night of Ramadan to teach him the Qur'an. Allah's Apostle was the most generous person, even more generous than the strong uncontrollable wind (in readiness and haste to do charitable deeds).",
            "urduTranslation":"´ہم کو عبدان نے حدیث بیان کی، انہیں عبداللہ بن مبارک نے خبر دی، ان کو یونس نے، انہوں نے زہری سے یہ حدیث سنی۔ (دوسری سند یہ ہے کہ) ہم سے بشر بن محمد نے یہ حدیث بیان کی۔ ان سے عبداللہ بن مبارک نے، ان سے یونس اور معمر دونوں نے، ان دونوں نے زہری سے روایت کی پہلی سند کے مطابق زہری سے عبیداللہ بن عبداللہ نے، انہوں نے ابن عباس رضی اللہ عنہما سے یہ روایت نقل کی کہ` رسول اللہ صلی اللہ علیہ وسلم سب لوگوں سے زیادہ جواد (سخی) تھے اور رمضان میں (دوسرے اوقات کے مقابلہ میں جب) جبرائیل علیہ السلام آپ صلی اللہ علیہ وسلم سے ملتے بہت ہی زیادہ جود و کرم فرماتے۔ جبرائیل علیہ السلام رمضان کی ہر رات میں آپ صلی اللہ علیہ وسلم سے ملاقات کرتے اور آپ صلی اللہ علیہ وسلم کے ساتھ قرآن کا دورہ کرتے، غرض نبی کریم صلی اللہ علیہ وسلم لوگوں کو بھلائی پہنچانے میں بارش لانے والی ہوا سے بھی زیادہ جود و کرم فرمایا کرتے تھے۔"
         }
      ]
   },
   {
      "hadithName":"Belief Faith",
      "data":[
         {
            "arabic":"حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى ، قَالَ : أَخْبَرَنَا حَنْظَلَةُ بْنُ أَبِي سُفْيَانَ ، عَنْ عِكْرِمَةَ بْنِ خَالِدٍ ، عَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" بُنِيَ الْإِسْلَامُ عَلَى خَمْسٍ ، شَهَادَةِ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ ، وَإِقَامِ الصَّلَاةِ ، وَإِيتَاءِ الزَّكَاةِ ، وَالْحَجِّ ، وَصَوْمِ رَمَضَانَ",
            "englishTranslation":"Narrated Ibn 'Umar: Allah's Apostle said: Islam is based on (the following) five (principles): 1. To testify that none has the right to be worshipped but Allah and Muhammad is Allah's Apostle. 2. To offer the (compulsory congregational) prayers dutifully and perfectly. 3. To pay Zakat (i.e. obligatory charity) . 4. To perform Hajj. (i.e. Pilgrimage to Mecca) 5. To observe fast during the month of Ramadan.",
            "urduTranslation":"´ہم سے عبیداللہ بن موسیٰ نے یہ حدیث بیان کی۔ انہوں نے کہا کہ ہمیں اس کی بابت حنظلہ بن ابی سفیان نے خبر دی۔ انہوں نے عکرمہ بن خالد سے روایت کی انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے روایت کی کہ` رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اسلام کی بنیاد پانچ چیزوں پر قائم کی گئی ہے۔ اول گواہی دینا کہ اللہ کے سوا کوئی معبود نہیں اور بیشک محمد صلی اللہ علیہ وسلم اللہ کے سچے رسول ہیں اور نماز قائم کرنا اور زکوٰۃ ادا کرنا اور حج کرنا اور رمضان کے روزے رکھنا۔"
         },
         {
            "arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ ، قَالَ : حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ ، قَالَ : حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ ، عَنْ أَبِي صَالِحٍ ، عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْه ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، قَالَ : \" الْإِيمَانُ بِضْعٌ وَسِتُّونَ شُعْبَةً ، وَالْحَيَاءُ شُعْبَةٌ مِنَ الْإِيمَانِ",
            "englishTranslation":"Narrated Abu Huraira: The Prophet said, \"Faith (Belief) consists of more than sixty branches (i.e. parts). And Haya (This term \"Haya\" covers a large number of concepts which are to be taken together; amongst them are self respect, modesty, bashfulness, and scruple, etc.) is a part of faith.",
            "urduTranslation":"´ہم سے بیان کیا عبداللہ بن محمد جعفی نے، انہوں نے کہا ہم سے بیان کیا ابوعامر عقدی نے، انہوں نے کہا ہم سے بیان کیا سلیمان بن بلال نے، انہوں نے عبداللہ بن دینار سے، انہوں نے روایت کیا ابوصالح سے، انہوں نے نقل کیا ابوہریرہ رضی اللہ عنہ سے، انہوں نے نقل فرمایا جناب نبی کریم صلی اللہ علیہ وسلم سے` آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایمان کی ساٹھ سے کچھ اوپر شاخیں ہیں۔ اور حیاء (شرم) بھی ایمان کی ایک شاخ ہے۔"
         },
         {
            "arabic":"حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ ، قَالَ : حَدَّثَنَا شُعْبَةُ ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي السَّفَرِ ، وَإِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ ، عَنْ الشَّعْبِيِّ ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو رَضِيَ اللَّهُ عَنْهُمَا ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، قَالَ : \" الْمُسْلِمُ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ ، وَالْمُهَاجِرُ مَنْ هَجَرَ مَا نَهَى اللَّهُ عَنْهُ \" ، قَالَ أَبُو عَبْد اللَّهِ : وَقَالَ أَبُو مُعَاوِيَةَ : حَدَّثَنَا دَاوُد ، عَنْ عَامِرٍ ، قَالَ : سَمِعْتُ عَبْدَ اللَّهِ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، وَقَالَ عَبْدُ الْأَعْلَى : عَنْ دَاوُدَ ، عَنْ عَامِرٍ ، عَنْ عَبْدِ اللَّهِ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ .",
            "englishTranslation":"Narrated 'Abdullah bin 'Amr: The Prophet said, \"A Muslim is the one who avoids harming Muslims with his tongue and hands. And a Muhajir (emigrant) is the one who gives up (abandons) all what Allah has forbidden.",
            "urduTranslation":"´ہم سے آدم بن ابی ایاس نے یہ حدیث بیان کی، ان کو شعبہ نے وہ عبداللہ بن ابی السفر اور اسماعیل سے روایت کرتے ہیں، وہ دونوں شعبی سے نقل کرتے ہیں، انہوں نے عبداللہ بن عمرو بن عاص رضی اللہ عنہما سے، وہ نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ` آپ صلی اللہ علیہ وسلم نے فرمایا مسلمان وہ ہے جس کی زبان اور ہاتھ سے مسلمان بچے رہیں اور مہاجر وہ ہے جو ان کاموں کو چھوڑ دے جن سے اللہ نے منع فرمایا۔ ابوعبداللہ (امام بخاری رحمہ اللہ) نے فرمایا اور ابومعاویہ نے کہ ہم کو حدیث بیان کی داؤد بن ابی ہند نے، انہوں نے روایت کی عامر شعبی سے، انہوں نے کہا کہ میں نے سنا عبداللہ بن عمرو بن عاص سے، وہ حدیث بیان کرتے ہیں جناب نبی کریم صلی اللہ علیہ وسلم سے (وہی مذکورہ حدیث) اور کہا کہ عبدالاعلیٰ نے روایت کیا داؤد سے، انہوں نے عامر سے، انہوں نے عبداللہ بن عمرو بن عاص سے، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے۔"
         },
         {
            "arabic":"حَدَّثَنَا سَعِيدُ بْنُ يَحْيَى بْنِ سَعِيدٍ الْقُرَشِيِّ ، قَالَ : حَدَّثَنَا أَبِي ، قَالَ : حَدَّثَنَا أَبُو بُرْدَةَ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي بُرْدَةَ ، عَنْ أَبِي بُرْدَةَ ، عَنْ أَبِي مُوسَى رَضِيَ اللَّهُ عَنْهُ ، قَالَ : قَالُوا : يَا رَسُولَ اللَّهِ ، أَيُّ الْإِسْلَامِ أَفْضَلُ ؟ قَالَ : \"   مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ \" .",
            "englishTranslation":"Narrated Abu Musa: Some people asked Allah's Apostle, \"Whose Islam is the best? i.e. (Who is a very good Muslim)?\" He replied, \"One who avoids harming the Muslims with his tongue and hands.",
            "urduTranslation":"´ہم کو سعید بن یحییٰ بن سعید اموی قریشی نے یہ حدیث سنائی، انہوں نے اس حدیث کو اپنے والد سے نقل کیا، انہوں نے ابوبردہ بن عبداللہ بن ابی بردہ سے، انہوں نے ابی بردہ سے، انہوں نے ابوموسیٰ رضی اللہ عنہ سے، وہ کہتے ہیں کہ` لوگوں نے پوچھا یا رسول اللہ! کون سا اسلام افضل ہے؟ تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا وہ جس کے ماننے والے مسلمانوں کی زبان اور ہاتھ سے سارے مسلمان سلامتی میں رہیں۔"
         },
         {
            "arabic":"حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ ، قَالَ : حَدَّثَنَا اللَّيْثُ ، عَنْ ، يَزِيدَ ، عَنْ أَبِي الْخَيْرِ ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو رَضِيَ اللَّهُ عَنْهُمَا ، أَنَّ رَجُلًا سَأَلَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، أَيُّ الْإِسْلَامِ خَيْرٌ ؟ قَالَ : \" تُطْعِمُ الطَّعَامَ ، وَتَقْرَأُ السَّلَامَ عَلَى مَنْ عَرَفْتَ وَمَنْ لَمْ تَعْرِفْ",
            "englishTranslation":"Narrated 'Abdullah bin 'Amr: A man asked the Prophet , \"What sort of deeds or (what qualities of) Islam are good?\" The Prophet replied, 'To feed (the poor) and greet those whom you know and those whom you do not Know.",
            "urduTranslation":"´ہم سے حدیث بیان کی عمرو بن خالد نے، ان کو لیث نے، وہ روایت کرتے ہیں یزید سے، وہ ابوالخیر سے، وہ عبداللہ بن عمرو بن عاص رضی اللہ عنہما سے کہ` ایک دن ایک آدمی نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا کہ کون سا اسلام بہتر ہے؟ فرمایا کہ تم کھانا کھلاؤ، اور جس کو پہچانو اس کو بھی اور جس کو نہ پہچانو اس کو بھی، الغرض سب کو سلام کرو۔"
         }
      ]
   },
   {
      "hadithName":"Knowledge",
      "data":[
         {
            "arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ ، قَالَ : حَدَّثَنَا فُلَيْحٌ . ح وحَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ ، قَالَ : حَدَّثَنَا مُحَمَّدُ بْنُ فُلَيْحٍ ، قَالَ : حَدَّثَنِي أَبِي ، قَالَ : حَدَّثَنِي هِلَالُ بْنُ عَلِيٍّ ، عَنْ عَطَاءِ بْنِ يَسَارٍ ، عَنْ أَبِي هُرَيْرَةَ ، قَالَ : \" بَيْنَمَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَجْلِسٍ يُحَدِّثُ الْقَوْمَ جَاءَهُ أَعْرَابِيٌّ ، فَقَالَ : مَتَى السَّاعَةُ ؟ فَمَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحَدِّثُ ، فَقَالَ بَعْضُ الْقَوْمِ : سَمِعَ مَا قَالَ ، فَكَرِهَ مَا قَالَ ، وَقَالَ بَعْضُهُمْ : بَلْ لَمْ يَسْمَعْ ، حَتَّى إِذَا قَضَى حَدِيثَهُ ، قَالَ : أَيْنَ أُرَاهُ السَّائِلُ عَنِ السَّاعَةِ ؟ قَالَ : هَا أَنَا يَا رَسُولَ اللَّهِ ، قَالَ : فَإِذَا ضُيِّعَتِ الْأَمَانَةُ فَانْتَظِرِ السَّاعَةَ ، قَالَ : كَيْفَ إِضَاعَتُهَا ؟ قَالَ : إِذَا وُسِّدَ الْأَمْرُ إِلَى غَيْرِ أَهْلِهِ فَانْتَظِرِ السَّاعَةَ",
            "englishTranslation":"Narrated Abu Huraira: While the Prophet was saying something in a gathering, a Bedouin came and asked him, \"When would the Hour (Doomsday) take place?\" Allah's Apostle continued his talk, so some people said that Allah's Apostle had heard the question, but did not like what that Bedouin had asked. Some of them said that Allah's Apostle had not heard it. When the Prophet finished his speech, he said, \"Where is the questioner, who inquired about the Hour (Doomsday)?\" The Bedouin said, \"I am here, O Allah's Apostle .\" Then the Prophet said, \"When honesty is lost, then wait for the Hour (Doomsday).\" The Bedouin said, \"How will that be lost?\" The Prophet said, \"When the power or authority comes in the hands of unfit persons, then wait for the Hour (Doomsday.)\"",
            "urduTranslation":"´ہم سے محمد بن سنان نے بیان کیا، کہا ہم سے فلیح نے بیان کیا (دوسری سند) اور مجھ سے ابراہیم بن المنذر نے بیان کیا، کہا مجھ سے میرے باپ (فلیح) نے بیان کیا، کہا ہلال بن علی نے، انہوں نے عطاء بن یسار سے نقل کیا، انہوں نے ابوہریرہ رضی اللہ عنہ سے کہ` ایک بار نبی کریم صلی اللہ علیہ وسلم لوگوں میں بیٹھے ہوئے ان سے باتیں کر رہے تھے۔ اتنے میں ایک دیہاتی آپ کے پاس آیا اور پوچھنے لگا کہ قیامت کب آئے گی؟ آپ صلی اللہ علیہ وسلم اپنی گفتگو میں مصروف رہے۔ بعض لوگ (جو مجلس میں تھے) کہنے لگے آپ صلی اللہ علیہ وسلم نے دیہاتی کی بات سنی لیکن پسند نہیں کی اور بعض کہنے لگے کہ نہیں بلکہ آپ نے اس کی بات سنی ہی نہیں۔ جب آپ صلی اللہ علیہ وسلم اپنی باتیں پوری کر چکے تو میں سمجھتا ہوں کہ آپ صلی اللہ علیہ وسلم نے یوں فرمایا وہ قیامت کے بارے میں پوچھنے والا کہاں گیا اس (دیہاتی) نے کہا (یا رسول اللہ!) میں موجود ہوں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جب امانت (ایمانداری دنیا سے) اٹھ جائے تو قیامت قائم ہونے کا انتظار کر۔ اس نے کہا ایمانداری اٹھنے کا کیا مطلب ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جب (حکومت کے کاروبار) نالائق لوگوں کو سونپ دئیے جائیں تو قیامت کا انتظار کر۔"
         },
         {
            "arabic":"حَدَّثَنَا أَبُو النُّعْمَانِ عَارِمُ بْنُ الْفَضْلِ ، قَالَ : حَدَّثَنَا أَبُو عَوَانَةَ ، عَنْ أَبِي بِشْرٍ ، عَنْ يُوسُفَ بْنِ مَاهَكَ ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو ، قَالَ : تَخَلَّفَ عَنَّا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفْرَةٍ سَافَرْنَاهَا ، فَأَدْرَكَنَا وَقَدْ أَرْهَقَتْنَا الصَّلَاةُ وَنَحْنُ نَتَوَضَّأُ ، فَجَعَلْنَا نَمْسَحُ عَلَى أَرْجُلِنَا ، فَنَادَى بِأَعْلَى صَوْتِهِ : \" وَيْلٌ لِلْأَعْقَابِ مِنَ النَّارِ مَرَّتَيْنِ أَوْ ثَلَاثًا \"",
            "englishTranslation":"Narrated `Abdullah bin `Amr: Once the Prophet remained behind us in a journey. He joined us while we were performing ablution for the prayer which was over-due. We were just passing wet hands over our feet (and not washing them properly) so the Prophet addressed us in a loud voice and said twice or thrice: \"Save your heels from the fire\"",
            "urduTranslation":"´ہم سے ابوالنعمان نے بیان کیا، کہا ہم سے ابوعوانہ نے ابوبشر سے بیان کیا، انہوں نے یوسف بن ماہک سے، انہوں نے عبداللہ بن عمرو سے، انہوں نے کہا` ایک سفر میں جو ہم نے کیا تھا نبی کریم صلی اللہ علیہ وسلم ہم سے پیچھے رہ گئے اور آپ صلی اللہ علیہ وسلم ہم سے اس وقت ملے جب (عصر کی) نماز کا وقت آن پہنچا تھا ہم (جلدی جلدی) وضو کر رہے تھے۔ پس پاؤں کو خوب دھونے کے بدل ہم یوں ہی سا دھو رہے تھے۔ (یہ حال دیکھ کر) آپ صلی اللہ علیہ وسلم نے بلند آواز سے پکارا دیکھو ایڑیوں کی خرابی دوزخ سے ہونے والی ہے دو یا تین بار آپ صلی اللہ علیہ وسلم نے (یوں ہی بلند آواز سے) فرمایا۔"
         },
         {
            "arabic":"حَدَّثَنَا قُتَيْبَةُ ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ ، عَنْ ابْنِ عُمَرَ ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" إِنَّ مِنَ الشَّجَرِ شَجَرَةً لَا يَسْقُطُ وَرَقُهَا وَإِنَّهَا مَثَلُ الْمُسْلِمِ ، فَحَدِّثُونِي مَا هِيَ ؟ فَوَقَعَ النَّاسُ فِي شَجَرِ الْبَوَادِي ، قَالَ عَبْدُ اللَّهِ : وَوَقَعَ فِي نَفْسِي أَنَّهَا النَّخْلَةُ ، ثُمَّ قَالُوا : حَدِّثْنَا مَا هِيَ يَا رَسُولَ اللَّهِ ؟ قَالَ : هِيَ النَّخْلَةُ \" .",
            "englishTranslation":"Narrated Ibn `Umar: Allah's Apostle said, \"Amongst the trees, there is a tree, the leaves of which do not fall and is like a Muslim. Tell me the name of that tree.\" Everybody started thinking about the trees of the desert areas. And I thought of the date-palm tree but felt shy to answer the others then asked, \"What is that tree, O Allah's Apostle ?\" He replied, \"It is the date-palm tree.\"",
            "urduTranslation":"´ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے اسماعیل بن جعفر نے بیان کیا، انہوں نے عبداللہ بن دینار سے، انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے کہا کہ` نبی کریم صلی اللہ علیہ وسلم نے فرمایا درختوں میں ایک درخت ایسا ہے کہ اس کے پتے نہیں جھڑتے اور مسلمان کی مثال اسی درخت کی سی ہے۔ بتاؤ وہ کون سا درخت ہے؟ یہ سن کر لوگوں کا خیال جنگل کے درختوں کی طرف دوڑا۔ عبداللہ رضی اللہ عنہ نے کہا میرے دل میں آیا کہ وہ کھجور کا درخت ہے۔ مگر میں اپنی (کم سنی کی) شرم سے نہ بولا۔ آخر صحابہ نے نبی کریم صلی اللہ علیہ وسلم ہی سے پوچھا کہ وہ کون سا درخت ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا وہ کھجور کا درخت ہے۔"
         },
         {
            "arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ ، قَالَ : حَدَّثَنَا اللَّيْثُ ، عَنْ سَعِيدٍ هُوَ الْمَقْبُرِيُّ ، عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِك ، يَقُولُ : \" بَيْنَمَا نَحْنُ جُلُوسٌ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ ، دَخَلَ رَجُلٌ عَلَى جَمَلٍ فَأَنَاخَهُ فِي الْمَسْجِدِ ، ثُمَّ عَقَلَهُ ، ثُمَّ قَالَ لَهُمْ : أَيُّكُمْ مُحَمَّدٌ ؟ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُتَّكِئٌ بَيْنَ ظَهْرَانَيْهِمْ ، فَقُلْنَا : هَذَا الرَّجُلُ الْأَبْيَضُ الْمُتَّكِئُ ، فَقَالَ لَهُ الرَّجُلُ : يَا ابْنَ عَبْدِ الْمُطَّلِبِ ، فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : قَدْ أَجَبْتُكَ ، فَقَالَ الرَّجُلُ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : إِنِّي سَائِلُكَ ، فَمُشَدِّدٌ عَلَيْكَ فِي الْمَسْأَلَةِ فَلَا تَجِدْ عَلَيَّ فِي نَفْسِكَ ، فَقَالَ : سَلْ عَمَّا بَدَا لَكَ ، فَقَالَ : أَسْأَلُكَ بِرَبِّكَ وَرَبِّ مَنْ قَبْلَكَ ، آللَّهُ أَرْسَلَكَ إِلَى النَّاسِ كُلِّهِمْ ؟ فَقَالَ : اللَّهُمَّ نَعَمْ ، قَالَ : أَنْشُدُكَ بِاللَّهِ ، آللَّهُ أَمَرَكَ أَنْ نُصَلِّيَ الصَّلَوَاتِ الْخَمْسَ فِي الْيَوْمِ وَاللَّيْلَةِ ؟ قَالَ : اللَّهُمَّ نَعَمْ ، قَالَ : أَنْشُدُكَ بِاللَّهِ ، آللَّهُ أَمَرَكَ أَنْ نَصُومَ هَذَا الشَّهْرَ مِنَ السَّنَةِ ، قَالَ : اللَّهُمَّ نَعَمْ ، قَالَ : أَنْشُدُكَ بِاللَّهِ ، آللَّهُ أَمَرَكَ أَنْ تَأْخُذَ هَذِهِ الصَّدَقَةَ مِنْ أَغْنِيَائِنَا فَتَقْسِمَهَا عَلَى فُقَرَائِنَا ، فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : اللَّهُمَّ نَعَمْ ، فَقَالَ الرَّجُلُ : آمَنْتُ بِمَا جِئْتَ بِهِ ، وَأَنَا رَسُولُ مَنْ وَرَائِي مِنْ قَوْمِي ، وَأَنَا ضِمَامُ بْنُ ثَعْلَبَةَ أَخُو بَنِي سَعْدِ بْنِ بَكْرٍ \" ، وَرَوَاهُ مُوسَى ، وَعَلِيُّ بْنُ عَبْدِ الْحَمِيدِ ، عَنْ سُلَيْمَانَ ، عَنْ ثَابِتٍ ، عَنْ أَنَسٍ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا .",
            "englishTranslation":"Narrated Anas bin Malik: While we were sitting with the Prophet in the mosque, a man came riding on a camel. He made his camel kneel down in the mosque, tied its foreleg and then said: \"Who amongst you is Muhammad?\" At that time the Prophet was sitting amongst us (his companions) leaning on his arm. We replied, \"This white man reclining on his arm.\" The man then addressed him, \"O Son of `Abdul Muttalib.\" The Prophet said, \"I am here to answer your questions.\" The man said to the Prophet, \"I want to ask you something and will be hard in questioning. So do not get angry.\" The Prophet said, \"Ask whatever you want.\" The man said, \"I ask you by your Lord, and the Lord of those who were before you, has Allah sent you as an Apostle to all the mankind?\" The Prophet replied, \"By Allah, yes.\" The man further said, \"I ask you by Allah. Has Allah ordered you to offer five prayers in a day and night (24 hours).? He replied, \"By Allah, Yes.\" The man further said, \"I ask you by Allah! Has Allah ordered you to observe fasts during this month of the year (i.e. Ramadan)?\" He replied, \"By Allah, Yes.\" The man further said, \"I ask you by Allah. Has Allah ordered you to take Zakat (obligatory charity) from our rich people and distribute it amongst our poor people?\" The Prophet replied, \"By Allah, yes.\" Thereupon that man said, \"I have believed in all that with which you have been sent, and I have been sent by my people as a messenger, and I am Dimam bin Tha`laba from the brothers of Bani Sa`d bin Bakr.\"",
            "urduTranslation":"´ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم سے لیث نے بیان کیا، انہوں نے سعید مقبری سے، انہوں نے شریک بن عبداللہ بن ابی نمر سے، انہوں نے انس بن مالک سے سنا کہ` ایک بار ہم مسجد میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ بیٹھے ہوئے تھے، اتنے میں ایک شخص اونٹ پر سوار ہو کر آیا اور اونٹ کو مسجد میں بٹھا کر باندھ دیا۔ پھر پوچھنے لگا (بھائیو) تم لوگوں میں محمد ( صلی اللہ علیہ وسلم ) کون سے ہیں۔ نبی کریم صلی اللہ علیہ وسلم اس وقت لوگوں میں تکیہ لگائے بیٹھے ہوئے تھے۔ ہم نے کہا () محمد ( صلی اللہ علیہ وسلم ) یہ سفید رنگ والے بزرگ ہیں جو تکیہ لگائے ہوئے تشریف فرما ہیں۔ تب وہ آپ سے مخاطب ہوا کہ اے عبدالمطلب کے فرزند! آپ صلی اللہ علیہ وسلم نے فرمایا۔ کہو میں آپ کی بات سن رہا ہوں۔ وہ بولا میں آپ صلی اللہ علیہ وسلم سے کچھ دینی باتیں دریافت کرنا چاہتا ہوں اور ذرا سختی سے بھی پوچھوں گا تو آپ اپنے دل میں برا نہ مانئے گا۔ آپ صلی اللہ علیہ وسلم نے فرمایا نہیں جو تمہارا دل چاہے پوچھو۔ تب اس نے کہا کہ میں آپ کو آپ کے رب اور اگلے لوگوں کے رب تبارک وتعالیٰ کی قسم دے کر پوچھتا ہوں کیا آپ کو اللہ نے دنیا کے سب لوگوں کی طرف رسول بنا کر بھیجا ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا ہاں یا میرے اللہ! پھر اس نے کہا میں آپ صلی اللہ علیہ وسلم کو اللہ کی قسم دیتا ہوں کیا اللہ نے آپ صلی اللہ علیہ وسلم کو رات دن میں پانچ نمازیں پڑھنے کا حکم فرمایا ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا ہاں یا میرے اللہ! پھر کہنے لگا میں آپ کو اللہ کی قسم دے کر پوچھتا ہوں کہ کیا اللہ نے آپ کو یہ حکم دیا ہے کہ سال بھر میں اس مہینہ رمضان کے روزے رکھو۔ آپ صلی اللہ علیہ وسلم نے فرمایا ہاں یا میرے اللہ! پھر کہنے لگا میں آپ صلی اللہ علیہ وسلم کو اللہ کی قسم دے کر پوچھتا ہوں کہ کیا اللہ نے آپ کو یہ حکم دیا ہے کہ آپ ہم میں سے جو مالدار لوگ ہیں ان سے زکوٰۃ وصول کر کے ہمارے محتاجوں میں بانٹ دیا کریں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ہاں یا میرے اللہ! تب وہ شخص کہنے لگا جو حکم آپ صلی اللہ علیہ وسلم اللہ کے پاس سے لائے ہیں، میں ان پر ایمان لایا اور میں اپنی قوم کے لوگوں کا جو یہاں نہیں آئے ہیں بھیجا ہوا (تحقیق حال کے لیے) آیا ہوں۔ میرا نام ضمام بن ثعلبہ ہے، میں بنی سعد بن بکر کے خاندان سے ہوں۔ اس حدیث کو (لیث کی طرح) موسیٰ اور علی بن عبدالحمید نے سلیمان سے روایت کیا، انہوں نے ثابت سے، انہوں نے انس سے، انہوں نے یہی مضمون نبی کریم صلی اللہ علیہ وسلم سے نقل کیا ہے۔"
         },
         {
            "arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ ، قَالَ : حَدَّثَنِي إِبْرَاهِيمُ بْنُ سَعْدٍ ، عَنْ صَالِحٍ ، عَنِ ابْنِ شِهَابٍ ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ أَخْبَرَهُ ، \" أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ بِكِتَابِهِ رَجُلًا وَأَمَرَهُ أَنْ يَدْفَعَهُ إِلَى عَظِيمِ الْبَحْرَيْنِ ، فَدَفَعَهُ عَظِيمُ الْبَحْرَيْنِ إِلَى كِسْرَى ، فَلَمَّا قَرَأَهُ مَزَّقَهُ ، فَحَسِبْتُ أَنَّ ابْنَ الْمُسَيَّبِ ، قَالَ : فَدَعَا عَلَيْهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُمَزَّقُوا كُلَّ مُمَزَّقٍ \" .",
            "englishTranslation":"Narrated `Abdullah bin `Abbas: Once Allah's Apostle gave a letter to a person and ordered him to go and deliver it to the Governor of Bahrain. (He did so) and the Governor of Bahrain sent it to Chousroes, who read that letter and then tore it to pieces. (The sub-narrator (Ibn Shihab) thinks that Ibn Al-Musaiyab said that Allah's Apostle invoked Allah against them (saying), \"May Allah tear them into pieces, and disperse them all totally.)\"",
            "urduTranslation":"´اسماعیل بن عبداللہ نے ہم سے بیان کیا، ان سے ابراہیم بن سعد نے صالح کے واسطے سے روایت کی، انہوں نے ابن شہاب سے، انہوں نے عبیداللہ بن عبداللہ بن عتبہ بن مسعود رضی اللہ عنہ سے نقل کیا کہ ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ` رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کو اپنا ایک خط دے کر بھیجا اور اسے یہ حکم دیا کہ اسے حاکم بحرین کے پاس لے جائے۔ بحرین کے حاکم نے وہ خط کسریٰ (شاہ ایران) کے پاس بھیج دیا۔ جس وقت اس نے وہ خط پڑھا تو چاک کر ڈالا (راوی کہتے ہیں) اور میرا خیال ہے کہ ابن مسیب نے (اس کے بعد) مجھ سے کہا کہ (اس واقعہ کو سن کر) رسول اللہ صلی اللہ علیہ وسلم نے اہل ایران کے لیے بددعا کی کہ وہ (بھی چاک شدہ خط کی طرح) ٹکڑے ٹکڑے ہو جائیں۔"
         }
      ]
   },
   {
      "hadithName":"Wudu Ablution",
      "data":[
         {
            "arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ ، قَالَ : أَخْبَرَنَا عَبْدُ الرَّزَّاقِ ، قَالَ : أَخْبَرَنَا مَعْمَرٌ ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ، يَقُولُ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" لَا تُقْبَلُ صَلَاةُ مَنْ أَحْدَثَ حَتَّى يَتَوَضَّأَ \" قَالَ رَجُلٌ مِنْ حَضْرَمَوْتَ : مَا الْحَدَثُ يَا أَبَا هُرَيْرَةَ ؟ قَالَ : فُسَاءٌ أَوْ ضُرَاطٌ .",
            "englishTranslation":"Narrated Abu Huraira: Allah's Apostle said, \"The prayer of a person who does Hadath (passes urine, stool or wind) is not accepted till he performs the ablution.\" A person from Hadaramout asked Abu Huraira, \"What is 'Hadath'?\" Abu Huraira replied, \" 'Hadath' means the passing of wind.\"",
            "urduTranslation":"´ہم سے اسحاق بن ابراہیم الحنظلی نے بیان کیا۔ انہیں عبدالرزاق نے خبر دی، انہیں معمر نے ہمام بن منبہ کے واسطے سے بتلایا کہ انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا، وہ کہہ رہے تھے کہ` رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص حدث کرے اس کی نماز قبول نہیں ہوتی جب تک کہ وہ (دوبارہ) وضو نہ کر لے۔ حضر موت کے ایک شخص نے پوچھا کہ حدث ہونا کیا ہے؟ آپ نے فرمایا کہ (پاخانہ کے مقام سے نکلنے والی) آواز والی یا بےآواز والی ہوا۔"
         },
         {
            "arabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ ، قَالَ : حَدَّثَنَا اللَّيْثُ ، عَنْ خَالِدٍ ، عَنْ سَعِيدِ بْنِ أَبِي هِلَالٍ ، عَنْ نُعَيْمٍ الْمُجْمِرِ ، قَالَ : رَقِيتُ مَعَ أَبِي هُرَيْرَةَ عَلَى ظَهْرِ الْمَسْجِدِ فَتَوَضَّأَ ، فَقَالَ : إِنِّي سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، يَقُولُ : \" إِنَّ أُمَّتِي يُدْعَوْنَ يَوْمَ الْقِيَامَةِ غُرًّا مُحَجَّلِينَ مِنْ آثَارِ الْوُضُوءِ ، فَمَنِ اسْتَطَاعَ مِنْكُمْ أَنْ يُطِيلَ غُرَّتَهُ فَلْيَفْعَلْ \" .",
            "englishTranslation":"Narrated Nu`am Al-Mujmir: Once I went up the roof of the mosque, along with Abu Huraira. He perform ablution and said, \"I heard the Prophet saying, \"On the Day of Resurrection, my followers will be called \"Al-Ghurr-ul- Muhajjalun\" from the trace of ablution and whoever can increase the area of his radiance should do so (i.e. by performing ablution regularly).' \"",
            "urduTranslation":"´ہم سے یحییٰ بن بکیر نے بیان کیا، ان سے لیث نے خالد کے واسطے سے نقل کیا، وہ سعید بن ابی ہلال سے نقل کرتے ہیں، وہ نعیم المجمر سے، وہ کہتے ہیں کہ` میں (ایک مرتبہ) ابوہریرہ رضی اللہ عنہ کے ساتھ مسجد کی چھت پر چڑھا۔ تو آپ نے وضو کیا اور کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا تھا کہ آپ صلی اللہ علیہ وسلم فرما رہے تھے کہ میری امت کے لوگ وضو کے نشانات کی وجہ سے قیامت کے دن سفید پیشانی اور سفید ہاتھ پاؤں والوں کی شکل میں بلائے جائیں گے۔ تو تم میں سے جو کوئی اپنی چمک بڑھانا چاہتا ہے تو وہ بڑھا لے (یعنی وضو اچھی طرح کرے)۔"
         },
         {
            "arabic":"حَدَّثَنَا عَلِيٌّ بْنُ عَبْدِ اللهِ ، قَالَ : حَدَّثَنَا سُفْيَانُ ، قَالَ : حَدَّثَنَا الزُّهْرِيُّ ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ . ح وَعَنْ عَبَّادِ بْنِ تَمِيمٍ ، عَنْ عَمِّهِ ، أَنَّهُ شَكَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرَّجُلُ الَّذِي يُخَيَّلُ إِلَيْهِ أَنَّهُ يَجِدُ الشَّيْءَ فِي الصَّلَاةِ ، فَقَالَ : \" لَا يَنْفَتِلْ أَوْ لَا يَنْصَرِفْ حَتَّى يَسْمَعَ صَوْتًا أَوْ يَجِدَ رِيحًا \" .",
            "englishTranslation":"Narrated `Abbas bin Tamim: My uncle asked Allah's Apostle about a person who imagined to have passed wind during the prayer. Allah' Apostle replied: \"He should not leave his prayers unless he hears sound or smells something.\"",
            "urduTranslation":"´ہم سے علی نے بیان کیا، ان سے سفیان نے، ان سے زہری نے سعید بن المسیب کے واسطے سے نقل کیا، وہ عباد بن تمیم سے روایت کرتے ہیں، وہ اپنے چچا (عبداللہ بن زید) سے روایت کرتے ہیں کہ` انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے شکایت کی کہ ایک شخص ہے جسے یہ خیال ہوتا ہے کہ نماز میں کوئی چیز (یعنی ہوا نکلتی) معلوم ہوئی ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ (نماز سے) نہ پھرے یا نہ مڑے، جب تک آواز نہ سنے یا بو نہ پائے۔"
         },
         {
            "arabic":"ا عَلِيُّ بْنُ عَبْدِ اللَّهِ ، قَالَ : حَدَّثَنَا سُفْيَانُ ، عَنْ عَمْرٍو ، قَالَ : أَخْبَرَنِي كُرَيْبٌ ، عَنِ ابْنِ عَبَّاسٍ ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَامَ حَتَّى نَفَخَ ، ثُمَّ صَلَّى ، وَرُبَّمَا قَالَ : اضْطَجَعَ حَتَّى نَفَخَ ، ثُمَّ قَامَ فَصَلَّى ، ثُمَّ حَدَّثَنَا بِهِ سُفْيَانُ مَرَّةً بَعْدَ مَرَّةٍ ، عَنْ عَمْرٍو ، عَنْ كُرَيْبٍ ، عَنِ ابْنِ عَبَّاسٍ ، قَالَ : \" بِتُّ عِنْدَ خَالَتِي مَيْمُونَةَ لَيْلَةً ، فَقَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنَ اللَّيْلِ ، فَلَمَّا كَانَ فِي بَعْضِ اللَّيْلِ قَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَتَوَضَّأَ مِنْ شَنٍّ مُعَلَّقٍ وُضُوءًا خَفِيفًا يُخَفِّفُهُ عَمْرٌو وَيُقَلِّلُهُ ، وَقَامَ يُصَلِّي فَتَوَضَّأْتُ نَحْوًا مِمَّا تَوَضَّأَ ، ثُمَّ جِئْتُ فَقُمْتُ عَنْ يَسَارِهِ وَرُبَّمَا ، قَالَ سُفْيَانُ : عَنْ شِمَالِهِ فَحَوَّلَنِي فَجَعَلَنِي عَنْ يَمِينِهِ ، ثُمَّ صَلَّى مَا شَاءَ اللَّهُ ، ثُمَّ اضْطَجَعَ فَنَامَ حَتَّى نَفَخَ ، ثُمَّ أَتَاهُ الْمُنَادِي فَآذَنَهُ بِالصَّلَاةِ فَقَامَ مَعَهُ إِلَى الصَّلَاةِ فَصَلَّى وَلَمْ يَتَوَضَّأْ ، قُلْنَا لِعَمْرٍو : إِنَّ نَاسًا يَقُولُونَ : إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَنَامُ عَيْنُهُ وَلَا يَنَامُ قَلْبُهُ ، قَالَ عَمْرٌو : سَمِعْتُ عُبَيْدَ بْنَ عُمَيْرٍ ، يَقُولُ : رُؤْيَا الْأَنْبِيَاءِ وَحْيٌ ، ثُمَّ قَرَأَ : إِنِّي أَرَى فِي الْمَنَامِ أَنِّي أَذْبَحُكَ سورة الصافات آية 102 \" .",
            "englishTranslation":"Narrated Kuraib: Ibn `Abbas said, \"The Prophet slept till he snored and then prayed (or probably lay till his breath sounds were heard and then got up and prayed).\" Ibn `Abbas added: \"I stayed overnight in the house of my aunt, Maimuna, the Prophet slept for a part of the night, (See Fath-al-Bari page 249, Vol. 1), and late in the night, he got up and performed ablution from a hanging water skin, a light (perfect) ablution and stood up for the prayer. I, too, performed a similar ablution, then I went and stood on his left. He drew me to his right and prayed as much as Allah wished, and again lay and slept till his breath sounds were heard. Later on the Mu'adh-dhin (call maker for the prayer) came to him and informed him that it was time for Prayer. The Prophet went with him for the prayer without performing a new ablution.\" (Sufyan said to `Amr that some people said, \"The eyes of Allah's Apostle sleep but his heart does not sleep.\" `Amr replied, \"I heard `Ubaid bin `Umar saying that the dreams of Prophets were Divine Inspiration, and then he recited the verse: 'I (Abraham) see in a dream, (O my son) that I offer you in sacrifice (to Allah).\" (37.102)",
            "urduTranslation":"´ہم سے علی بن عبداللہ نے بیان کیا، ان سے سفیان نے عمرو کے واسطے سے نقل کیا، انہیں کریب نے ابن عباس رضی اللہ عنہما سے خبر دی کہ` نبی کریم صلی اللہ علیہ وسلم سوئے یہاں تک کہ آپ صلی اللہ علیہ وسلم خراٹے لینے لگے۔ پھر آپ صلی اللہ علیہ وسلم نے نماز پڑھی اور کبھی (راوی نے یوں) کہا کہ آپ صلی اللہ علیہ وسلم لیٹ گئے۔ پھر خراٹے لینے لگے۔ پھر آپ صلی اللہ علیہ وسلم کھڑے ہوئے اس کے بعد نماز پڑھی۔ پھر سفیان نے ہم سے دوسری مرتبہ یہی حدیث بیان کی عمرو سے، انہوں نے کریب سے، انہوں نے ابن عباس رضی اللہ عنہما سے نقل کیا کہ وہ کہتے تھے کہ (ایک مرتبہ) میں نے اپنی خالہ (ام المؤمنین) میمونہ رضی اللہ عنہا کے گھر رات گزاری، تو (میں نے دیکھا کہ) رسول اللہ صلی اللہ علیہ وسلم رات کو اٹھے۔ جب تھوڑی رات باقی رہ گئی۔ تو آپ صلی اللہ علیہ وسلم نے اٹھ کر ایک لٹکے ہوئے مشکیزے سے ہلکا سا وضو کیا۔ عمرو اس کا ہلکا پن اور معمولی ہونا بیان کرتے تھے اور آپ کھڑے ہو کر نماز پڑھنے لگے، تو میں نے بھی اسی طرح وضو کیا۔ جس طرح آپ صلی اللہ علیہ وسلم نے کیا تھا۔ پھر آ کر آپ کے بائیں طرف کھڑا ہو گیا اور کبھی سفیان نے «عن يساره» کی بجائے «عن شماله» کا لفظ کہا (مطلب دونوں کا ایک ہی ہے) پھر آپ صلی اللہ علیہ وسلم نے مجھے پھیر لیا اور اپنی داہنی جانب کر لیا۔ پھر نماز پڑھی جس قدر اللہ کو منظور تھا۔ پھر آپ لیٹ گئے اور سو گئے۔ حتیٰ کہ خراٹوں کی آواز آنے لگی۔ پھر آپ کی خدمت میں مؤذن حاضر ہوا اور اس نے آپ کو نماز کی اطلاع دی۔ آپ صلی اللہ علیہ وسلم اس کے ساتھ نماز کے لیے تشریف لے گئے۔ پھر آپ نے نماز پڑھی اور وضو نہیں کیا۔ (سفیان کہتے ہیں کہ) ہم نے عمرو سے کہا، کچھ لوگ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کی آنکھیں سوتی تھیں، دل نہیں سوتا تھا۔ عمرو نے کہا میں نے عبید بن عمیر سے سنا، وہ کہتے تھے کہ انبیاء علیہم السلام کے خواب بھی وحی ہوتے ہیں۔ پھر (قرآن کی یہ) آیت پڑھی۔ ”میں خواب میں دیکھتا ہوں کہ میں تجھے ذبح کر رہا ہوں۔“"
         },
         {
            "arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ ، عَنْ مَالِكٍ ، عَنْ مُوسَى بْنِ عُقْبَةَ ، عَنْ كُرَيْبٍ مَوْلَى ابْنِ عَبَّاسٍ ، عَنْ أُسَامَةَ بْنِ زَيْدٍ ، أَنَّهُ سَمِعَهُ ، يَقُولُ : \"دَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عَرَفَةَ حَتَّى إِذَا كَانَ بِالشِّعْبِ نَزَلَ فَبَالَ ، ثُمَّ تَوَضَّأَ وَلَمْ يُسْبِغِ الْوُضُوءَ ، فَقُلْتُ : الصَّلَاةَ يَا رَسُولَ اللَّهِ ، فَقَالَ : الصَّلَاةُ أَمَامَكَ ، فَرَكِبَ ، فَلَمَّا جَاءَ الْمُزْدَلِفَةَ نَزَلَ فَتَوَضَّأَ فَأَسْبَغَ الْوُضُوءَ ، ثُمَّ أُقِيمَتِ الصَّلَاةُ فَصَلَّى الْمَغْرِبَ ، ثُمَّ أَنَاخَ كُلُّ إِنْسَانٍ بَعِيرَهُ فِي مَنْزِلِهِ ، ثُمَّ أُقِيمَتِ الْعِشَاءُ فَصَلَّى وَلَمْ يُصَلِّ بَيْنَهُمَا \" .",
            "englishTranslation":"Narrated Usama bin Zaid: Allah's Apostle proceeded from `Arafat till when he reached the mountain pass, he dismounted, urinated and then performed ablution but not a perfect one. I said to him, (\"Is it the time for) the prayer, O Allah's Apostle?\" He said, \"The (place of) prayer is ahead of you.\" He rode till when he reached Al-Muzdalifa, he dismounted and performed ablution and a perfect one, The (call for) Iqama was pronounced and he led the Maghrib prayer. Then everybody made his camel kneel down at its place. Then the Iqama was pronounced for the `Isha' prayer which the Prophet led and no prayer was offered in between the two . prayers (`Isha' and Maghrib).",
            "urduTranslation":"´ہم سے عبداللہ بن مسلمہ نے بیان کیا، ان سے امام مالک رحمہ اللہ نے موسیٰ بن عقبہ کے واسطے سے بیان کیا، انہوں نے کریب مولیٰ ابن عباس سے، انہوں نے اسامہ بن زید رضی اللہ عنہما سے سنا، وہ کہتے تھے کہ` رسول اللہ صلی اللہ علیہ وسلم میدان عرفات سے واپس ہوئے۔ جب گھاٹی میں پہنچے تو آپ صلی اللہ علیہ وسلم اتر گئے۔ آپ صلی اللہ علیہ وسلم نے (پہلے) پیشاب کیا، پھر وضو کیا اور خوب اچھی طرح نہیں کیا۔ تب میں نے کہا، یا رسول اللہ! نماز کا وقت (آ گیا) آپ صلی اللہ علیہ وسلم نے فرمایا: نماز، تمہارے آگے ہے (یعنی مزدلفہ چل کر پڑھیں گے) جب مزدلفہ میں پہنچے تو آپ نے خوب اچھی طرح وضو کیا، پھر جماعت کھڑی کی گئی، آپ صلی اللہ علیہ وسلم نے مغرب کی نماز پڑھی، پھر ہر شخص نے اپنے اونٹ کو اپنی جگہ بٹھلایا، پھر عشاء کی جماعت کھڑی کی گئی اور آپ صلی اللہ علیہ وسلم نے نماز پڑھی اور ان دونوں نمازوں کے درمیان کوئی نماز نہیں پڑھی۔"
         }
      ]
   },
   {
      "hadithName":"Ghusl Washing Of The Whole Body",
      "data":[
         {
            "arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ ، قَالَ : أَخْبَرَنَا مَالِكٌ ، عَنْ هِشَامِ ، عَنْ أَبِيهِ ، عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، \" أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا اغْتَسَلَ مِنَ الْجَنَابَةِ بَدَأَ فَغَسَلَ يَدَيْهِ ، ثُمَّ يَتَوَضَّأُ كَمَا يَتَوَضَّأُ لِلصَّلَاةِ ، ثُمَّ يُدْخِلُ أَصَابِعَهُ فِي الْمَاءِ فَيُخَلِّلُ بِهَا أُصُولَ شَعَرِهِ ، ثُمَّ يَصُبُّ عَلَى رَأْسِهِ ثَلَاثَ غُرَفٍ بِيَدَيْهِ ، ثُمَّ يُفِيضُ الْمَاءَ عَلَى جِلْدِهِ كُلِّهِ \" .",
            "englishTranslation":"Narrated `Aisha: Whenever the Prophet took a bath after Janaba he started by washing his hands and then performed ablution like that for the prayer. After that he would put his fingers in water and move the roots of his hair with them, and then pour three handfuls of water over his head and then pour water all over his body.",
            "urduTranslation":"´ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا ہمیں مالک نے ہشام سے خبر دی، وہ اپنے والد سے، وہ نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا سے روایت کرتے ہیں کہ` نبی کریم صلی اللہ علیہ وسلم جب غسل فرماتے تو آپ صلی اللہ علیہ وسلم پہلے اپنے دونوں ہاتھ دھوتے پھر اسی طرح وضو کرتے جیسا نماز کے لیے آپ صلی اللہ علیہ وسلم وضو کیا کرتے تھے۔ پھر پانی میں اپنی انگلیاں داخل فرماتے اور ان سے بالوں کی جڑوں کا خلال کرتے۔ پھر اپنے ہاتھوں سے تین چلو سر پر ڈالتے پھر تمام بدن پر پانی بہا لیتے۔"
         },
         {
            "arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ ، قَالَ : حَدَّثَنَا سُفْيَانُ ، عَنْ الْأَعْمَشِ ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ ، عَنْ كُرَيْبٍ ، عَنِ ابْنِ عَبَّاسٍ ، عَنْ مَيْمُونَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، قَالَتْ : \" تَوَضَّأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وُضُوءَهُ لِلصَّلَاةِ غَيْرَ رِجْلَيْهِ ، وَغَسَلَ فَرْجَهُ وَمَا أَصَابَهُ مِنَ الْأَذَى ، ثُمَّ أَفَاضَ عَلَيْهِ الْمَاءَ ، ثُمَّ نَحَّى رِجْلَيْهِ فَغَسَلَهُمَا هَذِهِ غُسْلُهُ مِنَ الْجَنَابَةِ \" .",
            "englishTranslation":"Narrated Maimuna: (the wife of the Prophet) Allah's Apostle performed ablution like that for the prayer but did not wash his feet. He washed off the discharge from his private parts and then poured water over his body. He withdrew his feet from that place (the place where he took the bath) and then washed them. And that was his way of taking the bath of Janaba.",
            "urduTranslation":"ہم سے محمد بن یوسف نے حدیث بیان کی، انہوں نے کہا کہ ہم سے سفیان نے بیان کیا اعمش سے روایت کر کے، وہ سالم ابن ابی الجعد سے، وہ کریب سے، وہ ابن عباس رضی اللہ عنہما سے، وہ میمونہ رضی اللہ عنہا نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ سے روایت کرتے ہیں، انہوں نے بتلایا کہ` نبی کریم صلی اللہ علیہ وسلم نے نماز کے وضو کی طرح ایک مرتبہ وضو کیا، البتہ پاؤں نہیں دھوئے۔ پھر اپنی شرمگاہ کو دھویا اور جہاں کہیں بھی نجاست لگ گئی تھی، اس کو دھویا۔ پھر اپنے اوپر پانی بہا لیا۔ پھر پہلی جگہ سے ہٹ کر اپنے دونوں پاؤں کو دھویا۔ آپ کا غسل جنابت اسی طرح ہوا کرتا تھا۔"
         },
         {
            "arabic":"حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ ، قَالَ : حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ ، عَنِ الزُّهْرِيِّ ، عَنْ عُرْوَةَ ، عَنْ عَائِشَةَ ، قَالَتْ : \" كُنْتُ أَغْتَسِلُ أَنَا وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ إِنَاءٍ وَاحِدٍ مِنْ قَدَحٍ ، يُقَالُ لَهُ الْفَرَقُ \" .",
            "englishTranslation":"Narrated `Aisha: The Prophet and I used to take a bath from a single pot called 'Faraq'.",
            "urduTranslation":"´ہم سے آدم بن ابی ایاس نے حدیث بیان کی، انہوں نے کہا کہ ہم سے ابن ابی ذئب نے حدیث بیان کی۔ انہوں نے زہری سے، انہوں نے عروہ سے، انہوں نے عائشہ رضی اللہ عنہا سے کہ آپ نے بتلایا کہ` میں اور نبی کریم صلی اللہ علیہ وسلم ایک ہی برتن میں غسل کیا کرتے تھے اس برتن کو فرق کہا جاتا تھا۔ (نوٹ: فرق کے اندر 6.298 کلو گرام ہوتا ہے۔)"
         },
         {
            "arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ ، قَالَ : حَدَّثَنِي عَبْدُ الصَّمَدِ ، قَالَ : حَدَّثَنِي شُعْبَةُ ، قَالَ : حَدَّثَنِي أَبُو بَكْرِ بْنُ حَفْصٍ ، قَالَ : سَمِعْتُ أَبَا سَلَمَةَ ، يَقُولُ : دَخَلْتُ أَنَا وَأَخُو عَائِشَةَ عَلَى عَائِشَةَ ، فَسَأَلَهَا أَخُوهَا عَنْ غُسْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ؟ \" فَدَعَتْ بِإِنَاءٍ نَحْوًا مِنْ صَاعٍ ، فَاغْتَسَلَتْ وَأَفَاضَتْ عَلَى رَأْسِهَا وَبَيْنَنَا وَبَيْنَهَا حِجَابٌ \" ، قَالَ أَبُو عَبْد اللَّهِ : قَالَ يَزِيدُ بْنُ هَارُونَ ، وَبَهْزٌ ، وَالْجُدِّيُّ ، عَنْ شُعْبَةَ : قَدْرِ صَاعٍ .",
            "englishTranslation":"Narrated Abu Salama: `Aisha's brother and I went to `Aisha and he asked her about the bath of the Prophet. She brought a pot containing about a Sa` of water and took a bath and poured it over her head and at what time there was a screen between her and us.",
            "urduTranslation":"´ہم سے عبداللہ بن محمد نے حدیث بیان کی، انہوں نے کہا کہ ہم سے عبدالصمد نے، انہوں نے کہا ہم سے شعبہ نے، انہوں نے کہا ہم سے ابوبکر بن حفص نے، انہوں نے کہا کہ میں نے ابوسلمہ سے یہ حدیث سنی کہ` میں (ابوسلمہ) اور عائشہ رضی اللہ عنہا کے بھائی عائشہ رضی اللہ عنہا کی خدمت میں گئے۔ ان کے بھائی نے نبی کریم صلی اللہ علیہ وسلم کے غسل کے بارے میں سوال کیا۔ تو آپ نے صاع جیسا ایک برتن منگوایا۔ پھر غسل کیا اور اپنے اوپر پانی بہایا۔ اس وقت ہمارے درمیان اور ان کے درمیان پردہ حائل تھا۔ ابوعبداللہ (امام بخاری رحمہ اللہ) کہتے ہیں کہ یزید بن ہارون، بہز اور جدی نے شعبہ سے قدر صاع کے الفاظ روایت کئے ہیں۔ (نوٹ: صاع کے اندر 2.488 کلو گرام ہوتا ہے۔)"
         },
         {
            "arabic":"ا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ ، قَالَ : حَدَّثَنَا يَحْيَى بْنُ آدَمَ ، قَالَ : حَدَّثَنَا زُهَيْرٌ ، عَنْ أَبِي إِسْحَاقَ ، قَالَ : حَدَّثَنَا أَبُو جَعْفَرٍ ، أَنَّهُ كَانَ عِنْدَ جَابِرِ بْنِ عَبْدِ اللَّهِ هُوَ وَأَبُوهُ وَعِنْدَهُ قَوْمٌ ، فَسَأَلُوهُ عَنِ الْغُسْلِ ، فَقَالَ : يَكْفِيكَ صَاعٌ ؟ فَقَالَ رَجُلٌ : مَا يَكْفِينِي ، فَقَالَ جَابِرٌ : \" كَانَ يَكْفِي مَنْ هُوَ أَوْفَى مِنْكَ شَعَرًا وَخَيْرٌ مِنْكَ \" ، ثُمَّ أَمَّنَا فِي ثَوْبٍ .",
            "englishTranslation":"Narrated Abu Ja`far: While I and my father were with Jabir bin `Abdullah, some People asked him about taking a bath He replied, \"A Sa` of water is sufficient for you.\" A man said, \"A Sa` is not sufficient for me.\" Jabir said, \"A Sa was sufficient for one who had more hair than you and was better than you (meaning the Prophet).\" And then Jabir (put on) his garment and led the prayer.",
            "urduTranslation":"´ہم سے عبداللہ بن محمد نے حدیث بیان کی، انہوں نے کہا کہ ہم سے یحییٰ بن آدم نے حدیث بیان کی، انہوں نے کہا ہم سے زہیر نے ابواسحاق کے واسطے سے، انہوں نے کہا ہم سے ابوجعفر (محمد باقر) نے بیان کیا کہ` وہ اور ان کے والد (جناب زین العابدین) جابر بن عبداللہ رضی اللہ عنہ کے پاس تھے اور کچھ اور لوگ بھی بیٹھے ہوئے تھے۔ ان لوگوں نے آپ سے غسل کے بارے میں پوچھا تو آپ نے فرمایا کہ ایک صاع کافی ہے۔ اس پر ایک شخص بولا یہ مجھے تو کافی نہ ہو گا۔ جابر رضی اللہ عنہ نے فرمایا کہ یہ ان کے لیے کافی ہوتا تھا جن کے بال تم سے زیادہ تھے اور جو تم سے بہتر تھے (یعنی رسول اللہ صلی اللہ علیہ وسلم ) پھر جابر رضی اللہ عنہ نے صرف ایک کپڑا پہن کر ہمیں نماز پڑھائی۔ (نوٹ: صاع کے اندر 2.488 کلو گرام ہوتا ہے۔)"
         }
      ]
   },
   {
      "hadithName":"Menses Menstrual Periods",
      "data":[
         {
            "arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ ، قَالَ : حَدَّثَنَا سُفْيَانُ ، قَالَ : سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ ، قَالَ : سَمِعْتُ الْقَاسِمَ ، يَقُولُ : سَمِعْتُ عَائِشَةَ ، تَقُولُ : خَرَجْنَا لَا نَرَى إِلَّا الْحَجَّ ، فَلَمَّا كُنَّا بِسَرِفَ حِضْتُ ، فَدَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا أَبْكِي ، قَالَ : مَا لَكِ ، أَنُفِسْتِ ؟ قُلْتُ : نَعَمْ ، قَالَ : \"إِنَّ هَذَا أَمْرٌ كَتَبَهُ اللَّهُ عَلَى بَنَاتِ آدَمَ ، فَاقْضِي مَا يَقْضِي الْحَاجُّ غَيْرَ أَنْ لَا تَطُوفِي بِالْبَيْتِ \" ، قَالَتْ : وَضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نِسَائِهِ بِالْبَقَرِ ..",
            "englishTranslation":"Narrated Al-Qasim: `Aisha said, \"We set out with the sole intention of performing Hajj and when we reached Sarif, (a place six miles from Mecca) I got my menses. Allah's Apostle came to me while I was weeping. He said 'What is the matter with you? Have you got your menses?' I replied, 'Yes.' He said, 'This is a thing which Allah has ordained for the daughters of Adam. So do what all the pilgrims do with the exception of the Tawaf (Circumambulation) round the Ka`ba.\" `Aisha added, \"Allah's Apostle sacrificed cows on behalf of his wives.\"",
            "urduTranslation":"´ہم سے علی بن عبداللہ نے بیان کیا، کہا ہم سے سفیان نے، کہا میں نے عبدالرحمٰن بن قاسم سے سنا، کہا میں نے قاسم سے سنا۔ وہ کہتے تھے میں نے عائشہ رضی اللہ عنہا سے سنا۔ آپ فرماتی تھیں کہ` ہم حج کے ارادہ سے نکلے۔ جب ہم مقام سرف میں پہنچے تو میں حائضہ ہو گئی اور اس رنج میں رونے لگی کہ رسول اللہ صلی اللہ علیہ وسلم تشریف لائے، آپ صلی اللہ علیہ وسلم نے پوچھا تمہیں کیا ہو گیا۔ کیا حائضہ ہو گئی ہو۔ میں نے کہا، ہاں! آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ ایک ایسی چیز ہے جس کو اللہ تعالیٰ نے آدم کی بیٹیوں کے لیے لکھ دیا ہے۔ اس لیے تم بھی حج کے افعال پورے کر لو۔ البتہ بیت اللہ کا طواف نہ کرنا۔ عائشہ رضی اللہ عنہا نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیویوں کی طرف سے گائے کی قربانی کی۔ (سرف ایک مقام مکہ سے چھ سات میل کے فاصلہ پر ہے)۔"
         },
         {
            "arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ ، قَالَ : حَدَّثَنَا مَالِكٌ ، عَنْ هِشَامِ بْنِ عُرْوَةَ ، عَنْ أَبِيهِ ، عَنْ عَائِشَةَ ، قَالَتْ : \" كُنْتُ أُرَجِّلُ رَأْسَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا حَائِضٌ \" .",
            "englishTranslation":"Narrated `Aisha: While in menses, I used to comb the hair of Allah's Apostle .",
            "urduTranslation":"´ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہمیں خبر دی مالک نے ہشام بن عروہ سے، وہ اپنے والد سے، وہ عائشہ رضی اللہ عنہا سے نقل کرتے ہیں کہ آپ نے فرمایا` میں رسول اللہ صلی اللہ علیہ وسلم کے سر مبارک کو حائضہ ہونے کی حالت میں بھی کنگھا کیا کرتی تھی۔"
         },
         {
            "arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى ، قَالَ : أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ ، أَنَّ ابْنَ جُرَيْجٍ أَخْبَرَهُمْ ، قَالَ : أَخْبَرَنِي هِشَامُ بْنُ عُرْوَةَ ، عَنْ عُرْوَةَ ، أَنَّهُ سُئِلَ أَتَخْدُمُنِي الْحَائِضُ أَوْ تَدْنُو مِنِّي الْمَرْأَةُ وَهِيَ جُنُبٌ ؟ فَقَالَ عُرْوَةُ : كُلُّ ذَلِكَ عَلَيَّ هَيِّنٌ ، وَكُلُّ ذَلِكَ تَخْدُمُنِي وَلَيْسَ عَلَى أَحَدٍ فِي ذَلِكَ بَأْسٌ ، أَخْبَرَتْنِي عَائِشَة \" أَنَّهَا كَانَتْ تُرَجِّلُ تَعْنِي رَأْسَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ حَائِضٌ ، وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَئِذٍ مُجَاوِرٌ فِي الْمَسْجِدِ يُدْنِي لَهَا رَأْسَهُ وَهِيَ فِي حُجْرَتِهَا ، فَتُرَجِّلُهُ وَهِيَ حَائِضٌ \" .",
            "englishTranslation":"Narrated `Urwa: A person asked me, \"Can a woman in menses serve me? And can a Junub woman come close to me?\" I replied, \"All this is easy for me. All of them can serve me, and there is no harm for any other person to do the same. `Aisha told me that she used to comb the hair of Allah's Apostle while she was in her menses, and he was in I`tikaf (in the mosque). He would bring his head near her in her room and she would comb his hair, while she used to be in her menses.\"",
            "urduTranslation":"´ہم سے ابراہیم بن موسیٰ نے بیان کیا، انہوں نے کہا ہم سے ہشام بن یوسف نے بیان کیا، انہوں نے کہا ابن جریج نے انہیں خبر دی، انہوں نے کہا مجھے ہشام بن عروہ نے عروہ کے واسطے سے بتایا کہ` ان سے سوال کیا گیا، کیا حائضہ بیوی میری خدمت کر سکتی ہے، یا ناپاکی کی حالت میں عورت مجھ سے نزدیک ہو سکتی ہے؟ عروہ نے فرمایا میرے نزدیک تو اس میں کوئی حرج نہیں ہے۔ اس طرح کہ عورتیں میری بھی خدمت کرتی ہیں اور اس میں کسی کے لیے بھی کوئی حرج نہیں۔ اس لیے کہ مجھے عائشہ رضی اللہ عنہا نے خبر دی کہ وہ رسول اللہ صلی اللہ علیہ وسلم کو حائضہ ہونے کی حالت میں کنگھا کیا کرتی تھیں اور رسول اللہ صلی اللہ علیہ وسلم اس وقت مسجد میں معتکف ہوتے۔ آپ اپنا سر مبارک قریب کر دیتے اور عائشہ رضی اللہ عنہا اپنے حجرہ ہی سے کنگھا کر دیتیں، حالانکہ وہ حائضہ ہوتیں۔"
         },
         {
            "arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ الْفَضْلُ بْنُ دُكَيْنٍ ، سَمِعَ زُهَيْرًا ، عَنْ مَنْصُورِ ابْنِ صَفِيَّةَ ، أَنَّ أُمَّهُ حَدَّثَتْهُ ، أَنَّ عَائِشَةَ حَدَّثَتْهَا ، \" أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَّكِئُ فِي حَجْرِي وَأَنَا حَائِضٌ ، ثُمَّ يَقْرَأُ الْقُرْآنَ \" .",
            "englishTranslation":"Narrated `Aisha: The Prophet used to lean on my lap and recite Qur'an while I was in menses.",
            "urduTranslation":"´ہم سے ابونعیم فضل بن دکین نے بیان کیا، انہوں نے زہیر سے سنا، انہوں نے منصور بن صفیہ سے کہ ان کی ماں نے ان سے بیان کیا کہ عائشہ رضی اللہ عنہا نے ان سے بیان کیا کہ` نبی کریم صلی اللہ علیہ وسلم میری گود میں سر رکھ کر قرآن مجید پڑھتے، حالانکہ میں اس وقت حیض والی ہوتی تھی۔"
         },
         {
            "arabic":"حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ ، قَالَ : حَدَّثَنَا هِشَامٌ ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ ، عَنْ أَبِي سَلَمَةَ ، أَنَّ زَيْنَبَ بِنْتَ أُمِّ سَلَمَةَ حَدَّثَتْهُ ، أَنَّ أُمَّ سَلَمَةَ حَدَّثَتْهَا ، قَالَتْ : \" بَيْنَا أَنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُضْطَجِعَةٌ فِي خَمِيصَةٍ ، إِذْ حِضْتُ فَانْسَلَلْتُ فَأَخَذْتُ ثِيَابَ حِيضَتِي ، قَالَ : أَنُفِسْتِ ؟ قُلْتُ : نَعَمْ ، فَدَعَانِي فَاضْطَجَعْتُ مَعَهُ فِي الْخَمِيلَةِ \"",
            "englishTranslation":"Narrated Um Salama: While I was laying with the Prophet under a single woolen sheet, I got the menses. I slipped away and put on the clothes for menses. He said, \"Have you got \"Nifas\" (menses)?\" I replied, \"Yes.\" He then called me and made me lie with him under the same sheet.",
            "urduTranslation":"´ہم سے مکی بن ابراہیم نے بیان کیا، انہوں نے کہا ہم سے ہشام نے یحییٰ بن کثیر کے واسطہ سے بیان کیا، انہوں نے ابوسلمہ سے کہ زینب بنت ام سلمہ نے ان سے بیان کیا اور ان سے ام سلمہ رضی اللہ عنہا نے کہ` میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک چادر میں لیٹی ہوئی تھی، اتنے میں مجھے حیض آ گیا۔ اس لیے میں آہستہ سے باہر نکل آئی اور اپنے حیض کے کپڑے پہن لیے۔ نبی کریم صلی اللہ علیہ وسلم نے پوچھا کیا تمہیں نفاس آ گیا ہے؟ میں نے عرض کیا ہاں۔ پھر مجھے آپ صلی اللہ علیہ وسلم نے بلا لیا، اور میں چادر میں آپ صلی اللہ علیہ وسلم کے ساتھ لیٹ گئی۔"
         }
      ]
   },
   {
      "hadithName":"Tayammum Rubbing Hands And Feet With",
      "data":[
         {
            "arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ ، قَالَ : أَخْبَرَنَا مَالِكٌ ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ ، عَنْ أَبِيهِ ، عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، قَالَتْ : \" خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَعْضِ أَسْفَارِهِ ، حَتَّى إِذَا كُنَّا بِالْبَيْدَاءِ أَوْ بِذَاتِ الْجَيْشِ انْقَطَعَ عِقْدٌ لِي ، فَأَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْتِمَاسِهِ ، وَأَقَامَ النَّاسُ مَعَهُ وَلَيْسُوا عَلَى مَاءٍ ، فَأَتَى النَّاسُ إِلَى أَبِي بَكْرٍ الصِّدِّيقِ ، فَقَالُوا : أَلَا تَرَى مَا صَنَعَتْ عَائِشَةُ ؟ أَقَامَتْ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالنَّاسِ وَلَيْسُوا عَلَى مَاءٍ ، وَلَيْسَ مَعَهُمْ مَاءٌ ، فَجَاءَ أَبُو بَكْرٍ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاضِعٌ رَأْسَهُ عَلَى فَخِذِي قَدْ نَامَ ، فَقَالَ : حَبَسْتِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالنَّاسَ وَلَيْسُوا عَلَى مَاءٍ ، وَلَيْسَ مَعَهُمْ مَاءٌ ، فَقَالَتْ عَائِشَةُ : فَعَاتَبَنِي أَبُو بَكْرٍ ، وَقَالَ مَا شَاءَ اللَّهُ أَنْ يَقُولَ ، وَجَعَلَ يَطْعُنُنِي بِيَدِهِ فِي خَاصِرَتِي فَلَا يَمْنَعُنِي مِنَ التَّحَرُّكِ إِلَّا مَكَانُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى فَخِذِي ، فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ أَصْبَحَ عَلَى غَيْرِ مَاءٍ ، فَأَنْزَلَ اللَّهُ آيَةَ التَّيَمُّمِ فَتَيَمَّمُوا ، فَقَالَ أُسَيْدُ بْنُ الْحُضَيْرِ : مَا هِيَ بِأَوَّلِ بَرَكَتِكُمْ يَا آلَ أَبِي بَكْرٍ ؟ قَالَتْ : فَبَعَثْنَا الْبَعِيرَ الَّذِي كُنْتُ عَلَيْهِ فَأَصَبْنَا الْعِقْدَ تَحْتَهُ \" .",
            "englishTranslation":"Narrated `Aisha: (the wife of the Prophet) We set out with Allah's Apostle on one of his journeys till we reached Al- Baida' or Dhatul-Jaish, a necklace of mine was broken (and lost). Allah's Apostle stayed there to search for it, and so did the people along with him. There was no water at that place, so the people went to Abu- Bakr As-Siddiq and said, \"Don't you see what `Aisha has done? She has made Allah's Apostle and the people stay where there is no water and they have no water with them.\" Abu Bakr came while Allah's Apostle was sleeping with his head on my thigh, He said, to me: \"You have detained Allah's Apostle and the people where there is no water and they have no water with them. So he admonished me and said what Allah wished him to say and hit me on my flank with his hand. Nothing prevented me from moving (because of pain) but the position of Allah's Apostle on my thigh. Allah's Apostle got up when dawn broke and there was no water. So Allah revealed the Divine Verses of Tayammum. So they all performed Tayammum. Usaid bin Hudair said, \"O the family of Abu Bakr! This is not the first blessing of yours.\" Then the camel on which I was riding was caused to move from its place and the necklace was found beneath it.",
            "urduTranslation":"´ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا ہمیں مالک نے عبدالرحمٰن بن قاسم سے خبر دی، انہوں نے اپنے والد سے، انہوں نے نبی کریم صلی اللہ علیہ وسلم کی زوجہ محترمہ عائشہ رضی اللہ عنہا سے، آپ نے بتلایا کہ` ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ بعض سفر (غزوہ بنی المصطلق) میں تھے۔ جب ہم مقام بیداء یا ذات الجیش پر پہنچے تو میرا ایک ہار کھو گیا۔ رسول اللہ صلی اللہ علیہ وسلم اس کی تلاش میں وہیں ٹھہر گئے اور لوگ بھی آپ صلی اللہ علیہ وسلم کے ساتھ ٹھہر گئے۔ لیکن وہاں پانی کہیں قریب میں نہ تھا۔ لوگ ابوبکر رضی اللہ عنہ کے پاس آئے اور کہا ”عائشہ رضی اللہ عنہا نے کیا کام کیا؟ کہ رسول اللہ صلی اللہ علیہ وسلم اور تمام لوگوں کو ٹھہرا دیا ہے اور پانی بھی کہیں قریب میں نہیں ہے اور نہ لوگوں ہی کے ساتھ ہے۔“ پھر ابوبکر صدیق رضی اللہ عنہ تشریف لائے، رسول اللہ صلی اللہ علیہ وسلم اپنا سر مبارک میری ران پر رکھے ہوئے سو رہے تھے۔ فرمانے لگے کہ تم نے رسول اللہ صلی اللہ علیہ وسلم اور تمام لوگوں کو روک لیا۔ حالانکہ قریب میں کہیں پانی بھی نہیں ہے اور نہ لوگوں کے پاس ہے۔ عائشہ رضی اللہ عنہا کہتی ہیں کہ والد ماجد (رضی اللہ عنہ) مجھ پر بہت خفا ہوئے اور اللہ نے جو چاہا انہوں نے مجھے کہا اور اپنے ہاتھ سے میری کوکھ میں کچوکے لگائے۔ رسول اللہ صلی اللہ علیہ وسلم کا سر مبارک میری ران پر تھا۔ اس وجہ سے میں حرکت بھی نہیں کر سکتی تھی۔ رسول اللہ صلی اللہ علیہ وسلم جب صبح کے وقت اٹھے تو پانی کا پتہ تک نہ تھا۔ پس اللہ تعالیٰ نے تیمم کی آیت اتاری اور لوگوں نے تیمم کیا۔ اس پر اسید بن حضیر رضی اللہ عنہ نے کہا ”اے آل ابی بکر! یہ تمہاری کوئی پہلی برکت نہیں ہے۔“ عائشہ (رضی اللہ عنہا) نے فرمایا۔ پھر ہم نے اس اونٹ کو ہٹایا جس پر میں سوار تھی تو ہار اسی کے نیچے مل گیا۔"
         },
         {
            "arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ ، قَالَ : حَدَّثَنَا هُشَيْمٌ . ح قَالَ : وحَدَّثَنِي سَعِيدُ بْنُ النَّضْرِ ، قَالَ : أَخْبَرَنَا هُشَيْمٌ ، قَالَ : أَخْبَرَنَا سَيَّارٌ ، قَالَ : حَدَّثَنَا يَزِيدُ هُوَ ابْنُ صُهَيْبٍ الْفَقِيرُ ، قَالَ : أَخْبَرَنَا جَابِرُ بْنُ عَبْدِ اللَّهِ ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، قَالَ : \" أُعْطِيتُ خَمْسًا لَمْ يُعْطَهُنَّ أَحَدٌ قَبْلِي ، نُصِرْتُ بِالرُّعْبِ مَسِيرَةَ شَهْرٍ ، وَجُعِلَتْ لِي الْأَرْضُ مَسْجِدًا وَطَهُورًا ، فَأَيُّمَا رَجُلٍ مِنْ أُمَّتِي أَدْرَكَتْهُ الصَّلَاةُ فَلْيُصَلِّ ، وَأُحِلَّتْ لِي الْمَغَانِمُ وَلَمْ تَحِلَّ لِأَحَدٍ قَبْلِي ، وَأُعْطِيتُ الشَّفَاعَةَ ، وَكَانَ النَّبِيُّ يُبْعَثُ إِلَى قَوْمِهِ خَاصَّةً ، وَبُعِثْتُ إِلَى النَّاسِ عَامَّةً \" .",
            "englishTranslation":"Narrated Jabir bin `Abdullah: The Prophet said, \"I have been given five things which were not given to any one else before me. -1. Allah made me victorious by awe, (by His frightening my enemies) for a distance of one month's journey. -2. The earth has been made for me (and for my followers) a place for praying and a thing to perform Tayammum, therefore anyone of my followers can pray wherever the time of a prayer is due. -3. The booty has been made Halal (lawful) for me yet it was not lawful for anyone else before me. -4. I have been given the right of intercession (on the Day of Resurrection). -5. Every Prophet used to be sent to his nation only but I have been sent to all mankind.",
            "urduTranslation":"´ہم سے محمد بن سنان عوفی نے بیان کیا، انہوں نے کہا ہم سے ہشیم نے بیان کیا (دوسری سند) کہا اور مجھ سے سعید بن نضر نے بیان کیا، انہوں نے کہا ہمیں خبر دی ہشیم نے، انہوں نے کہا ہمیں خبر دی سیار نے، انہوں نے کہا ہم سے یزید الفقیر نے بیان کیا، انہوں نے کہا ہمیں جابر بن عبداللہ نے ,` نبی کریم صلی اللہ علیہ وسلم نے فرمایا مجھے پانچ چیزیں ایسی دی گئی ہیں جو مجھ سے پہلے کسی کو نہیں دی گئی تھیں۔ ایک مہینہ کی مسافت سے رعب کے ذریعہ میری مدد کی گئی ہے اور تمام زمین میرے لیے سجدہ گاہ اور پاکی کے لائق بنائی گئی۔ پس میری امت کا جو انسان نماز کے وقت کو (جہاں بھی) پالے اسے وہاں ہی نماز ادا کر لینی چاہیے۔ اور میرے لیے غنیمت کا مال حلال کیا گیا ہے۔ مجھ سے پہلے یہ کسی کے لیے بھی حلال نہ تھا۔ اور مجھے شفاعت عطا کی گئی۔ اور تمام انبیاء اپنی اپنی قوم کے لیے مبعوث ہوتے تھے لیکن میں تمام انسانوں کے لیے عام طور پر نبی بنا کر بھیجا گیا ہوں۔"
         },
         {
            "arabic":"حَدَّثَنَا زَكَرِيَّاءُ بْنُ يَحْيَى ، قَالَ : حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ ، قَالَ : حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ ، عَنْ أَبِيهِ ، عَنْ عَائِشَةَ ، \" أَنَّهَا اسْتَعَارَتْ مِنْأَسْمَاءَ قِلَادَةً فَهَلَكَتْ ، فَبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا ، فَوَجَدَهَا ، فَأَدْرَكَتْهُمُ الصَّلَاةُ وَلَيْسَ مَعَهُمْ مَاءٌ فَصَلَّوْا ، فَشَكَوْا ذَلِكَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَأَنْزَلَ اللَّهُ آيَةَ التَّيَمُّمِ \" ، فَقَالَ أُسَيْدُ بْنُ حُضَيْرٍ لِعَائِشَةَ : جَزَاكِ اللَّهُ خَيْرًا ، فَوَاللَّهِ مَا نَزَلَ بِكِ أَمْرٌ تَكْرَهِينَهُ إِلَّا جَعَلَ اللَّهُ ذَلِكِ لَكِ وَلِلْمُسْلِمِينَ فِيهِ خَيْرًا .",
            "englishTranslation":"Narrated `Urwa's father: Aisha said, \"I borrowed a necklace from Asma' and it was lost. So Allah's Apostle sent a man to search for it and he found it. Then the time of the prayer became due and there was no water. They prayed (without ablution) and informed Allah's Apostle about it, so the verse of Tayammum was revealed.\" Usaid bin Hudair said to `Aisha, \"May Allah reward you. By Allah, whenever anything happened which you did not like, Allah brought good for you and for the Muslims in that.\" Al-Jurf and the time for the `Asr prayer became due while he was at Marbad-An-Na`am (sheepfold), so he (performed Tayammum) and prayed there and then entered Medina when the sun was still high but he did not repeat that prayer.",
            "urduTranslation":"´ہم سے سے زکریا بن یحییٰ نے بیان کیا، کہا ہم سے عبداللہ بن نمیر نے، کہا ہم سے ہشام بن عروہ نے، وہ اپنے والد سے، وہ عائشہ رضی اللہ عنہا سے کہ` انھوں نے اسماء رضی اللہ عنہا سے ہار مانگ کر پہن لیا تھا، وہ گم ہو گیا۔ رسول اللہ صلی اللہ علیہ وسلم نے ایک آدمی کو اس کی تلاش کے لیے بھیجا، جسے وہ مل گیا۔ پھر نماز کا وقت آ پہنچا اور لوگوں کے پاس (جو ہار کی تلاش میں گئے تھے) پانی نہیں تھا۔ لوگوں نے نماز پڑھ لی اور رسول اللہ صلی اللہ علیہ وسلم سے اس کے متعلق شکایت کی۔ پس اللہ تبارک و تعالیٰ نے تیمم کی آیت اتاری جسے سن کر اسید بن حضیر نے عائشہ رضی اللہ عنہا سے کہا آپ کو اللہ بہترین بدلہ دے۔ واللہ جب بھی آپ کے ساتھ کوئی ایسی بات پیش آئی جس سے آپ کو تکلیف ہوئی تو اللہ تعالیٰ نے آپ کے لیے اور تمام مسلمانوں کے لیے اس میں خیر پیدا فرما دی۔"
         },
         {
            "arabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ ، قَالَ : حَدَّثَنَا اللَّيْثُ ، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ ، عَنْ الْأَعْرَجِ ، قَالَ : سَمِعْتُ عُمَيْرًا مَوْلَى ابْنِ عَبَّاسٍ ، قَالَ : أَقْبَلْتُ أَنَا وَعَبْدُ اللَّهِ بْنُ يَسَارٍ مَوْلَى مَيْمُونَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى دَخَلْنَا عَلَى أَبِي جُهَيْمِ بْنِ الْحَارِثِ بْنِ الصِّمَّةِ الْأَنْصَارِيِّ ، فَقَالَ أَبُو الْجُهَيْمِ : \"أَقْبَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ نَحْوِ بِئْرِ جَمَلٍ ، فَلَقِيَهُ رَجُلٌ فَسَلَّمَ عَلَيْهِ ، فَلَمْ يَرُدَّ عَلَيْهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى أَقْبَلَ عَلَى الْجِدَارِ فَمَسَحَ بِوَجْهِهِ وَيَدَيْهِ ، ثُمَّ رَدَّ عَلَيْهِ السَّلَامَ \" .",
            "englishTranslation":"Narrated Abu Juhaim Al-Ansari: The Prophet came from the direction of Bir Jamal. A man met him and greeted him. But he did not return back the greeting till he went to a (mud) wall and smeared his hands and his face with its dust (performed Tayammum) and then returned back the greeting.",
            "urduTranslation":"´ہم سے یحییٰ بن بکیر نے بیان کیا، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا، انہوں نے جعفر بن ربیعہ سے، انہوں نے عبدالرحمٰن اعرج سے، انہوں نے کہا میں نے ابن عباس رضی اللہ عنہما کے غلام عمیر بن عبداللہ سے سنا، انہوں نے کہا کہ` میں اور عبداللہ بن یسار جو کہ میمونہ رضی اللہ عنہا زوجہ نبی کریم صلی اللہ علیہ وسلم کے غلام تھے، ابوجہیم بن حارث بن صمہ انصاری (صحابی) کے پاس آئے۔ انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم ”بئر جمل“ کی طرف سے تشریف لا رہے تھے، راستے میں ایک شخص نے آپ کو سلام کیا (یعنی خود اسی ابوجہیم نے) لیکن آپ صلی اللہ علیہ وسلم نے جواب نہیں دیا۔ پھر آپ دیوار کے قریب آئے اور اپنے چہرے اور ہاتھوں کا مسح کیا پھر ان کے سلام کا جواب دیا۔"
         },
         {
            "arabic":"حَدَّثَنَا آدَمُ ، قَالَ : حَدَّثَنَا شُعْبَةُ ، حَدَّثَنَا الْحَكَمُ ، عَنْ ذَرٍّ ، عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى ، عَنْ أَبِيهِ ، قَالَ : جَاءَ رَجُلٌ إِلَى عُمَرَ بْنِ الْخَطَّابِ ، فَقَالَ : إِنِّي أَجْنَبْتُ فَلَمْ أُصِبِ الْمَاءَ ؟ فَقَالَ عَمَّارُ بْنُ يَاسِرٍ لِعُمَرَ بْنِ الْخَطَّابِ : أَمَا تَذْكُرُ أَنَّا كُنَّا فِي سَفَرٍ أَنَا وَأَنْتَ ، فَأَمَّا أَنْتَ فَلَمْ تُصَلِّ ، وَأَمَّا أَنَا فَتَمَعَّكْتُ فَصَلَّيْتُ ، فَذَكَرْتُ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" إِنَّمَا كَانَ يَكْفِيكَ هَكَذَا ، فَضَرَبَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَفَّيْهِ الْأَرْضَ وَنَفَخَ فِيهِمَا ، ثُمَّ مَسَحَ بِهِمَا وَجْهَهُ وَكَفَّيْهِ \" .",
            "englishTranslation":"Narrated `Abdur Rahman bin Abza [??]: A man came to `Umar bin Al-Khattab and said, \"I became Junub but no water was available.\" `Ammar bin Yasir said to `Umar, \"Do you remember that you and I (became Junub while both of us) were together on a journey and you didn't pray but I rolled myself on the ground and prayed? I informed the Prophet about it and he said, 'It would have been sufficient for you to do like this.' The Prophet then stroked lightly the earth with his hands and then blew off the dust and passed his hands over his face and hands.\"",
            "urduTranslation":"´ہم سے آدم بن ابی ایاس نے بیان کیا، انہوں نے کہا ہم سے شعبہ نے بیان کیا، انہوں نے کہا ہم سے حکم بن عیینہ نے بیان کیا، انہوں نے ذر بن عبداللہ سے، انہوں نے سعید بن عبدالرحمٰن بن ابزیٰ سے، وہ اپنے باپ سے، انہوں نے بیان کیا کہ` ایک شخص عمر بن خطاب رضی اللہ عنہ کے پاس آیا اور عرض کی کہ مجھے غسل کی حاجت ہو گئی اور پانی نہیں ملا (تو میں اب کیا کروں) اس پر عمار بن یاسر رضی اللہ عنہما نے عمر بن خطاب رضی اللہ عنہ سے کہا، کیا آپ کو یاد نہیں جب میں اور آپ سفر میں تھے، ہم دونوں جنبی ہو گئے۔ آپ نے تو نماز نہیں پڑھی لیکن میں نے زمین پر لوٹ پوٹ لیا، اور نماز پڑھ لی۔ پھر میں نے نبی کریم صلی اللہ علیہ وسلم سے اس کا ذکر کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ تجھے بس اتنا ہی کافی تھا اور آپ نے اپنے دونوں ہاتھ زمین پر مارے پھر انہیں پھونکا اور دونوں سے چہرے اور پہنچوں کا مسح کیا۔"
         }
      ]
   },
   {
      "hadithName":"As-salat The Prayer",
      "data":[
         {
            "arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ ، قَالَ : أَخْبَرَنَا مَالِكٌ ، عَنْ صَالِحِ بْنِ كَيْسَانَ ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ ، قَالَتْ : \"فَرَضَ اللَّهُ الصَّلَاةَ حِينَ فَرَضَهَا رَكْعَتَيْنِ رَكْعَتَيْنِ فِي الْحَضَرِ وَالسَّفَرِ ، فَأُقِرَّتْ صَلَاةُ السَّفَرِ ، وَزِيدَ فِي صَلَاةِ الْحَضَرِ \" .",
            "englishTranslation":"Narrated `Aisha: the mother of believers: Allah enjoined the prayer when He enjoined it, it was two rak`at only (in every prayer) both when in residence or on journey. Then the prayers offered on journey remained the same, but (the rak`at of) the prayers for non-travelers were increased.",
            "urduTranslation":"´ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، انہوں نے کہا ہمیں خبر دی امام مالک نے صالح بن کیسان سے، انہوں نے عروہ بن زبیر سے، انہوں نے ام المؤمنین عائشہ رضی اللہ عنہا سے، آپ نے فرمایا کہ` اللہ تعالیٰ نے پہلے نماز میں دو دو رکعت فرض کی تھی۔ سفر میں بھی اور اقامت کی حالت میں بھی۔ پھر سفر کی نماز تو اپنی اصلی حالت پر باقی رکھی گئی اور حالت اقامت کی نمازوں میں زیادتی کر دی گئی۔"
         },
         {
            "arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ ، قَالَ : حَدَّثَنَا يَزِيدُ بْنُ إِبْرَاهِيمَ ، عَنْ مُحَمَّدٍ ، عَنْ أُمِّ عَطِيَّةَ ، قَالَتْ : \" أُمِرْنَا أَنْ نُخْرِجَ الْحُيَّضَ يَوْمَ الْعِيدَيْنِ وَذَوَاتِ الْخُدُورِ ، فَيَشْهَدْنَ جَمَاعَةَ الْمُسْلِمِينَ وَدَعْوَتَهُمْ وَيَعْتَزِلُ الْحُيَّضُ عَنْ مُصَلَّاهُنَّ ، قَالَتِ امْرَأَةٌ : يَا رَسُولَ اللَّهِ ، إِحْدَانَا لَيْسَ لَهَا جِلْبَابٌ ؟ قَالَ : لِتُلْبِسْهَا صَاحِبَتُهَا مِنْ جِلْبَابِهَا \" ، وَقَالَ عَبْدُ اللَّهِ بْنُ رَجَاءٍ : حَدَّثَنَا عِمْرَانُ ، حَدَّثَنَا مُحَمَّدُ بْنُ سِيرِينَ ، حَدَّثَتْنَا أُمُّ عَطِيَّةَ ، سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا .",
            "englishTranslation":"Narrated Um `Atiya: We were ordered to bring out our menstruating women and veiled women in the religious gatherings and invocation of Muslims on the two `Id festivals. These menstruating women were to keep away from their Musalla. A woman asked, \"O Allah's Apostle ' What about one who does not have a veil?\" He said, \"Let her share the veil of her companion.\"",
            "urduTranslation":"´ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے یزید بن ابراہیم نے بیان کیا، وہ محمد سے، وہ ام عطیہ سے، انہوں نے فرمایا کہ` ہمیں حکم ہوا کہ ہم عیدین کے دن حائضہ اور پردہ نشین عورتوں کو بھی باہر لے جائیں۔ تاکہ وہ مسلمانوں کے اجتماع اور ان کی دعاؤں میں شریک ہو سکیں۔ البتہ حائضہ عورتوں کو نماز پڑھنے کی جگہ سے دور رکھیں۔ ایک عورت نے کہا یا رسول اللہ! ہم میں بعض عورتیں ایسی بھی ہوتی ہیں جن کے پاس (پردہ کرنے کے لیے) چادر نہیں ہوتی۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کی ساتھی عورت اپنی چادر کا ایک حصہ اسے اڑھا دے۔ اور عبداللہ بن رجاء نے کہا ہم سے عمران قطان نے بیان کیا، کہا ہم سے محمد بن سیرین نے، کہا ہم سے ام عطیہ نے، میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا اور یہی حدیث بیان کی۔"
         },
         {
            "arabic":"حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ ، قَالَ : حَدَّثَنَا عَاصِمُ بْنُ مُحَمَّدٍ ، قَالَ : حَدَّثَنِي وَاقِدُ بْنُ مُحَمَّدٍ ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ ، قَالَ : \" صَلَّى جَابِرٌ فِي إِزَارٍ قَدْ عَقَدَهُ مِنْ قِبَلِ قَفَاهُ وَثِيَابُهُ مَوْضُوعَةٌ عَلَى الْمِشْجَبِ ، قَالَ لَهُ قَائِلٌ : تُصَلِّي فِي إِزَارٍ وَاحِدٍ ، فَقَالَ : إِنَّمَا صَنَعْتُ ذَلِكَ لِيَرَانِي أَحْمَقُ مِثْلُكَ ، وَأَيُّنَا كَانَ لَهُ ثَوْبَانِ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \" .",
            "englishTranslation":"Narrated Muhammad bin Al-Munkadir: Once Jabir prayed with his Izar tied to his back while his clothes were Lying beside him on a wooden peg. Somebody asked him, \"Do you offer your prayer in a single Izar?\" He replied, \"I did so to show it to a fool like you. Had anyone of us two garments in the lifetime of the Prophet?\"",
            "urduTranslation":"´ہم سے احمد بن یونس نے بیان کیا، انہوں نے کہا ہم سے عاصم بن محمد نے بیان کیا، انہوں نے کہا کہ مجھ سے واقد بن محمد نے محمد بن منکدر کے حوالہ سے بیان کیا، انہوں نے کہا کہ` جابر بن عبداللہ رضی اللہ عنہما نے تہبند باندھ کر نماز پڑھی۔ جسے انہوں نے سر تک باندھ رکھا تھا اور آپ کے کپڑے کھونٹی پر ٹنگے ہوئے تھے۔ ایک کہنے والے نے کہا کہ آپ ایک تہبند میں نماز پڑھتے ہیں؟ آپ نے جواب دیا کہ میں نے ایسا اس لیے کیا کہ تجھ جیسا کوئی احمق مجھے دیکھے۔ بھلا رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں دو کپڑے بھی کس کے پاس تھے؟"
         },
         {
            "arabic":"حَدَّثَنَا مُطَرِّفٌ أَبُو مُصْعَبٍ ، قَالَ : حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الْمَوَالِي ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ ، قَالَ : رَأَيْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يُصَلِّي فِي ثَوْبٍ وَاحِدٍ ، وَقَالَ : \" رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي ثَوْبٍ \" .",
            "englishTranslation":"Narrated Muhammad bin Al Munkadir: I saw Jabir bin `Abdullah praying in a single garment and he said that he had seen the Prophet praying in a single garment.",
            "urduTranslation":"´ہم سے ابومصعب بن عبداللہ مطرف نے بیان کیا، انہوں نے کہا ہم سے عبدالرحمٰن بن ابی الموالی نے بیان کیا، انہوں نے محمد بن منکدر سے، انہوں نے کہا کہ` میں نے جابر رضی اللہ عنہ کو ایک کپڑے میں نماز پڑھتے دیکھا اور انہوں نے بتلایا کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو بھی ایک ہی کپڑے میں نماز پڑھتے دیکھا تھا۔"
         },
         {
            "arabic":"حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى ، قَالَ : حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ ، عَنْ أَبِيهِ ، عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ ، \" أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فِي ثَوْبٍ وَاحِدٍ قَدْ خَالَفَ بَيْنَ طَرَفَيْهِ \" .",
            "englishTranslation":"Narrated `Umar bin Abi Salama: The Prophet prayed in one garment and crossed its ends.",
            "urduTranslation":"´ہم سے عبیداللہ بن موسیٰ نے بیان کیا، کہا ہم سے ہشام بن عروہ نے اپنے والد کے حوالہ سے بیان کیا، وہ عمر بن ابی سلمہ سے کہ` نبی کریم صلی اللہ علیہ وسلم نے ایک کپڑے میں نماز پڑھی اور آپ نے کپڑے کے دونوں کناروں کو مخالف طرف کے کاندھے پر ڈال لیا۔"
         }
      ]
   },
   {
      "hadithName":"The Times Of As-salat The Prayers And Its",
      "data":[
         {
            "arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ ، قَالَ : قَرَأْتُ عَلَى مَالِكٍ ، عَنِ ابْنِ شِهَابٍ ، أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ أَخَّرَ الصَّلَاةَ يَوْمًا ، فَدَخَلَ عَلَيْهِ عُرْوَةُ بْنُ الزُّبَيْرِ ، فَأَخْبَرَهُ أَنَّ الْمُغِيرَةَ بْنَ شُعْبَةَ أَخَّرَ الصَّلَاةَ يَوْمًا وَهُوَ بِالْعِرَاقِ ، فَدَخَلَ عَلَيْهِ أَبُو مَسْعُودٍ الْأَنْصَارِيُّ ، فَقَالَ : مَا هَذَا يَا مُغِيرَةُ ؟ أَلَيْسَ قَدْ عَلِمْتَ أَنَّ جِبْرِيلَ نَزَلَ فَصَلَّى ، فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، ثُمَّ قَالَ : بِهَذَا أُمِرْتُ ، فَقَالَ عُمَرُ لِعُرْوَةَ : اعْلَمْ مَا تُحَدِّثُ ، أَوَ أَنَّ جِبْرِيلَ هُوَ أَقَامَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقْتَ الصَّلَاةِ ، قَالَ عُرْوَةُ : كَذَلِك كَانَ بَشِيرُ بْنُ أَبِي مَسْعُودٍ يُحَدِّثُ ، عَنْ أَبِيهِ .",
            "englishTranslation":"Narrated Ibn Shihab: Once `Umar bin `Abdul `Aziz delayed the prayer and `Urwa bin Az-Zubair went to him and said, \"Once in 'Iraq, Al-Mughira bin Shu`ba delayed his prayers and Abi Mas`ud Al-Ansari went to him and said, 'O Mughira! What is this? Don't you know that once Gabriel came and offered the prayer (Fajr prayer) and Allah's Apostle prayed too, then he prayed again (Zuhr prayer) and so did Allah's Apostle and again he prayed (`Asr prayers and Allah's Apostle did the same; again he prayed (Maghrib-prayer) and so did Allah's Apostle and again prayed (`Isha prayer) and so did Allah's Apostle and (Gabriel) said, 'I was ordered to do so (to demonstrate the prayers prescribed to you)?'\" `Umar (bin `Abdul `Aziz) said to `Urwa, \"Be sure of what you Say. Did Gabriel lead Allah's Apostle at the stated times of the prayers?\" `Urwa replied, \"Bashir bin Abi Mas`ud narrated like this on the authority of his father.\"",
            "urduTranslation":"´ہم سے عبداللہ بن مسلمہ نے بیان کیا، انہوں نے کہا کہ میں نے امام مالک رحمہ اللہ علیہ کو پڑھ کر سنایا ابن شہاب کی روایت سے کہ` عمر بن عبدالعزیز رحمہ اللہ علیہ نے ایک دن (عصر کی) نماز میں دیر کی، پس عروہ بن زبیر رضی اللہ عنہ کے پاس تشریف لے گئے، اور انہوں نے بتایا کہ (اسی طرح) مغیرہ بن شعبہ رضی اللہ عنہ نے ایک دن (عراق کے ملک میں) نماز میں دیر کی تھی جب وہ عراق میں (حاکم) تھے۔ پس ابومسعود انصاری (عقبہ بن عمر) ان کی خدمت میں گئے۔ اور فرمایا، مغیرہ رضی اللہ عنہ! آخر یہ کیا بات ہے، کیا آپ کو معلوم نہیں کہ جب جبرائیل علیہ السلام تشریف لائے تو انہوں نے نماز پڑھی اور رسول اللہ صلی اللہ علیہ وسلم نے بھی نماز پڑھی، پھر جبرائیل علیہ السلام نے نماز پڑھی تو نبی کریم صلی اللہ علیہ وسلم نے بھی نماز پڑھی، پھر جبرائیل علیہ السلام نے نماز پڑھی تو نبی کریم صلی اللہ علیہ وسلم نے بھی نماز پڑھی، پھر جبرائیل علیہ السلام نے کہا کہ میں اسی طرح حکم دیا گیا ہوں۔ اس پر عمر بن عبدالعزیز رحمہ اللہ نے عروہ سے کہا، معلوم بھی ہے آپ کیا بیان کر رہے ہیں؟ کیا جبرائیل علیہ السلام نے نبی کریم صلی اللہ علیہ وسلم کو نماز کے اوقات (عمل کر کے) بتلائے تھے۔ عروہ نے کہا، کہ ہاں اسی طرح بشیر بن ابی مسعود رضی اللہ عنہ اپنے والد کے واسطہ سے بیان کرتے تھے۔"
         },
         {
            "arabic":"قَالَ عُرْوَةُ : وَلَقَدْ حَدَّثَتْنِي عَائِشَةُ ، \" أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي الْعَصْرَ وَالشَّمْسُ فِي حُجْرَتِهَا قَبْلَ أَنْ تَظْهَرَ \" .",
            "englishTranslation":"Urwa added, \"Aisha told me that Allah's Apostle used to pray `Asr prayer when the sunshine was still inside her residence (during the early time of `Asr).",
            "urduTranslation":"عروہ رحمہ اللہ علیہ نے کہا کہ مجھ سے عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم عصر کی نماز اس وقت پڑھ لیتے تھے جب ابھی دھوپ ان کے حجرہ میں موجود ہوتی تھی اس سے بھی پہلے کہ وہ دیوار پر چڑھے۔"
         },
         {
            "arabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ ، قَالَ : حَدَّثَنَا عَبَّادٌ هُوَ ابْنُ عَبَّادٍ ، عَنْ أَبِي جَمْرَةَ ، عَنِ ابْنِ عَبَّاسٍ ، قَالَ : قَدِمَ وَفْدُ عَبْدِ الْقَيْسِ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَقَالُوا : إِنَّا مِنْ هَذَا الْحَيِّ مِنْ رَبِيعَةَ وَلَسْنَا نَصِلُ إِلَيْكَ إِلَّا فِي الشَّهْرِ الْحَرَامِ ، فَمُرْنَا بِشَيْءٍ نَأْخُذْهُ عَنْكَ وَنَدْعُو إِلَيْهِ مَنْ وَرَاءَنَا ، فَقَالَ : \" آمُرُكُمْ بِأَرْبَعٍ وَأَنْهَاكُمْ عَنْ أَرْبَعٍ ، الْإِيمَانِ بِاللَّهِ ، ثُمَّ فَسَّرَهَا لَهُمْ شَهَادَةُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنِّي رَسُولُ اللَّهِ ، وَإِقَامُ الصَّلَاةِ ، وَإِيتَاءُ الزَّكَاةِ ، وَأَنْ تُؤَدُّوا إِلَيَّ خُمُسَ مَا غَنِمْتُمْ ، وَأَنْهَى عَنْ ، الدُّبَّاءِ ، وَالْحَنْتَمِ ، وَالْمُقَيَّرِ ، وَالنَّقِيرِ \" .",
            "englishTranslation":"Narrated Ibn `Abbas: \"Once a delegation of `Abdul Qais came to Allah's Apostle and said, \"We belong to such and such branch of the tribe of Rab'a [??] and we can only come to you in the sacred months. Order us to do something good so that we may (carry out) take it from you and also invite to it our people whom we have left behind (at home).\" The Prophet said, \" I order you to do four things and forbid you from four things. (The first four are as follows): -1. To believe in Allah. (And then he: explained it to them i.e.) to testify that none has the right to be worshipped but Allah and (Muhammad) am Allah's Apostle -2. To offer prayers perfectly (at the stated times): -3. To pay Zakat (obligatory charity) -4. To give me Khumus (The other four things which are forbidden are as follows): -1. Dubba -2. Hantam -3. Muqaiyat [??] -4. Naqir (all these are utensils used for the preparation of alcoholic drinks).",
            "urduTranslation":"´ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے عباد بن عباد بصریٰ نے، اور یہ عباد کے لڑکے ہیں، ابوجمرہ (نصر بن عمران) کے ذریعہ سے، انہوں نے ابن عباس رضی اللہ عنہما سے، انہوں نے کہا کہ` عبدالقیس کا وفد رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آیا اور کہا کہ ہم اس ربیعہ قبیلہ سے ہیں اور ہم آپ صلی اللہ علیہ وسلم کی خدمت میں صرف حرمت والے مہینوں ہی میں حاضر ہو سکتے ہیں، اس لیے آپ صلی اللہ علیہ وسلم کسی ایسی بات کا ہمیں حکم دیجیئے، جسے ہم آپ صلی اللہ علیہ وسلم سے سیکھ لیں اور اپنے پیچھے رہنے والے دوسرے لوگوں کو بھی اس کی دعوت دے سکیں، آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں تمہیں چار چیزوں کا حکم دیتا ہوں اور چار چیزوں سے روکتا ہوں، پہلے اللہ پر ایمان لانے کا، پھر آپ صلی اللہ علیہ وسلم نے اس کی تفصیل بیان فرمائی کہ اس بات کی شہادت دینا کہ اللہ کے سوا کوئی معبود نہیں اور یہ کہ میں اللہ کا رسول ہوں، اور دوسرے نماز قائم کرنے کا، تیسرے زکوٰۃ دینے کا، اور چوتھے جو مال تمہیں غنیمت میں ملے، اس میں سے پانچواں حصہ ادا کرنے کا اور تمہیں میں تونبڑی حنتم، قسار اور نقیر کے استعمال سے روکتا ہوں۔ (نوٹ: یہ تمام برتن شراب بنانے کے لیے استعمال ہوتے تھے)۔"
         },
         {
            "arabic":"ا مُحَمَّدُ بْنُ الْمُثَنَّى ، قَالَ : حَدَّثَنَا يَحْيَى ، قَالَ : حَدَّثَنَا إِسْمَاعِيلُ ، قَالَ : حَدَّثَنَا قَيْسٌ ، عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ ، قَالَ : \" بَايَعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى إِقَامِ الصَّلَاةِ ، وَإِيتَاءِ الزَّكَاةِ ، وَالنُّصْحِ لِكُلِّ مُسْلِمٍ \" .",
            "englishTranslation":"Narrated Jarir bin `Abdullah: I gave the pledge of allegiance to Allah's Apostle for to offer prayers perfectly, to pay Zakat regularly, and to give good advice to every Muslim.",
            "urduTranslation":"´ہم سے محمد بن مثنیٰ نے بیان کیا، انہوں نے کہا کہ ہم سے یحییٰ بن سعید قطان نے کہا کہ ہم سے اسماعیل بن ابی خالد نے بیان کیا، انہوں نے کہا کہ ہم سے قیس بن ابی حازم نے جریر بن عبداللہ رضی اللہ عنہ کی روایت سے بیان کیا کہ جریر بن عبداللہ بجلی رضی اللہ عنہ نے فرمایا کہ` میں نے رسول اللہ صلی اللہ علیہ وسلم کے دست مبارک پر نماز قائم کرنے، زکوٰۃ دینے، اور ہر مسلمان کے ساتھ خیر خواہی کرنے پر بیعت کی۔"
         },
         {
            "arabic":"حَدَّثَنَا مُسَدَّدٌ ، قَالَ : حَدَّثَنَا يَحْيَى ، عَنِ الْأَعْمَشِ ، قَالَ : حَدَّثَنِي شَقِيقٌ ، قَالَ : سَمِعْتُ حُذَيْفَةَ ، قَالَ : \" كُنَّا جُلُوسًا عِنْدَ عُمَرَ رَضِيَ اللَّهُ عَنْهُ ، فَقَالَ : أَيُّكُمْ يَحْفَظُ قَوْلَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْفِتْنَةِ ؟ قُلْتُ : أَنَا كَمَا قَالَهُ ، قَالَ : إِنَّكَ عَلَيْهِ أَوْ عَلَيْهَا لَجَرِيءٌ ، قُلْتُ : فِتْنَةُ الرَّجُلِ فِي أَهْلِهِ وَمَالِهِ وَوَلَدِهِ وَجَارِهِ ، تُكَفِّرُهَا الصَّلَاةُ وَالصَّوْمُ وَالصَّدَقَةُ وَالْأَمْرُ وَالنَّهْيُ ، قَالَ : لَيْسَ هَذَا أُرِيدُ ، وَلَكِنْ الْفِتْنَةُ الَّتِي تَمُوجُ كَمَا يَمُوجُ الْبَحْرُ ، قَالَ : لَيْسَ عَلَيْكَ مِنْهَا بَأْسٌ يَا أَمِيرَ الْمُؤْمِنِينَ ، إِنَّ بَيْنَكَ وَبَيْنَهَا بَابًا مُغْلَقًا ، قَالَ : أَيُكْسَرُ أَمْ يُفْتَحُ ؟ قَالَ : يُكْسَرُ ، قَالَ : إِذًا لَا يُغْلَقَ أَبَدًا ، قُلْنَا : أَكَانَ عُمَرُ يَعْلَمُ الْبَابَ ؟ قَالَ : نَعَمْ ، كَمَا أَنَّ دُونَ الْغَدِ اللَّيْلَةَ \" ، إِنِّي حَدَّثْتُهُ بِحَدِيثٍ لَيْسَ بِالْأَغَالِيطِ ، فَهِبْنَا أَنْ نَسْأَلَ حُذَيْفَةَ ، فَأَمَرْنَا مَسْرُوقًا فَسَأَلَهُ ، فَقَالَ : الْبَابُ عُمَرُ .",
            "englishTranslation":"Narrated Shaqiq: that he had heard Hudhaifa saying, \"Once I was sitting with `Umar and he said, 'Who amongst you remembers the statement of Allah's Apostle about the afflictions?' I said, 'I know it as the Prophet had said it.' `Umar said, 'No doubt you are bold.' I said, 'The afflictions caused for a man by his wife, money, children and neighbor are expiated by his prayers, fasting, charity and by enjoining (what is good) and forbidding (what is evil).' `Umar said, 'I did not mean that but I asked about that affliction which will spread like the waves of the sea.' I (Hudhaifa) said, 'O leader of the faithful believers! You need not be afraid of it as there is a closed door between you and it.' `Umar asked, Will the door be broken or opened?' I replied, 'It will be broken.' `Umar said, 'Then it will never be closed again.' I was asked whether `Umar knew that door. I replied that he knew it as one knows that there will be night before the tomorrow morning. I narrated a Hadith that was free from any misstatement\" The subnarrator added that they deputized Masruq to ask Hudhaifa (about the door). Hudhaifa said, \"The door was `Umar himself.\"",
            "urduTranslation":"´ہم سے مسدد بن مسرہد نے بیان کیا، انہوں نے کہا ہم سے یحییٰ بن سعید قطان نے اعمش کی روایت سے بیان کیا، اعمش (سلیمان بن مہران) نے کہا کہ مجھ سے شقیق بن مسلمہ نے بیان کیا، شقیق نے کہا کہ میں نے حذیفہ بن یمان رضی اللہ عنہ سے سنا۔ حذیفہ رضی اللہ عنہ نے فرمایا کہ` ہم عمر رضی اللہ عنہ کی خدمت میں بیٹھے ہوئے تھے کہ آپ نے پوچھا کہ فتنہ سے متعلق رسول اللہ صلی اللہ علیہ وسلم کی کوئی حدیث تم میں سے کسی کو یاد ہے؟ میں بولا، میں نے اسے (اسی طرح یاد رکھا ہے) جیسے نبی کریم صلی اللہ علیہ وسلم نے اس حدیث کو بیان فرمایا تھا۔ عمر رضی اللہ عنہ بولے، کہ تم رسول اللہ صلی اللہ علیہ وسلم سے فتن کو معلوم کرنے میں بہت بےباک تھے۔ میں نے کہا کہ انسان کے گھر والے، مال اولاد اور پڑوسی سب فتنہ (کی چیز) ہیں۔ اور نماز، روزہ، صدقہ، اچھی بات کے لیے لوگوں کو حکم کرنا اور بری باتوں سے روکنا ان فتنوں کا کفارہ ہیں۔ عمر رضی اللہ عنہ نے فرمایا کہ میں تم سے اس کے متعلق نہیں پوچھتا، مجھے تم اس فتنہ کے بارے میں بتلاؤ جو سمندر کی موج کی طرح ٹھاٹھیں مارتا ہوا بڑھے گا۔ اس پر میں نے کہا کہ یا امیرالمؤمنین! آپ اس سے خوف نہ کھائیے۔ آپ کے اور فتنہ کے درمیان ایک بند دروازہ ہے۔ پوچھا کیا وہ دروازہ توڑ دیا جائے گا یا (صرف) کھولا جائے گا۔ میں نے کہا کہ توڑ دیا جائے گا۔ عمر رضی اللہ عنہ بول اٹھے، کہ پھر تو وہ کبھی بند نہیں ہو سکے گا۔ شقیق نے کہا کہ ہم نے حذیفہ رضی اللہ عنہ سے پوچھا، کیا عمر رضی اللہ عنہ اس دروازہ کے متعلق کچھ علم رکھتے تھے تو انہوں نے کہا کہ ہاں! بالکل اسی طرح جیسے دن کے بعد رات کے آنے کا۔ میں نے تم سے ایک ایسی حدیث بیان کی ہے جو قطعاً غلط نہیں ہے۔ ہمیں اس کے متعلق حذیفہ رضی اللہ عنہ سے پوچھنے میں ڈر ہوتا تھا (کہ دروازہ سے کیا مراد ہے) اس لیے ہم نے مسروق سے کہا (کہ وہ پوچھیں) انہوں نے دریافت کیا تو آپ نے بتایا کہ وہ دروازہ خود عمر رضی اللہ عنہ ہی تھے۔"
         }
      ]
   },
   {
      "hadithName":"Adhan",
      "data":[
         {
            "arabic":"حَدَّثَنَا عِمْرَانُ بْنُ مَيْسَرَةَ ، حَدَّثَنَا عَبْدُ الْوَارِثِ ، حَدَّثَنَا خَالِدٌ الْحَذَّاءُ ، عَنْ أَبِي قِلَابَةَ ، عَنْ أَنَسٍ ، قَالَ : ذَكَرُوا النَّارَ وَالنَّاقُوسَ ، فَذَكَرُوا الْيَهُودَ ، وَالنَّصَارَى ، : ذَكَرُوا النَّارَ \" فَأُمِرَ بِلَالٌ أَنْ يَشْفَعَ الْأَذَانَ وَأَنْ يُوتِرَ الْإِقَامَةَ \" .",
            "englishTranslation":"Narrated Anas: The people mentioned the fire and the bell (they suggested those as signals to indicate the starting of prayers), and by that they mentioned the Jews and the Christians. Then Bilal was ordered to pronounce Adhan for the prayer by saying its wordings twice, and for the Iqama (the call for the actual standing for the prayers in rows) by saying its wordings once. (Iqama is pronounced when the people are ready for the prayer).",
            "urduTranslation":"´ہم سے عمران بن میسرہ نے بیان کیا، کہا کہ ہم سے عبدالوارث بن سعید نے بیان کیا، کہا کہ ہم سے خالد حذاء نے ابوقلابہ عبداللہ بن زید سے، انہوں نے انس رضی اللہ عنہ سے کہ` (نماز کے وقت کے اعلان کے لیے) لوگوں نے آگ اور ناقوس کا ذکر کیا۔ پھر یہود و نصاریٰ کا ذکر آ گیا۔ پھر بلال رضی اللہ عنہ کو یہ حکم ہوا کہ اذان کے کلمات دو دو مرتبہ کہیں اور اقامت میں ایک ایک مرتبہ۔"
         },
         {
            "arabic":"حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ ، قَالَ : حَدَّثَنَا عَبْدُ الرَّزَّاقِ ، قَالَ : أَخْبَرَنَا ابْنُ جُرَيْجٍ ، قَالَ : أَخْبَرَنِي نَافِعٌ ، أَنَّ ابْنَ عُمَرَ كَانَ ، يَقُولُ : كَانَ الْمُسْلِمُونَ حِينَ قَدِمُوا الْمَدِينَةَ يَجْتَمِعُونَ فَيَتَحَيَّنُونَ الصَّلَاةَ لَيْسَ يُنَادَى لَهَا ، فَتَكَلَّمُوا يَوْمًا فِي ذَلِكَ ، فَقَالَ بَعْضُهُمْ : اتَّخِذُوا نَاقُوسًا مِثْلَ نَاقُوسِ النَّصَارَى ، وَقَالَ بَعْضُهُمْ : بَلْ بُوقًا مِثْلَ قَرْنِ الْيَهُودِ ، فَقَالَ عُمَرُ : أَوَلَا تَبْعَثُونَ رَجُلًا يُنَادِي بِالصَّلَاةِ ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" يَا بِلَالُ قُمْ فَنَادِ بِالصَّلَاةِ \" .",
            "englishTranslation":"Narrated Ibn `Umar: When the Muslims arrived at Medina, they used to assemble for the prayer, and used to guess the time for it. During those days, the practice of Adhan for the prayers had not been introduced yet. Once they discussed this problem regarding the call for prayer. Some people suggested the use of a bell like the Christians, others proposed a trumpet like the horn used by the Jews, but `Umar was the first to suggest that a man should call (the people) for the prayer; so Allah's Apostle ordered Bilal to get up and pronounce the Adhan for prayers.",
            "urduTranslation":"´ہم سے محمود بن غیلان نے بیان کیا، کہا کہ ہم سے عبدالرزاق بن ہمام نے، کہا کہ ہمیں عبدالملک ابن جریج نے خبر دی، کہا کہ مجھے نافع نے خبر دی کہ عبداللہ بن عمر رضی اللہ عنہما کہتے تھے کہ` جب مسلمان (ہجرت کر کے) مدینہ پہنچے تو وقت مقرر کر کے نماز کے لیے آتے تھے۔ اس کے لیے اذان نہیں دی جاتی تھی۔ ایک دن اس بارے میں مشورہ ہوا۔ کسی نے کہا نصاریٰ کی طرح ایک گھنٹہ لے لیا جائے اور کسی نے کہا کہ یہودیوں کی طرح نرسنگا (بگل بنا لو، اس کو پھونک دیا کرو) لیکن عمر رضی اللہ عنہ نے فرمایا کہ کسی شخص کو کیوں نہ بھیج دیا جائے جو نماز کے لیے پکار دیا کرے۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے (اسی رائے کو پسند فرمایا اور بلال سے) فرمایا کہ بلال! اٹھ اور نماز کے لیے اذان دے۔"
         },
         {
            "arabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ ، قَالَ : حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ ، عَنْ سِمَاكِ بْنِ عَطِيَّةَ ، عَنْ أَيُّوبَ ، عَنْ أَبِي قِلَابَةَ ، عَنْ أَنَسٍ ، قَالَ : \" أُمِرَ بِلَالٌ أَنْ يَشْفَعَ الْأَذَانَ وَأَنْ يُوتِرَ الْإِقَامَةَ ، إِلَّا الْإِقَامَةَ \" .",
            "englishTranslation":"Narrated Anas: Bilal was ordered to repeat the wording of the Adhan for prayers twice, and to pronounce the wording of the Iqama once except \"Qad-qamat-is-salat\".",
            "urduTranslation":"´ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا سماک بن عطیہ سے، انہوں نے ایوب سختیانی سے، انہوں نے ابوقلابہ سے، انہوں نے انس رضی اللہ عنہ سے کہ` بلال رضی اللہ عنہ کو حکم دیا گیا کہ اذان کے کلمات دو دو مرتبہ کہیں اور سوا «قد قامت الصلوة» کے تکبیر کے کلمات ایک ایک دفعہ کہیں۔"
         },
         {
            "arabic":"حَدَّثَنَا مُحَمَّدٌ ، قَالَ : أَخْبَرَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ ، قَالَ : أَخْبَرَنَا خَالِدٌ الْحَذَّاءُ ، عَنْ أَبِي قِلَابَةَ ، عَنْ أَنَسِ بْنِ مَالِكٍ ، قَالَ : لَمَّا كَثُرَ النَّاسُ ، قَالَ : \" ذَكَرُوا أَنْ يَعْلَمُوا وَقْتَ الصَّلَاةِ بِشَيْءٍ يَعْرِفُونَهُ ، فَذَكَرُوا أَنْ يُورُوا نَارًا أَوْ يَضْرِبُوا نَاقُوسًا ، فَأُمِرَ بِلَالٌ أَنْ يَشْفَعَ الْأَذَانَ وَأَنْ يُوتِرَ الْإِقَامَةَ \" .",
            "englishTranslation":"Narrated Anas bin Malik: When the number of Muslims increased they discussed the question as to how to know the time for the prayer by some familiar means. Some suggested that a fire be lit (at the time of the prayer) and others put forward the proposal to ring the bell. Bilal was ordered to pronounce the wording of Adhan twice and of the Iqama once only.",
            "urduTranslation":"´ہم سے محمد بن سلام نے بیان کیا، کہا ہم سے عبدالوہاب ثقفی نے بیان کیا، کہا ہم سے خالد بن مہران حذاء نے ابوقلابہ عبدالرحمٰن بن زید حرمی سے بیان کیا، انہوں نے انس بن مالک رضی اللہ عنہ سے کہ` جب مسلمان زیادہ ہو گئے تو مشورہ ہوا کہ کسی ایسی چیز کے ذریعہ نماز کے وقت کا اعلان ہو جسے سب لوگ سمجھ لیں۔ کچھ لوگوں نے ذکر کیا کہ آگ روشن کی جائے۔ یا نرسنگا کے ذریعہ اعلان کریں۔ لیکن آخر میں بلال کو حکم دیا گیا کہ اذان کے کلمات دو دو دفعہ کہیں اور تکبیر کے ایک ایک دفعہ۔"
         },
         {
            "arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ ، حَدَّثَنَا خَالِدٌ ، عَنْ أَبِي قِلَابَةَ ، عَنْ أَنَسٍ ، قَالَ : \" أُمِرَ بِلَالٌ أَنْ يَشْفَعَ الْأَذَانَ وَأَنْ يُوتِرَ الْإِقَامَةَ \" ، قَالَ إِسْمَاعِيلُ : فَذَكَرْتُ لِأَيُّوبَ ، فَقَالَ : إِلَّا الْإِقَامَةَ .",
            "englishTranslation":"Narrated Abu Qilaba: Anas said, \"Bilal was ordered to pronounce the wording of Adhan twice and of Iqama once only.\" The sub narrator Isma`il said, \"I mentioned that to Aiyub and he added (to that), \"Except Iqama (i.e. Qadqamat- is-salat which should be said twice).",
            "urduTranslation":"´ہم سے علی بن عبداللہ بن مدینی نے بیان کیا، کہا کہ ہم سے اسماعیل بن ابراہیم بن علیہ نے بیان کیا، کہا ہم سے خالد حذاء نے ابوقلابہ سے بیان کیا، انہوں نے انس رضی اللہ عنہ سے کہ` بلال رضی اللہ عنہ کو حکم دیا گیا کہ اذان کے کلمات دو دو دفعہ کہیں اور تکبیر میں یہی کلمات ایک ایک دفعہ۔ اسماعیل نے بتایا کہ میں نے ایوب سختیانی سے اس حدیث کا ذکر کیا تو انہوں نے کہا مگر لفظ «قد قامت الصلوة» دو ہی دفعہ کہا جائے گا۔"
         }
      ]
   },
   {
      "hadithName":"Al-jumuah Friday",
      "data":[
         {
            "arabic":"حَدَّثَنَا أَبُو الْيَمَانِ ، قَالَ : أَخْبَرَنَا شُعَيْبٌ ، قَالَ : حَدَّثَنَا أَبُو الزِّنَادِ ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ هُرْمُزَ الْأَعْرَجَ مَوْلَى رَبِيعَةَ بْنِ الْحَارِثِ ، حَدَّثَهُ أَنَّهُسَمِعَ أَبَا هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، يَقُولُ : \" نَحْنُ الْآخِرُونَ السَّابِقُونَ يَوْمَ الْقِيَامَةِ ، بَيْدَ أَنَّهُمْ أُوتُوا الْكِتَابَ مِنْ قَبْلِنَا ثُمَّ هَذَا يَوْمُهُمُ الَّذِي فُرِضَ عَلَيْهِمْ ، فَاخْتَلَفُوا فِيهِ ، فَهَدَانَا اللَّهُ فَالنَّاسُ لَنَا فِيهِ تَبَعٌ الْيَهُودُ غَدًا وَالنَّصَارَى بَعْدَ غَدٍ \" .",
            "englishTranslation":"Narrated Abu Huraira: I heard Allah's Apostle (p.b.u.h) saying, \"We (Muslims) are the last (to come) but (will be) the foremost on the Day of Resurrection though the former nations were given the Holy Scriptures before us. And this was their day (Friday) the celebration of which was made compulsory for them but they differed about it. So Allah gave us the guidance for it (Friday) and all the other people are behind us in this respect: the Jews' (holy day is) tomorrow (i.e. Saturday) and the Christians' (is) the day after tomorrow (i.e. Sunday).\"",
            "urduTranslation":"´ہم سے ابوالیمان نے بیان کیا، کہا کہ ہمیں شعیب نے خبر دی، کہا کہ ہم سے ابوالزناد نے بیان کیا، ان سے ربیعہ بن حارث کے غلام عبدالرحمٰن بن ہرمز اعرج نے بیان کیا کہ انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا اور آپ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے سنا، آپ نے فرمایا کہ` ہم دنیا میں تمام امتوں کے بعد ہونے کے باوجود قیامت میں سب سے آگے رہیں گے فرق صرف یہ ہے کہ کتاب انہیں ہم سے پہلے دی گئی تھی۔ یہی (جمعہ) ان کا بھی دن تھا جو تم پر فرض ہوا ہے۔ لیکن ان کا اس کے بارے میں اختلاف ہوا اور اللہ تعالیٰ نے ہمیں یہ دن بتا دیا اس لیے لوگ اس میں ہمارے تابع ہوں گے۔ یہود دوسرے دن ہوں گے اور نصاریٰ تیسرے دن۔"
         },
         {
            "arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ ، قَالَ : أَخْبَرَنَا مَالِكٌ ، عَنْ نَافِعٍ ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، قَالَ : \" إِذَا جَاءَ أَحَدُكُمُ الْجُمُعَةَ فَلْيَغْتَسِلْ \" .",
            "englishTranslation":"Narrated `Abdullah bin `Umar: Allah's Apostle (p.b.u.h) said, \"Anyone of you attending the Friday (prayers) should take a bath.\"",
            "urduTranslation":"´ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، انہوں نے کہا کہ ہمیں امام مالک نے نافع سے خبر دی اور ان کو عبداللہ بن عمر رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ` تم میں سے جب کوئی شخص جمعہ کی نماز کے لیے آنا چا ہے تو اسے غسل کر لینا چاہیے۔"
         },
         {
            "arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ ، قَالَ : أَخْبَرَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ ، عَنْ مَالِكٍ ، عَنِ الزُّهْرِيِّ ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ ، عَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ بَيْنَمَا هُوَ قَائِمٌ فِي الْخُطْبَةِ يَوْمَ الْجُمُعَةِ ، إِذْ دَخَلَ رَجُلٌ مِنْ الْمُهَاجِرِينَ الْأَوَّلِينَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَنَادَاهُ عُمَرُ : أَيَّةُ سَاعَةٍ هَذِهِ ؟ قَالَ : إِنِّي شُغِلْتُ فَلَمْ أَنْقَلِبْ إِلَى أَهْلِي حَتَّى سَمِعْتُ التَّأْذِينَ ، فَلَمْ أَزِدْ أَنْ تَوَضَّأْتُ ، فَقَالَ : وَالْوُضُوءُ أَيْضًا ، وَقَدْ عَلِمْتَ \" أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْمُرُ بِالْغُسْلِ \" .",
            "englishTranslation":"Narrated Ibn `Umar: While `Umar bin Al-Khattab was standing and delivering the sermon on a Friday, one of the companions of the Prophet, who was one of the foremost Muhajirs (emigrants) came. `Umar said to him, \"What is the time now?\" He replied, \"I was busy and could not go back to my house till I heard the Adhan. I did not perform more than the ablution.\" Thereupon `Umar said to him, \"Did you perform only the ablution although you know that Allah's Apostle (p.b.u.h) used to order us to take a bath (on Fridays)?\"",
            "urduTranslation":"´ہم سے عبداللہ بن محمد بن اسماء نے بیان کیا، انہوں نے کہا کہ ہم سے جویریہ بن اسماء نے امام مالک سے بیان کیا، ان سے زہری نے، ان سے سالم بن عبداللہ بن عمر رضی اللہ عنہما نے ان سے ابن عمر رضی اللہ عنہما نے کہ` عمر بن خطاب رضی اللہ عنہ جمعہ کے دن کھڑے خطبہ دے رہے تھے کہ اتنے میں نبی کریم صلی اللہ علیہ وسلم کے اگلے صحابہ مہاجرین میں سے ایک بزرگ تشریف لائے (یعنی عثمان رضی اللہ عنہ) عمر رضی اللہ عنہ نے ان سے کہا بھلا یہ کون سا وقت ہے انہوں نے فرمایا کہ میں مشغول ہو گیا تھا اور گھر واپس آتے ہی اذان سنی، اس لیے میں وضو سے زیادہ اور کچھ (غسل) نہ کر سکا۔ عمر رضی اللہ عنہ نے فرمایا کہ وضو بھی اچھا ہے۔ حالانکہ آپ کو معلوم ہے کہ نبی کریم صلی اللہ علیہ وسلم غسل کے لیے فرماتے تھے۔"
         },
         {
            "arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ ، قَالَ : أَخْبَرَنَا مَالِكٌ ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ ، عَنْ عَطَاءِ بْنِ يَسَارٍ ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، قَالَ : \" غُسْلُ يَوْمِ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ \" .",
            "englishTranslation":"Narrated Abu Sa`id Al-Khudri: Allah's Apostle (p.b.u.h) said, \"The taking of a bath on Friday is compulsory for every male (Muslim) who has attained the age of puberty.\"",
            "urduTranslation":"´ہم سے عبداللہ بن یوسف نے حدیث بیان کی، انہوں نے کہا کہ ہمیں مالک نے صفوان بن سلیم کے واسطہ سے خبر دی، انہیں عطاء بن یسار نے، انہیں ابو سعید خدری رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ` جمعہ کے دن ہر بالغ کے لیے غسل ضروری ہے۔"
         },
         {
            "arabic":"حَدَّثَنَا عَلِيُّ ، قَالَ : حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ ، قَالَ : حَدَّثَنَا شُعْبَةُ ، عَنْ أَبِي بَكرِ بْنِ الْمُنكَدِرِ ، قَالَ : حَدَّثَنِي عَمْرُو بْنُ سُلَيْمٍ الْأَنْصَارِيُّ ، قَالَ : أَشْهَدُ عَلَى أَبِي سَعِيدٍ ، قَالَ : أَشْهَدُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، قَالَ : \" الْغُسْلُ يَوْمَ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ ، وَأَنْ يَسْتَنَّ وَأَنْ يَمَسَّ طِيبًا إِنْ وَجَدَ \" ، قَالَ عَمْرٌو : أَمَّا الْغُسْلُ فَأَشْهَدُ أَنَّهُ وَاجِبٌ ، وَأَمَّا الِاسْتِنَانُ وَالطِّيبُ فَاللَّهُ أَعْلَمُ أَوَاجِبٌ هُوَ أَمْ لَا ، وَلَكِنْ هَكَذَا فِي الْحَدِيثِ ، قَال أَبُو عَبْد اللَّهِ هُوَ أَخُو مُحَمَّدِ بْنِ الْمُنْكَدِرِ : وَلَمْ يُسَمَّ أَبُو بَكْرٍ هَذَا رَوَاهُ عَنْهُ بُكَيْرُ بْنُ الْأَشَجِّ ، وَسَعِيدُ بْنُ أَبِي هِلَالٍ وَعِدَّةٌ ، وَكَانَ مُحَمَّدُ بْنُ الْمُنْكَدِرِ يُكْنَى بِأَبِي بَكْرٍ ، وَأَبِي عَبْدِ اللَّهِ .",
            "englishTranslation":"Narrated Abu Sa`id: I testify that Allah's Apostle said, \"The taking of a bath on Friday is compulsory for every male Muslim who has attained the age of puberty and (also) the cleaning of his teeth with Siwak, and the using of perfume if it is available.\" `Amr (a sub-narrator) said, \"I confirm that the taking of a bath is compulsory, but as for the Siwak and the using of perfume, Allah knows better whether it is obligatory or not, but according to the Hadith it is as above.\")",
            "urduTranslation":"´ہم سے علی بن مدینی نے بیان کیا، انہوں نے کہا کہ ہمیں حرمی بن عمارہ نے خبر دی انہوں نے کہا کہ ہم سے شعبہ بن حجاج نے ابوبکر بن منکدر سے بیان کیا، انہوں نے کہا کہ مجھ سے عمرو بن سلیم انصاری نے بیان کیا، انہوں نے کہا کہ میں گواہ ہوں کہ ابو سعید خدری رضی اللہ عنہ نے فرمایا تھا کہ میں گواہ ہوں کہ` رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جمعہ کے دن ہر جوان پر غسل، مسواک اور خوشبو لگانا اگر میسر ہو، ضروری ہے۔ عمرو بن سلیم نے کہا کہ غسل کے متعلق تو میں گواہی دیتا ہوں کہ وہ واجب ہے لیکن مسواک اور خوشبو کا علم اللہ تعالیٰ کو زیادہ ہے کہ وہ بھی واجب ہیں یا نہیں۔ لیکن حدیث میں اسی طرح ہے۔ ابوعبداللہ (امام بخاری رحمہ اللہ) نے فرمایا کہ ابوبکر بن منکدر محمد بن منکدر کے بھائی تھے اور ان کا نام معلوم نہیں (ابوبکر ان کی کنیت تھی) بکیر بن اشج۔ سعید بن ابی ہلال اور بہت سے لوگ ان سے روایت کرتے ہیں۔ اور محمد بن منکدر ان کے بھائی کی کنیت ابوبکر اور ابوعبداللہ بھی تھی۔"
         }
      ]
   },
   {
      "hadithName":"Salat-ul-khauf Fear Prayer",
      "data":[
         {
            "arabic":"حَدَّثَنَا أَبُو الْيَمَانِ ، قَالَ : أَخْبَرَنَا شُعَيْبٌ ، عَنِ الزُّهْرِيِّ ، قَالَ : سَأَلْتُهُ ، هَلْ صَلَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْنِي صَلَاةَ الْخَوْفِ ؟ قَالَ :أَخْبَرَنِي سَالِمٌ ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ : \" غَزَوْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قِبَلَ نَجْدٍ فَوَازَيْنَا الْعَدُوَّ فَصَافَفْنَا لَهُمْ ، فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي لَنَا فَقَامَتْ طَائِفَةٌ مَعَهُ تُصَلِّي وَأَقْبَلَتْ طَائِفَةٌ عَلَى الْعَدُوِّ وَرَكَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَنْ مَعَهُ وَسَجَدَ سَجْدَتَيْنِ ، ثُمَّ انْصَرَفُوا مَكَانَ الطَّائِفَةِ الَّتِي لَمْ تُصَلِّ فَجَاءُوا فَرَكَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهِمْ رَكْعَةً وَسَجَدَ سَجْدَتَيْنِ ثُمَّ سَلَّمَ ، فَقَامَ كُلُّ وَاحِدٍ مِنْهُمْ فَرَكَعَ لِنَفْسِهِ رَكْعَةً وَسَجَدَ سَجْدَتَيْنِ \" .",
            "englishTranslation":"Narrated Shu'aib: I asked Az-Zuhri, \"Did the Prophet ever offer the Fear Prayer?\" Az-Zuhri said, \"I was told by Salim that `Abdullah bin `Umar I had said, 'I took part in a holy battle with Allah's Apostle I in Najd. We faced the enemy and arranged ourselves in rows. Then Allah's Apostle (p.b.u.h) stood up to lead the prayer and one party stood to pray with him while the other faced the enemy. Allah's Apostle (p.b.u.h) and the former party bowed and performed two prostrations. Then that party left and took the place of those who had not prayed. Allah's Apostle prayed one rak`a (with the latter) and performed two prostrations and finished his prayer with Taslim. Then everyone of them bowed once and performed two prostrations individually.' \"",
            "urduTranslation":"ہم سے ابوالیمان نے بیان کیا، کہا کہ ہمیں شعیب نے زہری سے خبر دی، انہوں نے زہری سے پوچھا کیا نبی کریم صلی اللہ علیہ وسلم نے صلوۃ خوف پڑھی تھی؟ اس پر انہوں نے فرمایا کہ ہمیں سالم نے خبر دی کہ عبداللہ بن عمر رضی اللہ عنہما نے بتلایا کہ` میں نجد کی طرف نبی کریم صلی اللہ علیہ وسلم کے ساتھ غزوہ (ذات الرقاع) میں شریک تھا۔ دشمن سے مقابلہ کے وقت ہم نے صفیں باندھیں۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے ہمیں خوف کی نماز پڑھائی (تو ہم میں سے) ایک جماعت آپ صلی اللہ علیہ وسلم کے ساتھ نماز پڑھنے میں شریک ہو گئی اور دوسرا گروہ دشمن کے مقابلہ میں کھڑا رہا۔ پھر رسول اللہ صلی اللہ علیہ وسلم نے اپنی اقتداء میں نماز پڑھنے والوں کے ساتھ ایک رکوع اور دو سجدے کئے۔ پھر یہ لوگ لوٹ کر اس جماعت کی جگہ آ گئے جس نے ابھی نماز نہیں پڑھی تھی۔ اب دوسری جماعت آئی۔ ان کے ساتھ بھی آپ صلی اللہ علیہ وسلم نے ایک رکوع اور دو سجدے کئے۔ پھر آپ صلی اللہ علیہ وسلم نے سلام پھیر دیا۔ اس گروہ میں سے ہر شخص کھڑا ہوا اور اس نے اکیلے اکیلے ایک رکوع اور دو سجدے ادا کئے۔"
         },
         {
            "arabic":"حَدَّثَنَا سَعِيدُ بْنُ يَحْيَى بْنِ سَعِيدٍ الْقُرَشِيُّ ، قَالَ : حَدَّثَنِي أَبِي ، قَالَ : حَدَّثَنَا ابْنُ جُرَيْجٍ ، عَنْ مُوسَى بْنِ عُقْبَةَ ، عَنْ نَافِعٍ ، عَنْ ابْنِ عُمَرَ ، نَحْوًا مِنْ قَوْلِ مُجَاهِدٍ إِذَا اخْتَلَطُوا قِيَامًا ، وَزَادَ ابْنُ عُمَرَ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، \" وَإِنْ كَانُوا أَكْثَرَ مِنْ ذَلِكَ فَلْيُصَلُّوا قِيَامًا وَرُكْبَانًا \" .",
            "englishTranslation":"Narrated Nafi`: Ibn `Umar said something similar to Mujahid's saying: Whenever (Muslims and non-Muslims) stand face to face in battle, the Muslims can pray while standing. Ibn `Umar added, \"The Prophet said, 'If the number of the enemy is greater than the Muslims, they can pray while standing or riding (individually).' \"",
            "urduTranslation":"´ہم سے سعید بن یحییٰ بن سعید قرشی نے بیان کیا کہا کہ مجھ سے میرے باپ یحییٰ نے بیان کیا، انہوں نے کہا کہ ہم سے ابن جریج نے بیان کیا، ان سے موسیٰ بن عقبہ نے، ان سے نافع نے، ان سے عبداللہ بن عمر رضی اللہ عنہما نے مجاہد کے قول کی طرح بیان کیا کہ` جب جنگ میں لوگ ایک دوسرے سے گٹھ جائیں تو کھڑے کھڑے نماز پڑھ لیں اور ابن عمر رضی اللہ عنہما نے نبی کریم صلی اللہ علیہ وسلم سے اپنی روایت میں اضافہ اور کیا ہے کہ اگر کافر بہت سارے ہوں کہ مسلمانوں کو دم نہ لینے دیں تو کھڑے کھڑے اور سوار رہ کر (جس طور ممکن ہو) اشاروں سے ہی سہی مگر نماز پڑھ لیں۔"
         },
         {
            "arabic":"حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ ، قَالَ : حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ ، عَنْ الزُّبَيْدِيِّ ، عَنِ الزُّهْرِيِّ ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ ، عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا ، قَالَ : \" قَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَامَ النَّاسُ مَعَهُ فَكَبَّرَ وَكَبَّرُوا مَعَهُ ، وَرَكَعَ وَرَكَعَ نَاسٌ مِنْهُمْ ، ثُمَّ سَجَدَ وَسَجَدُوا مَعَهُ ، ثُمَّ قَامَ لِلثَّانِيَةِ فَقَامَ الَّذِينَ سَجَدُوا وَحَرَسُوا إِخْوَانَهُمْ ، وَأَتَتِ الطَّائِفَةُ الْأُخْرَى فَرَكَعُوا وَسَجَدُوا مَعَهُ وَالنَّاسُ كُلُّهُمْ فِي صَلَاةٍ وَلَكِنْ يَحْرُسُ بَعْضُهُمْ بَعْضًا \" .",
            "englishTranslation":"Narrated Ibn `Abbas: Once the Prophet (p.b.u.h) led the fear prayer and the people stood behind him. He said Takbir (Allahu-Akbar) and the people said the same. He bowed and some of them bowed. Then he prostrated and they also prostrated. Then he stood for the second rak`a and those who had prayed the first rak`a left and guarded their brothers. The second party joined him and performed bowing and prostration with him. All the people were in prayer but they were guarding one another during the prayer.",
            "urduTranslation":"ہم سے حیوہ بن شریح نے بیان کیا، انہوں نے کہا کہ ہم سے محمد بن حرب نے زبیدی سے بیان کیا، ان سے زہری نے، ان سے عبیداللہ بن عبداللہ بن عتبہ بن مسعود نے، ان سے عبداللہ بن عباس رضی اللہ عنہما نے کہ` نبی کریم صلی اللہ علیہ وسلم کھڑے ہوئے اور دوسرے لوگ بھیآپ صلی اللہ علیہ وسلم کی اقتداء میں کھڑے ہوئے۔ نبی کریم صلی اللہ علیہ وسلم نے تکبیر کہی تو لوگوں نے بھی تکبیر کہی۔ آپ صلی اللہ علیہ وسلم نے رکوع کیا تو لوگوں نے آپ صلی اللہ علیہ وسلم کے  ساتھ رکوع اور سجدہ کر لیا تھا وہ کھڑے کھڑے اپنے بھائیوں کی نگرانی کرتے رہے۔ اور دوسرا گروہ آیا۔ (جو اب تک حفاظت کے لیے دشمن کے مقابلہ میں کھڑا رہا بعد میں) اس نے بھی رکوع اور سجدے کئے۔ سب لوگ نماز میں تھے لیکن لوگ ایک دوسرے کی حفاظت کر رہے تھے۔"
         },
         {
            "arabic":"حَدَّثَنَا يَحْيَى ، قَالَ : حَدَّثَنَا وَكِيعٌ ، عَنْ عَلِيِّ بْنِ مُبَارَكٍ ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ ، عَنْ أَبِي سَلَمَةَ ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ، قَالَ : جَاءَ عُمَرُ يَوْمَ الْخَنْدَقِ فَجَعَلَ يَسُبُّ كُفَّارَ قُرَيْشٍ وَيَقُولُ : يَا رَسُولَ اللَّهِ مَا صَلَّيْتُ الْعَصْرَ حَتَّى كَادَتِ الشَّمْسُ أَنْ تَغِيبَ ، فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" وَأَنَا وَاللَّهِ مَا صَلَّيْتُهَا بَعْدُ ، قَالَ : فَنَزَلَ إِلَى بُطْحَانَ فَتَوَضَّأَ وَصَلَّى الْعَصْرَ بَعْدَ مَا غَابَتِ الشَّمْسُ ، ثُمَّ صَلَّى الْمَغْرِبَ بَعْدَهَا \" .",
            "englishTranslation":"Narrated Jabir bin `Abdullah: On the day of the Khandaq `Umar came, cursing the disbelievers of Quraish and said, \"O Allah's Apostle! I have not offered the `Asr prayer and the sun has set.\" The Prophet replied, \"By Allah! I too, have not offered the prayer yet. \"The Prophet then went to Buthan, performed ablution and performed the `Asr prayer after the sun had set and then offered the Maghrib prayer after it.\"",
            "urduTranslation":"´ہم سے یحییٰ بن جعفر نے بیان کیا کہ ہم سے وکیع نے علی بن مبارک سے بیان کیا، ان سے یحییٰ بن ابی کثیر نے، ان سے ابوسلمہ نے، ان سے جابر بن عبداللہ انصاری رضی اللہ عنہ نے کہ` عمر رضی اللہ عنہ غزوہ خندق کے دن کفار کو برا بھلا کہتے ہوئے آئے اور عرض کرنے لگے کہ یا رسول اللہ! سورج ڈوبنے ہی کو ہے اور میں نے تو اب تک عصر کی نماز نہیں پڑھی، اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ بخدا میں نے بھی ابھی تک نہیں پڑھی انہوں نے بیان کیا کہ پھر آپ ”بطحان“ کی طرف گئے (جو مدینہ میں ایک میدان تھا) اور وضو کر کے آپ نے وہاں سورج غروب ہونے کے بعد عصر کی نماز پڑھی، پھر اس کے بعد نماز مغرب پڑھی۔"
         },
         {
            "arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ ، قَالَ : حَدَّثَنَا جُوَيْرِيَةُ ، عَنْ نَافِعٍ ، عَنِ ابْنِ عُمَرَ ، قَالَ : قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَنَا لَمَّا رَجَعَ مِنْ الْأَحْزَابِ : \" لَا يُصَلِّيَنَّ أَحَدٌ الْعَصْرَ إِلَّا فِي بَنِي قُرَيْظَةَ \" ، فَأَدْرَكَ بَعْضَهُمُ الْعَصْرُ فِي الطَّرِيقِ ، فَقَالَ بَعْضُهُمْ : لَا نُصَلِّي حَتَّى نَأْتِيَهَا ، وَقَالَ بَعْضُهُمْ : بَلْ نُصَلِّي لَمْ يُرَدْ مِنَّا ذَلِكَ ، فَذُكِرَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يُعَنِّفْ وَاحِدًا مِنْهُمْ .",
            "englishTranslation":"Narrated Ibn `Umar:When the Prophet (saws) returned from the battle of Al-Ahzab (The confederates), he said to us, \"None should offer the 'Asr prayer but at Bani Quraiza.\" The 'Asr prayer became due for some of them on the way. Some of them decided not to offer the Salat but at Bani Quraiza while others decided to offer the Salat on the spot and said that the intention of the Prophet (saws) was not what the former party had understood. And when that was told to the Prophet (saws) he did not blame anyone of them.",
            "urduTranslation":"´ہم سے عبداللہ بن محمد بن اسماء نے بیان کیا، کہا کہ ہم سے جویریہ بن اسماء نے نافع سے، ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ` جب نبی کریم صلی اللہ علیہ وسلم غزوہ خندق سے فارغ ہوئے (ابوسفیان لوٹے) تو ہم سے آپ صلی اللہ علیہ وسلم نے فرمایا کوئی شخص بنو قریظہ کے محلہ میں پہنچنے سے پہلے نماز عصر نہ پڑھے لیکن جب عصر کا وقت آیا تو بعض صحابہ نے راستہ ہی میں نماز پڑھ لی اور بعض صحابہ رضی اللہ عنہم نے کہا کہ ہم بنو قریظہ کے محلہ میں پہنچنے پر نماز عصر پڑھیں گے اور کچھ حضرات کا خیال یہ ہوا کہ ہمیں نماز پڑھ لینی چاہیے کیونکہ نبی کریم صلی اللہ علیہ وسلم کا مقصد یہ نہیں تھا کہ نماز قضاء کر لیں۔ پھر جب آپ سے اس کا ذکر کیا گیا تو آپ صلی اللہ علیہ وسلم نے کسی پر بھی ملامت نہیں فرمائی۔"
         }
      ]
   },
   {
      "hadithName":"The Two Eid Prayers And Festivals",
      "data":[
         {
            "arabic":"حَدَّثَنَا أَبُو الْيَمَانِ ، قَالَ : أَخْبَرَنَا شُعَيْبٌ ، عَنِ الزُّهْرِيِّ ، قَالَ : أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ قَالَ : أَخَذَ عُمَرُ جُبَّةً مِنْ إِسْتَبْرَقٍ تُبَاعُ فِي السُّوقِ فَأَخَذَهَا ، فَأَتَى بِهَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَقَالَ : يَا رَسُولَ اللَّهِ ابْتَعْ هَذِهِ تَجَمَّلْ بِهَا لِلْعِيدِ وَالْوُفُودِ ، فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" إِنَّمَا هَذِهِ لِبَاسُ مَنْ لَا خَلَاقَ لَهُ فَلَبِثَ عُمَرُ مَا شَاءَ اللَّهُ أَنْ يَلْبَثَ ، ثُمَّ أَرْسَلَ إِلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِجُبَّةِ دِيبَاجٍ ، فَأَقْبَلَ بِهَا عُمَرُ ، فَأَتَى بِهَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ : يَا رَسُولَ اللَّهِ إِنَّكَ قُلْتَ إِنَّمَا هَذِهِ لِبَاسُ مَنْ لَا خَلَاقَ لَهُ وَأَرْسَلْتَ إِلَيَّ بِهَذِهِ الْجُبَّةِ ، فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : تَبِيعُهَا أَوْ تُصِيبُ بِهَا حَاجَتَكَ \" .",
            "englishTranslation":"Narrated `Abdullah bin `Umar: `Umar bought a silk cloak from the market, took it to Allah's Apostle and said, \"O Allah's Apostle! Take it and adorn yourself with it during the `Id and when the delegations visit you.\" Allah's Apostle (p.b.u.h) replied, \"This dress is for those who have no share (in the Hereafter).\" After a long period Allah's Apostle (p.b.u.h) sent to `Umar a cloak of silk brocade. `Umar came to Allah's Apostle (p.b.u.h) with the cloak and said, \"O Allah's Apostle! You said that this dress was for those who had no share (in the Hereafter); yet you have sent me this cloak.\" Allah's Apostle said to him, \"Sell it and fulfill your needs by it.\"",
            "urduTranslation":"´ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا کہ ہمیں شعیب نے زہری سے خبر دی، انہوں نے کہا کہ مجھے سالم بن عبداللہ نے خبر دی کہ عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ` عمر رضی اللہ عنہ ایک موٹے ریشمی کپڑے کا چغہ لے کر رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے جو بازار میں بک رہا تھا کہنے لگے: یا رسول اللہ! آپ اسے خرید لیجئے اور عید اور وفود کی پذیرائی کے لیے اسے پہن کر زینت فرمایا کیجئے۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ یہ تو وہ پہنے گا جس کا (آخرت میں) کوئی حصہ نہیں۔ اس کے بعد جب تک اللہ نے چاہا عمر رہی پھر ایک دن رسول اللہ صلی اللہ علیہ وسلم نے خود ان کے پاس ایک ریشمی چغہ تحفہ میں بھیجا۔ عمر رضی اللہ عنہ اسے لیے ہوئے آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور کہا کہ یا رسول اللہ! آپ نے تو یہ فرمایا کہ اس کو وہ پہنے گا جس کا آخرت میں کوئی حصہ نہیں پھر آپ نے یہ میرے پاس کیوں بھیجا؟ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے اسے تیرے پہننے کو نہیں بھیجا بلکہ اس لیے کہ تم اسے بیچ کر اس کی قیمت اپنے کام میں لاؤ۔"
         },
         {
            "arabic":"حَدَّثَنَا أَحْمَدُ بْنُ عِيسَى ، قَالَ : حَدَّثَنَا ابْنُ وَهْبٍ ، قَالَ : أَخْبَرَنَا عَمْرٌو ، أَنَّ مُحَمَّدَ بْنَ عَبْدِ الرَّحْمَنِ الْأَسَدِيّ حَدَّثَهُ ، عَنْ عُرْوَةَ ، عَنْ عَائِشَةَ ، قَالَتْ : \" دَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعِنْدِي جَارِيَتَانِ تُغَنِّيَانِ بِغِنَاءِ بُعَاثَ ، فَاضْطَجَعَ عَلَى الْفِرَاشِ وَحَوَّلَ وَجْهَهُ وَدَخَلَ أَبُو بَكْرٍ فَانْتَهَرَنِي وَقَالَ : مِزْمَارَةُ الشَّيْطَانِ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَأَقْبَلَ عَلَيْهِ رَسُولُ اللَّهِ عَلَيْهِ السَّلَام ، فَقَالَ : دَعْهُمَا ، فَلَمَّا غَفَلَ غَمَزْتُهُمَا فَخَرَجَتَا .",
            "englishTranslation":"Narrated Aisha: Allah's Apostle (p.b.u.h) came to my house while two girls were singing beside me the songs of Buath (a story about the war between the two tribes of the Ansar, the Khazraj and the Aus, before Islam). The Prophet (p.b.u.h) lay down and turned his face to the other side. Then Abu Bakr came and spoke to me harshly saying, \"Musical instruments of Satan near the Prophet (p.b.u.h) ?\" Allah's Apostle (p.b.u.h) turned his face towards him and said, \"Leave them.\" When Abu Bakr became inattentive, I signaled to those girls to go out and they left.",
            "urduTranslation":"´ہم سے احمد بن عیسیٰ نے بیان کیا، کہا کہ ہم سے عبداللہ بن وہب نے بیان کیا، کہا کہ مجھے عمرو بن حارث نے خبر دی کہ محمد بن عبدالرحمٰن اسدی نے ان سے بیان کیا، ان سے عروہ نے، ان سے عائشہ رضی اللہ عنہا نے، انہوں نے بتلایا کہ` ایک دن نبی کریم صلی اللہ علیہ وسلم میرے گھر تشریف لائے اس وقت میرے پاس (انصار کی) دو لڑکیاں جنگ بعاث کے قصوں کی نظمیں پڑھ رہی تھیں۔ آپ صلی اللہ علیہ وسلم بستر پر لیٹ گئے اور اپنا چہرہ دوسری طرف پھیر لیا۔ اس کے بعد ابوبکر رضی اللہ عنہ آئے اور مجھے ڈانٹا اور فرمایا کہ یہ شیطانی باجہ نبی کریم صلی اللہ علیہ وسلم کی موجودگی میں؟ آخر نبی کریم صلی اللہ علیہ وسلم ان کی طرف متوجہ ہوئے اور فرمایا کہ جانے دو خاموش رہو پھر جب ابوبکر رضی اللہ عنہ دوسرے کام میں لگ گئے تو میں نے انہیں اشارہ کیا اور وہ چلی گئیں۔"
         },
         {
            "arabic":"وَكَانَ يَوْمَ عِيدٍ يَلْعَبُ السُّودَانُ بِالدَّرَقِ وَالْحِرَابِ فَإِمَّا سَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَإِمَّا قَالَ : تَشْتَهِينَ تَنْظُرِينَ فَقُلْتُ : نَعَمْ ، فَأَقَامَنِي وَرَاءَهُ خَدِّي عَلَى خَدِّهِ وَهُوَ يَقُولُ : دُونَكُمْ يَا بَنِي أَرْفِدَةَ حَتَّى إِذَا مَلِلْتُ ، قَالَ : حَسْبُكِ ، قُلْتُ : نَعَمْ ، قَالَ : فَاذْهَبِي \" .",
            "englishTranslation":"It was the day of `Id, and the Black people were playing with shields and spears; so either I requested the Prophet (p.b.u.h) or he asked me whether I would like to see the display. I replied in the affirmative. Then the Prophet (p.b.u.h) made me stand behind him and my cheek was touching his cheek and he was saying, \"Carry on! O Bani Arfida,\" till I got tired. The Prophet (p.b.u.h) asked me, \"Are you satisfied (Is that sufficient for you)?\" I replied in the affirmative and he told me to leave.",
            "urduTranslation":"اور یہ عید کا دن تھا۔ حبشہ کے کچھ لوگ ڈھالوں اور برچھوں سے کھیل رہے تھے۔ اب خود میں نے کہا یا نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کیا تم یہ کھیل دیکھو گی؟ میں نے کہا جی ہاں۔ پھر آپ صلی اللہ علیہ وسلم نے مجھے اپنے پیچھے کھڑا کر لیا۔ میرا رخسار آپ صلی اللہ علیہ وسلم کے رخسار پر تھا اور آپ صلی اللہ علیہ وسلم فرما رہے تھے کھیلو کھیلو اے بنی ارفدہ یہ حبشہ کے لوگوں کا لقب تھا پھر جب میں تھک گئی تو آپ صلی اللہ علیہ وسلم نے فرمایا ”بس!“ میں نے کہا جی ہاں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جاؤ۔"
         },
         {
            "arabic":"حَدَّثَنَا حَجَّاجٌ ، قَالَ : حَدَّثَنَا شُعْبَةُ ، قَالَ : أَخْبَرَنِي زُبَيْدٌ ، قَالَ : سَمِعْتُ الشَّعْبِيَّ ، عَنْ الْبَرَاءِ ، قَالَ : سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ ، فَقَالَ : \" إِنَّ أَوَّلَ مَا نَبْدَأُ مِنْ يَوْمِنَا هَذَا أَنْ نُصَلِّيَ ، ثُمَّ نَرْجِعَ فَنَنْحَرَ ، فَمَنْ فَعَلَ فَقَدْ أَصَابَ سُنَّتَنَا \" .",
            "englishTranslation":"Narrated Al-Bara': I heard the Prophet (p.b.u.h) delivering a Khutba saying, \"The first thing to be done on this day (first day of `Id ul Adha) is to pray; and after returning from the prayer we slaughter our sacrifices (in the name of Allah) and whoever does so, he acted according to our Sunna (traditions).\"",
            "urduTranslation":"´ہم سے حجاج بن منہال نے بیان کیا، کہا کہ ہم سے شعبہ نے بیان کیا، انہیں زبید بن حارث نے خبر دی، انہوں نے کہا کہ میں نے شعبی سے سنا، ان سے براء بن عازب رضی اللہ عنہ نے بیان کیا کہ` میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا، آپ صلی اللہ علیہ وسلم نے عید کے دن خطبہ دیتے ہوئے فرمایا کہ پہلا کام جو ہم آج کے دن (عید الاضحیٰ) میں کرتے ہیں، یہ ہے کہ پہلے ہم نماز پڑھیں پھر واپس آ کر قربانی کریں۔ جس نے اس طرح کیا وہ ہمارے طریق پر چلا۔"
         },
         {
            "arabic":"حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ ، قَالَ : حَدَّثَنَا أَبُو أُسَامَةَ ، عَنْ هِشَامٍ ، عَنْ أَبِيهِ ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا ، قَالَتْ : دَخَلَ أَبُو بَكْرٍ وَعِنْدِي جَارِيَتَانِ مِنْ جَوَارِي الْأَنْصَارِ تُغَنِّيَانِ بِمَا تَقَاوَلَتْ الْأَنْصَارُ يَوْمَ بُعَاثَ ، قَالَتْ : وَلَيْسَتَا بِمُغَنِّيَتَيْنِ ، فَقَالَ أَبُو بَكْرٍ : أَمَزَامِيرُ الشَّيْطَانِ فِي بَيْتِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَذَلِكَ فِي يَوْمِ عِيدٍ ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" يَا أَبَا بَكْرٍ إِنَّ لِكُلِّ قَوْمٍ عِيدًا وَهَذَا عِيدُنَا \" .",
            "englishTranslation":"Narrated Aisha: Abu Bakr came to my house while two small Ansari girls were singing beside me the stories of the Ansar concerning the Day of Buath. And they were not singers. Abu Bakr said protestingly, \"Musical instruments of Satan in the house of Allah's Apostle !\" It happened on the `Id day and Allah's Apostle said, \"O Abu Bakr! There is an `Id for every nation and this is our `Id.\"",
            "urduTranslation":"´ہم سے عبید بن اسماعیل نے بیان کیا، انہوں نے کہا کہ ہم سے ابواسامہ نے بیان کیا، ان سے ہشام بن عروہ نے، ان سے ان کے باپ (عروہ بن زبیر) نے، ان سے عائشہ رضی اللہ عنہا نے، آپ نے بتلایا کہ` ابوبکر رضی اللہ عنہ تشریف لائے تو میرے پاس انصار کی دو لڑکیاں وہ اشعار گا رہی تھیں جو انصار نے بعاث کی جنگ کے موقع پر کہے تھے۔ عائشہ رضی اللہ عنہا نے کہا کہ یہ گانے والیاں نہیں تھیں، ابوبکر رضی اللہ عنہ نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم کے گھر میں یہ شیطانی باجے اور یہ عید کا دن تھا آخر رسول اللہ صلی اللہ علیہ وسلم نے ابوبکر رضی اللہ عنہ سے فرمایا اے ابوبکر! ہر قوم کی عید ہوتی ہے اور آج یہ ہماری عید ہے۔"
         }
      ]
   },
   {
      "hadithName":"Witr",
      "data":[
         {
            "arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ ، قَالَ : أَخْبَرَنَا مَالِكٌ ، عَنْ نَافِعٍ ، وَعَبْدِ اللَّهِ بْنِ دِينَارٍ ، عَنِ ابْنِ عُمَرَ ، أَنَّ رَجُلًا سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَلَاةِ اللَّيْلِ ، فَقَالَ رَسُولُ اللَّهِ عَلَيْهِ السَّلَام : \" صَلَاةُ اللَّيْلِ مَثْنَى مَثْنَى ، فَإِذَا خَشِيَ أَحَدُكُمُ الصُّبْحَ صَلَّى رَكْعَةً وَاحِدَةً تُوتِرُ لَهُ مَا قَدْ صَلَّى \" .",
            "englishTranslation":"Narrated Ibn Umar: Once a person asked Allah's Apostle about the night prayer. Allah's Apostle replied, \"The night prayer is offered as two Rakat followed by two Rakat and so on and if anyone is afraid of the approaching dawn (Fajr prayer) he should pray one Raka and this will be a Witr for all the Rakat which he has prayed before.\"",
            "urduTranslation":"´ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا کہ ہمیں امام مالک رحمہ اللہ نے نافع اور عبداللہ ابن دینار سے خبر دی اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ` ایک شخص نے نبی کریم صلی اللہ علیہ وسلم سے رات میں نماز کے متعلق معلوم کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ رات کی نماز دو دو رکعت ہے پھر جب کوئی صبح ہو جانے سے ڈرے تو ایک رکعت پڑھ لے، وہ اس کی ساری نماز کو طاق بنا دے گی۔"
         },
         {
            "arabic":"وَعَنْ نَافِعٍ ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ كَانَ يُسَلِّمُ بَيْنَ الرَّكْعَةِ وَالرَّكْعَتَيْنِ فِي الْوِتْرِ حَتَّى يَأْمُرَ بِبَعْضِ حَاجَتِهِ .",
            "englishTranslation":"Nafi' told that 'Abdullah bin 'Umar used to say Taslim between (the first) two Rakat and (the third) odd one in the Witr prayer, when he wanted to attend to a certain matter (during that interval between the Rakat).",
            "urduTranslation":"´اور اسی سند کے ساتھ نافع سے روایت ہے کہ` عبداللہ بن عمر رضی اللہ عنہما وتر کی جب تین رکعتیں پڑھتے تو دو رکعت پڑھ کر سلام پھیرتے یہاں تک کہ ضرورت سے بات بھی کرتے۔"
         },
         {
            "arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ ، عَنْ مَالِكٍ ، عَنْ مَخْرَمَةَ بْنِ سُلَيْمَانَ ، عَنْ كُرَيْبٍ ، أَنَّ ابْنَ عَبَّاسٍ أَخْبَرَهُ ، أَنَّهُ بَاتَ عِنْدَ مَيْمُونَةَ وَهِيَ خَالَتُهُ فَاضْطَجَعْتُ فِي عَرْضِ وِسَادَةٍ ، وَاضْطَجَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَهْلُهُ فِي طُولِهَا فَنَامَ حَتَّى انْتَصَفَ اللَّيْلُ أَوْ قَرِيبًا مِنْهُ فَاسْتَيْقَظَ يَمْسَحُ النَّوْمَ عَنْ وَجْهِهِ ، ثُمَّ قَرَأَ عَشْرَ آيَاتٍ مِنْ آلِ عِمْرَانَ ، \" ثُمَّ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى شَنٍّ مُعَلَّقَةٍ فَتَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ ، ثُمَّ قَامَ يُصَلِّي ، فَصَنَعْتُ مِثْلَهُ ، فَقُمْتُ إِلَى جَنْبهِ فَوَضَعَ يَدَهُ الْيُمْنَى عَلَى رَأْسِي وَأَخَذَ بِأُذُنِي يَفْتِلُهَا ، ثُمَّ صَلَّى رَكْعَتَيْنِ ، ثُمَّ رَكْعَتَيْنِ ، ثُمَّ رَكْعَتَيْنِ ، ثُمَّ رَكْعَتَيْنِ ، ثُمَّ رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ، ثُمَّ أَوْتَرَ ، ثُمَّ اضْطَجَعَ حَتَّى جَاءَهُ الْمُؤَذِّنُ فَقَامَ فَصَلَّى رَكْعَتَيْنِ ، ثُمَّ خَرَجَ فَصَلَّى الصُّبْحَ \" .",
            "englishTranslation":"Narrated Ibn `Abbas: Once I passed the night in the house of Maimuna (his aunt). I slept across the bed while Allah's Apostle and his wife slept length-wise. The Prophet slept till midnight or nearly so and woke up rubbing his face and recited ten verses from Surat \"Al-`Imran.\" Allah's Apostle went towards a leather skin and performed ablution in the most perfect way and then stood for the prayer. I did the same and stood beside him. The Prophet put his right hand on my head, twisted my ear and then prayed two rak`at five times and then ended his prayer with witr. He laid down till the Mu'adh-dhin came then he stood up and offered two rak`at (Sunna of Fajr prayer) and then went out and offered the Fajr prayer. (See Hadith No. 183, Vol. 1)",
            "urduTranslation":"´ہم سے عبداللہ بن مسلمہ نے بیان کیا، ان سے امام مالک نے بیان کیا، ان سے مخرمہ بن سلیمان نے بیان کیا، ان سے کریب نے اور انہیں عبداللہ بن عباس رضی اللہ عنہما نے خبر دی کہ` آپ ایک رات اپنی خالہ ام المؤمنین میمونہ رضی اللہ عنہا کے یہاں سوئے (آپ رضی اللہ عنہ نے کہا کہ) میں تکیہ کے عرض میں لیٹ گیا اور رسول اللہ صلی اللہ علیہ وسلم اور آپ کی بیوی لمبائی میں لیٹیں، آپ صلی اللہ علیہ وسلم سو گئے جب آدھی رات گزر گئی یا اس کے لگ بھگ تو آپ صلی اللہ علیہ وسلم بیدار ہوئے نیند کے اثر کو چہرہ مبارک پر ہاتھ پھیر کر آپ صلی اللہ علیہ وسلم نے دور کیا۔ اس کے بعد آل عمران کی دس آیتیں پڑھیں۔ پھر ایک پرانی مشک پانی کی بھری ہوئی لٹک رہی تھی۔ آپ صلی اللہ علیہ وسلم اس کے پاس گئے اور اچھی طرح وضو کیا اور نماز کے لیے کھڑے ہو گئے۔ میں نے بھی ایسا ہی کیا۔ آپ صلی اللہ علیہ وسلم پیار سے اپنا داہنا ہاتھ میرے سر رکھ کر اور میرا کان پکڑ کر اسے ملنے لگے۔ پھر آپ صلی اللہ علیہ وسلم نے دو رکعت نماز پڑھی، پھر دو رکعت، پھر دو رکعت، پھر دو رکعت، پھر دو رکعت، پھر دو رکعت سب بارہ رکعتیں پھر ایک رکعت وتر پڑھ کر آپ صلی اللہ علیہ وسلم لیٹ گئے، یہاں تک کہ مؤذن صبح صادق کی اطلاع دینے آیا تو آپ صلی اللہ علیہ وسلم نے پھر کھڑے ہو کر دو رکعت سنت نماز پڑھی۔ پھر باہر تشریف لائے اور صبح کی نماز پڑھائی۔"
         },
         {
            "arabic":"حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ ، قَالَ : حَدَّثَنِي بْنُ وَهْبٍ ، قَالَ : أَخْبَرَنِي عَمْرُو ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ حَدَّثَهُ ، عَنْ أَبِيهِ ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ، قَالَ : قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" صَلَاةُ اللَّيْلِ مَثْنَى مَثْنَى ، فَإِذَا أَرَدْتَ أَنْ تَنْصَرِفَ فَارْكَعْ رَكْعَةً تُوتِرُ لَكَ مَا صَلَّيْتَ \" ، قَالَ الْقَاسِمُ : وَرَأَيْنَا أُنَاسًا مُنْذُ أَدْرَكْنَا يُوتِرُونَ بِثَلَاثٍ وَإِنَّ كُلًّا لَوَاسِعٌ أَرْجُو أَنْ لَا يَكُونَ بِشَيْءٍ مِنْهُ بَأْسٌ .",
            "englishTranslation":"Narrated `Abdullah bin `Umar: The Prophet said, \"Night prayer is offered as two rak`at followed by two rak`at and so on, and if you want to finish it, pray only one rak`a which will be witr for all the previous rak`at.\" Al-Qasim said, \"Since we attained the age of puberty we have seen some people offering a three-rak`at prayer as witr and all that is permissible. I hope there will be no harm in it.\"",
            "urduTranslation":"´ہم سے یحییٰ بن سلیمان نے بیان کیا، انہوں نے کہا کہ ہم سے عبداللہ بن وہب نے بیان کیا، انہوں نے کہا کہ ہمیں عمرو بن حارث نے خبر دی، ان سے عبدالرحمٰن بن قاسم نے اپنے باپ قاسم سے بیان کیا اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ` رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، رات کی نماز دو، دو رکعتیں ہے اور جب تو ختم کرنا چاہے تو ایک رکعت وتر پڑھ لے جو ساری نماز کو طاق بنا دے گی۔ قاسم بن محمد نے بیان کیا کہ ہم نے بہت سوں کو تین رکعت وتر پڑھتے بھی پایا ہے اور تین یا ایک (رکعت وتر) سب جائز اور مجھ کو امید ہے کہ کسی میں قباحت نہ ہو گی۔"
         },
         {
            "arabic":"حَدَّثَنَا أَبُو الْيَمَانِ ، قَالَ : أَخْبَرَنَا شُعَيْبٌ ، عَنِ الزُّهْرِيِّ ، قَالَ : عَنْ عُرْوَةُ ، أَنَّ عَائِشَةَ أَخْبَرَتْهُ ، \" أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي إِحْدَى عَشْرَةَ رَكْعَةً ، كَانَتْ تِلْكَ صَلَاتَهُ تَعْنِي بِاللَّيْلِ فَيَسْجُدُ السَّجْدَةَ مِنْ ذَلِكَ قَدْرَ مَا يَقْرَأُ أَحَدُكُمْ خَمْسِينَ آيَةً قَبْلَ أَنْ يَرْفَعَ رَأْسَهُ وَيَرْكَعُ رَكْعَتَيْنِ قَبْلَ صَلَاةِ الْفَجْرِ ، ثُمَّ يَضْطَجِعُ عَلَى شِقِّهِ الْأَيْمَنِ حَتَّى يَأْتِيَهُ الْمُؤَذِّنُ لِلصَّلَاةِ \" .",
            "englishTranslation":"Narrated `Aisha: Allah's Apostle used to pray eleven rak`at at night and that was his night prayer and each of his prostrations lasted for a period enough for one of you to recite fifty verses before Allah's Apostle raised his head. He also used to pray two rak`at (Sunna) before the (compulsory) Fajr prayer and then lie down on his right side till the Mu'adh-dhin came to him for the prayer.",
            "urduTranslation":"´ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا کہ ہمیں شعیب نے زہری سے خبر دی، انہوں نے کہا کہ مجھ سے عروہ بن زبیر نے بیان کیا کہ عائشہ رضی اللہ عنہا نے انہیں خبر دی کہ` رسول اللہ صلی اللہ علیہ وسلم گیارہ رکعتیں (وتر اور تہجد کی) پڑھتے تھے، آپ صلی اللہ علیہ وسلم کی یہی نماز تھی۔ مراد ان کی رات کی نماز تھی۔ آپ صلی اللہ علیہ وسلم کا سجدہ ان رکعتوں میں اتنا لمبا ہوتا تھا کہ سر اٹھانے سے پہلے تم میں سے کوئی شخص بھی پچاس آیتیں پڑھ سکتا اور فجر کی نماز فرض سے پہلے آپ صلی اللہ علیہ وسلم سنت دو رکعتیں پڑھتے تھے اس کے بعد (ذرا دیر) داہنے پہلو پر لیٹ رہتے یہاں تک کہ مئوذن بلانے کے لیے آپ صلی اللہ علیہ وسلم کے پاس آتا۔"
         }
      ]
   },
   {
      "hadithName":"Al-istisqa",
      "data":[
         {
            "arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ ، قَالَ : حَدَّثَنَا سُفْيَانُ ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ ، عَنْ عَبَّادِ بْنِ تَمِيمٍ ، عَنْ عَمِّهِ ، قَالَ : \" خَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَسْقِي وَحَوَّلَ رِدَاءَهُ \" .",
            "englishTranslation":"Narrated `Abbas bin Tamim's uncle: The Prophet (p.b.u.h) went out to offer the Istisqa' prayer and turned (and put on) his cloak inside out.",
            "urduTranslation":"´ہم سے ابونعیم فضل بن دکین نے بیان کیا، انہوں نے کہا کہ ہم سے سفیان ثوری نے عبداللہ بن ابی بکر سے بیان کیا، ان سے عباد بن تمیم نے اور ان سے ان کے چچا عبداللہ بن زید نے کہ` نبی کریم صلی اللہ علیہ وسلم پانی کی دعا کرنے کے لیے تشریف لے گئے اور اپنی چادر الٹائی۔"
         },
         {
            "arabic":"حَدَّثَنَا قُتَيْبَةُ ، حَدَّثَنَا مُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ ، عَنْ أَبِي الزِّنَادِ ، عَنِ الْأَعْرَجِ ، عَنْ أَبِي هُرَيْرَةَ ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا رَفَعَ رَأْسَهُ مِنَ الرَّكْعَةِ الْآخِرَةِ يَقُولُ : \" اللَّهُمَّ أَنْجِ عَيَّاشَ بْنَ أَبِي رَبِيعَةَ ، اللَّهُمَّ أَنْجِ سَلَمَةَ بْنَ هِشَامٍ ، اللَّهُمَّ أَنْجِ الْوَلِيدَ بْنَ الْوَلِيدِ ، اللَّهُمَّ أَنْجِ الْمُسْتَضْعَفِينَ مِنَ الْمُؤْمِنِينَ ، اللَّهُمَّ اشْدُدْ وَطْأَتَكَ عَلَى مُضَرَ ، اللَّهُمَّ اجْعَلْهَا سِنِينَ كَسِنِي يُوسُفَ ، وَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، قَالَ : غِفَارُ غَفَرَ اللَّهُ لَهَا وَأَسْلَمُ سَالَمَهَا اللَّهُ \" ، قَالَ ابْنُ أَبِي الزِّنَادِ : عَنْ أَبِيهِ هَذَا كُلُّهُ فِي الصُّبْحِ .",
            "englishTranslation":"Narrated Abu Huraira;: Whenever the Prophet (p.b.u.h) lifted his head from the bowing in the last rak`a he used to say: \"O Allah! Save `Aiyash bin Abi Rabi`a. O Allah! Save Salama bin Hisham. O Allah! Save Walid bin Walid. O Allah! Save the weak faithful believers. O Allah! Be hard on the tribes of Mudar and send (famine) years on them like the famine years of (Prophet) Joseph .\" The Prophet further said, \"Allah forgive the tribes of Ghifar and save the tribes of Aslam.\" Abu Az-Zinad (a sub-narrator) said, \"The Qunut used to be recited by the Prophet in the Fajr prayer.\"",
            "urduTranslation":"´ہم سے قتیبہ بن سعید نے بیان کیا انہوں نے کہا کہ ہم سے مغیرہ بن عبدالرحمٰن نے بیان کیا، ان سے ابوالزناد نے بیان کیا، ان سے اعرج نے بیان کیا، ان سے ابوہریرہ رضی اللہ عنہ نے کہ` نبی کریم صلی اللہ علیہ وسلم جب سر مبارک آخری رکعت (کے رکوع) سے اٹھاتے تو یوں فرماتے «اللهم أنج عياش بن أبي ربيعة،‏‏‏‏ ‏‏‏‏ اللهم أنج سلمة بن هشام،‏‏‏‏ ‏‏‏‏ اللهم أنج الوليد بن الوليد،‏‏‏‏ ‏‏‏‏ اللهم أنج المستضعفين من المؤمنين،‏‏‏‏ ‏‏‏‏ اللهم اشدد وطأتك على مضر،‏‏‏‏ ‏‏‏‏ اللهم اجعلها سنين كسني يوسف» کہ یا اللہ! عیاش بن ابی ربیعہ کو نجات دے۔ یا اللہ! سلمہ بن ہشام کو نجات دے۔ یا اللہ! ولید بن ولید کو نجات دے۔ یا اللہ! بےبس ناتواں مسلمانوں کو نجات دے۔ یا اللہ! مضر کے کافروں کو سخت پکڑ۔ یا اللہ! ان کے سال یوسف علیہ السلام کے سے سال کر دے۔ اور نبی کریم صلی اللہ علیہ وسلم نے فرمایا غفار کی قوم کو اللہ نے بخش دیا اور اسلم کی قوم کو اللہ نے سلامت رکھا۔ ابن ابی الزناد نے اپنے باپ سے صبح کی نماز میں یہی دعا نقل کی۔"
         },
         {
            "arabic":"حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ ، قَالَ : حَدَّثَنَا جَرِيرٌ ، عَنْ مَنْصُورٍ ، عَنْ أَبِي الضُّحَى ، عَنْ مَسْرُوقٍ ، قَالَ : كُنَّا عِنْدَ عَبْدِ اللَّهِ ، فَقَالَ : إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا رَأَى مِنَ النَّاسِ إِدْبَارًا ، قَالَ : \" اللَّهُمَّ سَبْعٌ كَسَبْعِ يُوسُفَ ، فَأَخَذَتْهُمْ سَنَةٌ حَصَّتْ كُلَّ شَيْءٍ حَتَّى أَكَلُوا الْجُلُودَ وَالْمَيْتَةَ وَالْجِيَفَ وَيَنْظُرَ أَحَدُهُمْ إِلَى السَّمَاءِ فَيَرَى الدُّخَانَ مِنَ الْجُوعِ \" ، فَأَتَاهُ أَبُو سُفْيَانَ ، فَقَالَ : يَا مُحَمَّدُ إِنَّكَ تَأْمُرُ بِطَاعَةِ اللَّهِ وَبِصِلَةِ الرَّحِمِ ، وَإِنَّ قَوْمَكَ قَدْ هَلَكُوا فَادْعُ اللَّهَ لَهُمْ ، قَالَ اللَّهُ تَعَالَى : فَارْتَقِبْ يَوْمَ تَأْتِي السَّمَاءُ بِدُخَانٍ مُبِينٍ إِلَى قَوْلِهِ إِنَّكُمْ عَائِدُونَ يَوْمَ نَبْطِشُ الْبَطْشَةَ الْكُبْرَى سورة الدخان آية 10 - 16 ، فَالْبَطْشَةُ : يَوْمَ بَدْرٍ وَقَدْ مَضَتِ الدُّخَانُ وَالْبَطْشَةُ وَاللِّزَامُ وَآيَةُ الرُّومِ .",
            "englishTranslation":"Narrated Masruq: We were with `Abdullah and he said, \"When the Prophet saw the refusal of the people to accept Islam he said, \"O Allah! Send (famine) years on them for (seven years) like the seven years (of famine during the time) of (Prophet) Joseph.\" So famine overtook them for one year and destroyed every kind of life to such an extent that the people started eating hides, carcasses and rotten dead animals. Whenever one of them looked towards the sky, he would (imagine himself to) see smoke because of hunger. So Abu Sufyan went to the Prophet and said, \"O Muhammad! You order people to obey Allah and to keep good relations with kith and kin. No doubt the people of your tribe are dying, so please pray to Allah for them.\" So Allah revealed: \"Then watch you For the day that The sky will bring forth a kind Of smoke Plainly visible ... Verily! You will return (to disbelief) On the day when We shall seize You with a mighty grasp. (44.10-16) Ibn Mas`ud added, \"Al-Batsha (i.e. grasp) happened in the battle of Badr and no doubt smoke, Al-Batsha, Al-Lizam, and the verse of Surat Ar-Rum have all passed .",
            "urduTranslation":"´ہم سے امام حمیدی نے بیان کیا، کہا کہ ہم سے سفیان ثوری نے بیان کیا، ان سے سلیمان اعمش نے، ان سے ابوالضحی نے، ان سے مسروق نے، ان سے عبداللہ بن مسعود نے (دوسری سند) ہم سے عثمان بن ابی شیبہ نے بیان کیا، کہا کہ ہم سے جریر بن عبدالحمید نے منصور بن مسعود بن معتمر سے بیان کیا، اور ان سے ابوالضحی نے، ان سے مسروق نے، انہوں نے بیان کیا کہ` ہم عبداللہ بن مسعود رضی اللہ عنہ کی خدمت میں بیٹھے ہوئے تھے۔ آپ نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم نے جب کفار قریش کی سرکشی دیکھی تو آپ صلی اللہ علیہ وسلم نے بددعا کی «اللهم سبع كسبع يوسف» کہ اے اللہ! سات برس کا قحط ان پر بھیج جیسے یوسف علیہ السلام کے وقت میں بھیجا تھا چنانچہ ایسا قحط پڑا کہ ہر چیز تباہ ہو گئی اور لوگوں نے چمڑے اور مردار تک کھا لیے۔ بھوک کی شدت کا یہ عالم تھا کہ آسمان کی طرف نظر اٹھائی جاتی تو دھویں کی طرح معلوم ہوتا تھا آخر مجبور ہو کر ابوسفیان حاضر خدمت ہوئے اور عرض کیا کہ اے محمد ( صلی اللہ علیہ وسلم )! آپ لوگوں کو اللہ کی اطاعت اور صلہ رحمی کا حکم دیتے ہیں۔ اب تو آپ ہی کی قوم برباد ہو رہی ہے، اس لیے آپ اللہ سے ان کے حق میں دعا کیجئے۔ اللہ تعالیٰ نے فرمایا کہ اس دن کا انتظار کر جب آسمان صاف دھواں نظر آئے گا آیت «انکم عائدون» تک (نیز) جب ہم سختی سے ان کی گرفت کریں گے (کفار کی) سخت گرفت بدر کی لڑائی میں ہوئی۔ دھویں کا بھی معاملہ گزر چکا (جب سخت قحط پڑا تھا) جس میں پکڑ اور قید کا ذکر ہے وہ سب ہو چکے اسی طرح سورۃ الروم کی آیت میں جو ذکر ہے وہ بھی ہو چکا۔"
         },
         {
            "arabic":"حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ ، قَالَ : حَدَّثَنَا أَبُو قُتَيْبَةَ ، قَالَ : حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ دِينَارٍ ، عَنْ أَبِيهِ ، قَالَ : سَمِعْتُ ابْنَ عُمَرَ يَتَمَثَّلُ بِشِعْرِ أَبِي طَالِبٍ \" وَأَبْيَضَ يُسْتَسْقَى الْغَمَامُ بِوَجْهِهِ ثِمَالُ الْيَتَامَى عِصْمَةٌ لِلْأَرَامِلِ \" .",
            "englishTranslation":"Narrated `Abdullah bin Dinar: My father said, \"I heard Ibn `Umar reciting the poetic verses of Abu Talib: And a white (person) (i.e. the Prophet) who is requested to pray for rain and who takes care of the orphans and is the guardian of widows.\"",
            "urduTranslation":"´ہم سے عمرو بن علی نے بیان کیا، انہوں نے کہا کہ ہم سے ابو قتیبہ نے بیان کیا، کہا کہ ہم سے عبدالرحمٰن بن عبداللہ بن دینار نے، ان سے ان کے والد نے، کہا کہ` میں نے ابن عمر رضی اللہ عنہما کو ابوطالب کا یہ شعر پڑھتے سنا تھا (ترجمہ) گورا ان کا رنگ ان کے منہ کے واسطہ سے بارش کی (اللہ سے) دعا کی جاتی ہے۔ یتیموں کی پناہ اور بیواؤں کے سہارے۔“"
         },
         {
            "arabic":"وَقَالَ عُمَرُ بْنُ حَمْزَةَ حَدَّثَنَا سَالِمٌ ، عَنْ أَبِيهِ ، رُبَّمَا ذَكَرْتُ قَوْلَ الشَّاعِرِ \" وَأَنَا أَنْظُرُ إِلَى وَجْهِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَسْقِي ، فَمَا يَنْزِلُ حَتَّى يَجِيشَ كُلُّ مِيزَابٍ وَأَبْيَضَ يُسْتَسْقَى الْغَمَامُ بِوَجْهِهِ ثِمَالُ الْيَتَامَى عِصْمَةٌ لِلْأَرَامِلِ \" ، وَهُوَ قَوْلُ أَبِي طَالِبٍ .",
            "englishTranslation":"Salim's father (Ibn `Umar) said, \"The following poetic verse occurred to my mind while I was looking at the face of the Prophet (p.b.u.h) while he was praying for rain. He did not get down till the rain water flowed profusely from every roof-gutter: And a white (person) who is requested to pray for rain and who takes care of the orphans and is the guardian of widows . . . And these were the words of Abu Talib.\"",
            "urduTranslation":"´اور عمر بن حمزہ نے بیان کیا کہ ہم سے سالم نے اپنے والد سے بیان کیا وہ کہا کرتے تھے کہ` اکثر مجھے شاعر (ابوطالب) کا شعر یاد آ جاتا ہے۔ میں نبی کریم صلی اللہ علیہ وسلم کے منہ کو دیکھ رہا تھا کہ آپ دعا استسقاء (منبر پر) کر رہے تھے اور ابھی (دعا سے فارغ ہو کر) اترے بھی نہیں تھے کہ تمام نالے لبریز ہو گئے۔ «وأبيض يستسقى الغمام بوجهه ثمال اليتامى عصمة للأرامل» (ترجمہ) گورا رنگ ان کا، وہ حامی یتیموں، بیواؤں کے لوگ ان کے منہ کے صدقے سے پانی مانگتے ہیں۔"
         }
      ]
   },
   {
      "hadithName":"The Eclipses",
      "data":[
         {
            "arabic":"حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ ، قَالَ : حَدَّثَنَا خَالِدٌ ، عَنْ يُونُسَ ، عَنْ الْحَسَنِ ، عَنْ أَبِي بَكْرَةَ ، قَالَ : \" كُنَّا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَانْكَسَفَتِ الشَّمْسُ ، فَقَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَجُرُّ رِدَاءَهُ حَتَّى دَخَلَ الْمَسْجِدَ ، فَدَخَلْنَا فَصَلَّى بِنَا رَكْعَتَيْنِ حَتَّى انْجَلَتِ الشَّمْسُ ، فَقَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : إِنَّ الشَّمْسَ وَالْقَمَرَ لَا يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ ، فَإِذَا رَأَيْتُمُوهُمَا فَصَلُّوا وَادْعُوا حَتَّى يُكْشَفَ مَا بِكُمْ \" .",
            "englishTranslation":"Narrated Abu Bakra: We were with Allah's Apostle when the sun eclipsed. Allah's Apostle stood up dragging his cloak till he entered the Mosque. He led us in a two-rak`at prayer till the sun (eclipse) had cleared. Then the Prophet (p.b.u.h) said, \"The sun and the moon do not eclipse because of someone's death. So whenever you see these eclipses pray and invoke (Allah) till the eclipse is over.\"",
            "urduTranslation":"´ہم سے عمرو بن عون نے بیان کیا، انہوں نے کہا کہ ہم سے خالد بن عبداللہ نے یونس سے بیان کیا، ان سے امام حسن بصری نے بیان کیا، ان سے ابوبکرہ نفیع بن حارث رضی اللہ عنہ نے کہ` ہم نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر تھے کہ سورج کو گرہن لگنا شروع ہوا۔ نبی کریم صلی اللہ علیہ وسلم (اٹھ کر جلدی میں) چادر گھسیٹتے ہوئے مسجد میں گئے۔ ساتھ ہی ہم بھی گئے آپ صلی اللہ علیہ وسلم نے ہمیں دو رکعت نماز پڑھائی تاآنکہ سورج صاف ہو گیا۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ سورج اور چاند میں گرہن کسی کی موت و ہلاکت سے نہیں لگتا لیکن جب تم گرہن دیکھو تو اس وقت نماز اور دعا کرتے رہو جب تک گرہن کھل نہ جائے۔"
         },
         {
            "arabic":"حَدَّثَنَا شِهَابُ بْنُ عَبَّادٍ ، قَالَ : حَدَّثَنَا إِبْرَاهِيمُ بْنُ حُمَيْدٍ ، عَنْ إِسْمَاعِيلَ ، عَنْ قَيْسٍ ، قَالَ : سَمِعْتُ أَبَا مَسْعُودٍ ، يَقُولُ : قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" إِنَّ الشَّمْسَ وَالْقَمَرَ لَا يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ مِنَ النَّاسِ وَلَكِنَّهُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ ، فَإِذَا رَأَيْتُمُوهُمَا فَقُومُوا فَصَلُّوا \" .",
            "englishTranslation":"Narrated Abu Mas`ud: The Prophet said, \"The sun and the moon do not eclipse because of the death of someone from the people but they are two signs amongst the signs of Allah. When you see them stand up and pray.\"",
            "urduTranslation":"´ہم سے شہاب بن عباد نے بیان کیا، انہوں نے کہا کہ ہمیں ابراہیم بن حمید نے خبر دی، انہیں اسماعیل بن ابی خالد نے، انہیں قیس بن ابی حازم نے اور انہوں نے کہا کہ میں نے ابومسعود انصاری رضی اللہ عنہ سے سنا کہ` نبی کریم صلی اللہ علیہ وسلم نے فرمایا سورج اور چاند میں گرہن کسی شخص کی موت سے نہیں لگتا۔ یہ دونوں تو اللہ تعالیٰ کی قدرت کی نشانیاں ہیں۔ اس لیے اسے دیکھتے ہی کھڑے ہو جاؤ اور نماز پڑھو۔"
         },
         {
            "arabic":"حَدَّثَنَا أَصْبَغُ ، قَالَ : أَخْبَرَنِي ابْنُ وَهْبٍ ، قَالَ : أَخْبَرَنِي عَمْرٌو ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ حَدَّثَهُ ، عَنِ أَبِيهِ ، عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا ، أَنَّهُ كَانَ يُخْبِرُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \" إِنَّ الشَّمْسَ وَالْقَمَرَ لَا يَخْسِفَانِ لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ وَلَكِنَّهُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ ، فَإِذَا رَأَيْتُمُوهَا فَصَلُّوا \" .",
            "englishTranslation":"Narrated Ibn `Umar: The Prophet said, \"The sun and the moon do not eclipse because of the death or life (i.e. birth) of someone but they are two signs amongst the signs of Allah. When you see them offer the prayer.\"",
            "urduTranslation":"´ہم سے اصبغ بن فرح نے بیان کیا، انہوں نے کہا کہ مجھے عبداللہ بن وہب نے خبر دی، انہوں نے کہا کہ مجھے عمرو بن حارث نے عبدالرحمٰن بن قاسم سے خبر دی، انہیں ان کے باپ قاسم بن محمد نے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے نبی کریم صلی اللہ علیہ وسلم سے خبر دی کہ` آپ صلی اللہ علیہ وسلم نے فرمایا سورج اور چاند میں گرہن کسی کی موت و زندگی سے نہیں لگتا بلکہ یہ اللہ تعالیٰ کی نشانیوں میں سے دو نشانیاں ہیں، اس لیے جب تم یہ دیکھو تو نماز پڑھو۔"
         },
         {
            "arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ ، قَالَ : حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ ، قَالَ : حَدَّثَنَا شَيْبَانُ أَبُو مُعَاوِيَةَ ، عَنْ زِيَادِ بْنِ عِلَاقَةَ ، عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ ، قَالَ : كَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ مَاتَ إِبْرَاهِيمُ ، فَقَالَ النَّاسُ : كَسَفَتِ الشَّمْسُ لِمَوْتِ إِبْرَاهِيمَ ، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" إِنَّ الشَّمْسَ وَالْقَمَرَ لَا يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ ، فَإِذَا رَأَيْتُمْ فَصَلُّوا وَادْعُوا اللَّهَ \" .",
            "englishTranslation":"Narrated Al-Mughira bin Shu`ba: \"The sun eclipsed in the lifetime of Allah's Apostle on the day when (his son) Ibrahim died. So the people said that the sun had eclipsed because of the death of Ibrahim. Allah's Apostle said, \"The sun and the moon do not eclipse because of the death or life (i.e. birth) of someone. When you see the eclipse pray and invoke Allah.\"",
            "urduTranslation":"´ہم سے عبداللہ بن محمد مسندی نے بیان کیا، انہوں نے کہا کہ ہم سے ہاشم بن قاسم نے بیان کیا، انہوں نے کہا کہ ہم سے شیبان ابومعاویہ نے بیان کیا، ان سے زیاد بن علاقہ نے بیان کیا، ان سے مغیرہ بن شعبہ رضی اللہ عنہ نے کہ` رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں سورج گرہن اس دن لگا جس دن (آپ صلی اللہ علیہ وسلم کے صاحبزادے) ابراہیم رضی اللہ عنہ کا انتقال ہوا بعض لوگ کہنے لگے کہ گرہن ابراہیم رضی اللہ عنہ کی وفات کی وجہ سے لگا ہے۔ اس لیے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ گرہن کسی کی موت و حیات سے نہیں لگتا۔ البتہ تم جب اسے دیکھو تو نماز پڑھا کرو اور دعا کیا کرو۔"
         },
         {
            "arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ ، عَنْ مَالِكٍ ، عَنْ هِشَامِ بْنِ عُرْوَةَ ، عَنْ أَبِيهِ ، عَنْ عَائِشَةَ ، أَنَّهَا قَالَتْ : \" خَسَفَتِ الشَّمْسُ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالنَّاسِ ، فَقَامَ فَأَطَالَ الْقِيَامَ ، ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ ، ثُمَّ قَامَ فَأَطَالَ الْقِيَامَ وَهُوَ دُونَ الْقِيَامِ الْأَوَّلِ ، ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ وَهُوَ دُونَ الرُّكُوعِ الْأَوَّلِ ، ثُمَّ سَجَدَ فَأَطَالَ السُّجُودَ ، ثُمَّ فَعَلَ فِي الرَّكْعَةِ الثَّانِيَةِ مِثْلَ مَا فَعَلَ فِي الْأُولَى ، ثُمَّ انْصَرَفَ وَقَدِ انْجَلَتِ الشَّمْسُ ، فَخَطَبَ النَّاسَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ، ثُمَّ قَالَ : إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ لَا يَخْسِفَانِ لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ ، فَإِذَا رَأَيْتُمْ ذَلِكَ فَادْعُوا اللَّهَ وَكَبِّرُوا وَصَلُّوا وَتَصَدَّقُوا ، ثُمَّ قَالَ : يَا أُمَّةَ مُحَمَّدٍ وَاللَّهِ مَا مِنْ أَحَدٍ أَغْيَرُ مِنَ اللَّهِ أَنْ يَزْنِيَ عَبْدُهُ أَوْ تَزْنِيَ أَمَتُهُ ، يَا أُمَّةَ مُحَمَّدٍ وَاللَّهِ لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَضَحِكْتُمْ قَلِيلًا وَلبَكَيْتُمْ كَثِيرًا \" .",
            "englishTranslation":"Narrated `Aisha: In the lifetime of Allah's Apostle (p.b.u.h) the sun eclipsed, so he led the people in prayer, and stood up and performed a long Qiyam, then bowed for a long while. He stood up again and performed a long Qiyam but this time the period of standing was shorter than the first. He bowed again for a long time but shorter than the first one, then he prostrated and prolonged the prostration. He did the same in the second rak`a as he did in the first and then finished the prayer; by then the sun (eclipse) had cleared. He delivered the Khutba (sermon) and after praising and glorifying Allah he said, \"The sun and the moon are two signs against the signs of Allah; they do not eclipse on the death or life of anyone. So when you see the eclipse, remember Allah and say Takbir, pray and give Sadaqa.\" The Prophet then said, \"O followers of Muhammad! By Allah! There is none who has more ghaira (selfrespect) than Allah as He has forbidden that His slaves, male or female commit adultery (illegal sexual intercourse). O followers of Muhammad! By Allah! If you knew that which I know you would laugh little and weep much.",
            "urduTranslation":"´ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا، ان سے امام مالک نے بیان کیا، ان سے ہشام بن عروہ نے بیان کیا، ان سے ان کے باپ عروہ بن زبیر رضی اللہ عنہ نے بیان کیا، ان سے ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا نے کہ` رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں سورج گرہن ہوا تو آپ نے لوگوں کو نماز پڑھائی۔ پہلے آپ صلی اللہ علیہ وسلم کھڑے ہوئے تو بڑی دیر تک کھڑے رہے، قیام کے بعد رکوع کیا اور رکوع میں بہت دیر تک رہے۔ پھر رکوع سے اٹھنے کے بعد دیر تک دوبارہ کھڑے رہے لیکن آپ صلی اللہ علیہ وسلم کے پہلے قیام سے کچھ کم، پھر رکوع کیا تو بڑی دیر تک رکوع میں رہے لیکن پہلے سے مختصر، پھر سجدہ میں گئے اور دیر تک سجدہ کی حالت میں رہے۔ دوسری رکعت میں بھی آپ صلی اللہ علیہ وسلم نے اسی طرح کیا، جب آپ صلی اللہ علیہ وسلم فارغ ہوئے تو گرہن کھل چکا تھا۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے خطبہ دیا اللہ تعالیٰ کی حمد و ثنا کے بعد فرمایا کہ سورج اور چاند دونوں اللہ کی نشانیاں ہیں اور کسی کی موت و حیات سے ان میں گرہن نہیں لگتا۔ جب تم گرہن لگا ہوا دیکھو تو اللہ سے دعا کرو تکبیر کہو اور نماز پڑھو اور صدقہ کرو۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا اے محمد کی امت کے لوگو! دیکھو اس بات پر اللہ تعالیٰ سے زیادہ غیرت اور کسی کو نہیں آتی کہ اس کا کوئی بندہ یا بندی زنا کرے، اے امت محمد! واللہ جو کچھ میں جانتا ہوں اگر تمہیں بھی معلوم ہو جائے تو تم ہنستے کم اور روتے زیادہ۔"
         }
      ]
   },
   {
      "hadithName":"Prostration During The Recitation Of The",
      "data":[
         {
            "arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ ، قَالَ : حَدَّثَنَا غُنْدَرٌ ، قَالَ : حَدَّثَنَا شُعْبَةُ ، عَنْ أَبِي إِسْحَاقَ ، قَالَ : سَمِعْتُ الْأَسْوَدَ ، عَنْ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُ ، قَالَ : \" قَرَأَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النَّجْمَ بِمَكَّةَ فَسَجَدَ فِيهَا وَسَجَدَ مَنْ مَعَهُ غَيْرَ شَيْخٍ أَخَذَ كَفًّا مِنْ حَصًى أَوْ تُرَابٍ ، فَرَفَعَهُ إِلَى جَبْهَتِهِ ، وَقَالَ : يَكْفِينِي هَذَا ، فَرَأَيْتُهُ بَعْدَ ذَلِكَ قُتِلَ كَافِرًا \" .",
            "englishTranslation":"Narrated `Abdullah bin Mas`ud: The Prophet recited Suratan-Najm (103) at Mecca and prostrated while reciting it and those who were with him did the same except an old man who took a handful of small stones or earth and lifted it to his forehead and said, \"This is sufficient for me.\" Later on, I saw him killed as a non-believer.",
            "urduTranslation":"´ہم سے محمد بن بشار نے بیان کیا، کہا کہ ہم سے غندر محمد بن جعفر نے بیان کیا کہا کہ ہم سے شعبہ نے بیان کیا اور ان سے ابواسحاق نے انہوں نے کہا کہ میں نے اسود سے سنا انہوں نے عبداللہ بن مسعود رضی اللہ عنہ سے کہ` مکہ میں نبی کریم صلی اللہ علیہ وسلم نے سورۃ النجم کی تلاوت کی اور سجدہ تلاوت کیا آپ صلی اللہ علیہ وسلم کے پاس جتنے آدمی تھے (مسلمان اور کافر) ان سب نے بھی آپ صلی اللہ علیہ وسلم کے ساتھ سجدہ کیا البتہ ایک بوڑھا شخص (امیہ بن خلف) اپنے ہاتھ میں کنکری یا مٹی اٹھا کر اپنی پیشانی تک لے گیا اور کہا میرے لیے یہی کافی ہے میں نے دیکھا کہ بعد میں وہ بوڑھا حالت کفر میں ہی مارا گیا۔"
         },
         {
            "arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ ، حَدَّثَنَا سُفْيَانُ ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ ، عَنْ عَبْدِ الرَّحْمَنِ ، عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ ، قَالَ : \" كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الْجُمُعَةِ فِي صَلَاةِ الْفَجْرِ الم { 1 } تَنْزِيلُ سورة السجدة آية 0-1 السَّجْدَةُ وَ هَلْ أَتَى عَلَى الإِنْسَانِ سورة الإنسان آية 1 \" .",
            "englishTranslation":"Narrated Abu Huraira: On Fridays the Prophet used to recite Alf Lam Mim Tanzil-As-Sajda (in the first rak`a) and Hal ata'alal-lnsani i.e. Suratad-Dahr (LXXVI) (in the second rak`a), in the Fajr prayer.",
            "urduTranslation":"´ہم سے محمد بن یوسف فریابی نے بیان کیا، انہوں نے کہا کہ ہم سے سفیان ثوری نے بیان کیا، انہوں نے سعد بن ابراہیم بن عبدالرحمٰن بن عوف سے بیان کیا، ان سے عبدالرحمٰن بن ہرمز اعرج نے، ان سے ابوہریرہ رضی اللہ عنہ نے کہ` نبی کریم صلی اللہ علیہ وسلم جمعہ کے دن فجر کی نماز میں «الم تنزيل‏ السجدة» اور «هل أتى على الإنسان‏» (سورۃ دھر) پڑھا کرتے تھے۔"
         },
         {
            "arabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ ، وَأَبُو النُّعْمَانِ ، قَالَا : حَدَّثَنَا حَمَّادُ ، عَنْ أَيُّوبَ ، عَنْ عِكْرِمَةَ ، عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا ، قَالَ : \" ص لَيْسَ مِنْ عَزَائِمِ السُّجُودِ ، وَقَدْ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْجُدُ فِيهَا \" .",
            "englishTranslation":"Narrated Ibn `Abbas: The prostration of Sa`d is not a compulsory one but I saw the Prophet prostrating while reciting it.",
            "urduTranslation":"´ہم سے سلیمان بن حرب اور ابوالنعمان بن فضل نے بیان کیا، ان دونوں نے کہا کہ ہم سے حماد بن زید نے بیان کیا، ان سے ایوب نے بیان کیا، ان سے عکرمہ نے بیان کیا اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے فرمایا کہ` سورۃ ص کا سجدہ کچھ تاکیدی سجدوں میں سے نہیں ہے اور میں نے نبی کریم صلی اللہ علیہ وسلم کو سجدہ کرتے ہوئے دیکھا۔"
         },
         {
            "arabic":"حَدَّثَنَا حَفْصُ بْنُ عُمَرَ ، قَالَ : حَدَّثَنَا شُعْبَةُ ، عَنْ أَبِي إِسْحَاقَ ، عَنْ الْأَسْوَدِ ، عَنْ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُ ، \" أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ سُورَةَ النَّجْمِ فَسَجَدَ بِهَا ، فَمَا بَقِيَ أَحَدٌ مِنَ الْقَوْمِ إِلَّا سَجَدَ ، فَأَخَذَ رَجُلٌ مِنَ الْقَوْمِ كَفًّا مِنْ حَصًى أَوْ تُرَابٍ فَرَفَعَهُ إِلَى وَجْهِهِ وَقَالَ : يَكْفِينِي هَذَا ، فَلَقَدْ رَأَيْتُهُ بَعْدُ قُتِلَ كَافِرًا \" .",
            "englishTranslation":"Narrated `Abdullah bin Mas`ud: The Prophet recited Surat-an-Najm (53) and prostrated while reciting it and all the people prostrated and a man amongst the people took a handful of stones or earth and raised it to his face and said, \"This is sufficient for me. Later on I saw him killed as a non-believer.\"",
            "urduTranslation":"´ہم سے حفص بن عمر نے بیان کیا، کہا کہ ہم سے شعبہ نے، ابواسحاق سے بیان کیا، ان سے اسود نے، ان سے عبداللہ بن مسعود رضی اللہ عنہ نے کہ` نبی کریم صلی اللہ علیہ وسلم نے سورۃ النجم کی تلاوت کی اور اس میں سجدہ کیا اس وقت قوم کا کوئی فرد (مسلمان اور کافر) بھی ایسا نہ تھا جس نے سجدہ نہ کیا ہو۔ البتہ ایک شخص (امیہ بن خلف) نے ہاتھ میں کنکری یا مٹی لے کر اپنے چہرہ تک اٹھائی اور کہا کہ میرے لیے یہی کافی ہے۔ عبداللہ بن مسعود رضی اللہ عنہ نے کہا کہ بعد میں میں نے دیکھا کہ وہ کفر کی حالت ہی میں قتل ہوا۔"
         },
         {
            "arabic":"حَدَّثَنَا مُسَدَّدٌ ، قَالَ : حَدَّثَنَا عَبْدُ الْوَارِثِ ، قَالَ : حَدَّثَنَا أَيُّوبُ ، عَنْ عِكْرِمَةَ ، عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا ، \" أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَجَدَ بِالنَّجْمِ وَسَجَدَ مَعَهُ الْمُسْلِمُونَ وَالْمُشْرِكُونَ وَالْجِنُّ وَالْإِنْسُ \" ، وَرَوَاهُ بْنُ طَهْمَانَ ، عَنْ أَيُّوبَ .",
            "englishTranslation":"Narrated Ibn `Abbas: The Prophet I prostrated while reciting An-Najm and with him prostrated the Muslims, the pagans, the jinns, and all human beings.",
            "urduTranslation":"´ہم سے مسدد بن مسرہد نے بیان کیا، کہا کہ ہم سے عبدالوارث نے بیان کیا، کہا ہم سے ایوب سختیانی نے بیان کیا، ان سے عکرمہ نے، ان سے ابن عباس رضی اللہ عنہما نے کہ` نبی کریم صلی اللہ علیہ وسلم نے سورۃ النجم میں سجدہ کیا تو مسلمانوں، مشرکوں اور جن و انس سب نے آپ صلی اللہ علیہ وسلم کے ساتھ سجدہ کیا۔ اس حدیث کی روایت ابراہیم بن طہمان نے بھی ایوب سختیانی سے کی ہے۔"
         }
      ]
   },
   {
      "hadithName":"Abridged Or Shortened Prayers At-taqsir",
      "data":[
         {
            "arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ ، قَالَ : حَدَّثَنَا أَبُو عَوَانَةَ ، عَنْ عَاصِمٍ ، وَحُصَيْنٍ ، عَنْ عِكْرِمَةَ ، عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا ، قَالَ : \"أَقَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تِسْعَةَ عَشَرَ يَقْصُرُ ، فَنَحْنُ إِذَا سَافَرْنَا تِسْعَةَ عَشَرَ قَصَرْنَا وَإِنْ زِدْنَا أَتْمَمْنَا \" .",
            "englishTranslation":"Narrated Ibn `Abbas: The Prophet once stayed for nineteen days and prayed shortened prayers. So when we travel led (and stayed) for nineteen days, we used to shorten the prayer but if we traveled (and stayed) for a longer period we used to offer the full prayer.",
            "urduTranslation":"´ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا کہ ہم سے ابوعوانہ وضاح یشکری نے بیان کیا، ان سے عاصم احول اور حصین سلمی نے، ان سے عکرمہ نے، اور ان سے ابن عباس رضی اللہ عنہما نے کہ` نبی کریم صلی اللہ علیہ وسلم (مکہ میں فتح مکہ کے موقع پر) انیس دن ٹھہرے اور برابر قصر کرتے رہے۔ اس لیے انیس دن کے سفر میں ہم بھی قصر کرتے رہتے ہیں اور اس سے اگر زیادہ ہو جائے تو پوری نماز پڑھتے ہیں۔"
         },
         {
            "arabic":"حَدَّثَنَا أَبُو مَعْمَرٍ ، قَالَ : حَدَّثَنَا عَبْدُ الْوَارِثِ ، قَالَ : حَدَّثَنَا يَحْيَى بْنُ أَبِي إِسْحَاقَ ، قَالَ : سَمِعْتُ أَنَسًا ، يَقُولُ : \" خَرَجْنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْمَدِينَةِ إِلَى مَكَّةَ فَكَانَ يُصَلِّي رَكْعَتَيْنِ رَكْعَتَيْنِ حَتَّى رَجَعْنَا إِلَى الْمَدِينَةِ ، قُلْتُ : أَقَمْتُمْ بِمَكَّةَ شَيْئًا ؟ قَالَ : أَقَمْنَا بِهَا عَشْرًا \" .",
            "englishTranslation":"Narrated Yahya bin 'Is-haq: I heard Anas saying, \"We traveled with the Prophet from Medina to Mecca and offered two rak`at (for every prayer) till we returned to Medina.\" I said, \"Did you stay for a while in Mecca?\" He replied, \"We stayed in Mecca for ten days.\"",
            "urduTranslation":"´ہم سے ابومعمر نے بیان کیا، انہوں نے کہا کہ ہم سے عبدالوارث نے بیان کیا، انہوں نے کہا کہ مجھ سے یحییٰ بن ابی اسحاق نے بیان کیا انہوں نے انس رضی اللہ عنہ کو یہ کہتے ہوئے سنا کہ` ہم مکہ کے ارادہ سے مدینہ سے نکلے تو برابر نبی کریم صلی اللہ علیہ وسلم دو، دو رکعت پڑھتے رہے۔ یہاں تک کہ ہم مدینہ واپس آئے۔ میں نے پوچھا کہ آپ صلی اللہ علیہ وسلم کا مکہ میں کچھ دن قیام بھی رہا تھا؟ تو اس کا جواب انس رضی اللہ عنہ نے یہ دیا کہ دس دن تک ہم وہاں ٹھہرے تھے۔"
         },
         {
            "arabic":"حَدَّثَنَا مُسَدَّدٌ ، قَالَ : حَدَّثَنَا يَحْيَى ، عَنْ عُبَيْدِ اللَّهِ ، قَالَ : أَخْبَرَنِي نَافِعٌ ، عَنْ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُمَا ، قَالَ : \" صَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى رَكْعَتَيْنِ ، وَأَبِي بَكْرٍ ، وَعُمَرَ ، وَمَعَ عُثْمَانَ صَدْرًا مِنْ إِمَارَتِهِ ثُمَّ أَتَمَّهَا \" .",
            "englishTranslation":"Narrated `Abdullah bin `Umar: I offered the prayer with the Prophet, Abu Bakr and `Umar at Mina and it was of two rak`at. `Uthman in the early days of his caliphate did the same, but later on he started praying the full prayer.",
            "urduTranslation":"´ہم سے مسدد بن مسرہد نے بیان کیا، کہا کہ ہم سے یحییٰ نے عبیداللہ عمری سے بیان کیا، کہا کہ مجھے نافع نے خبر دی اور انہیں عبداللہ بن مسعود رضی اللہ عنہ نے، کہا کہ` میں نے نبی کریم صلی اللہ علیہ وسلم ابوبکر اور عمر رضی اللہ عنہما کے ساتھ منیٰ میں دو رکعت (یعنی چار رکعت والی نمازوں میں) قصر پڑھی۔ عثمان رضی اللہ عنہ کے ساتھ بھی ان کے دور خلافت کے شروع میں دو ہی رکعت پڑھی تھیں۔ لیکن بعد میں آپ رضی اللہ عنہ نے پوری پڑھی تھیں۔"
         },
         {
            "arabic":"حَدَّثَنَا أَبُو الْوَلِيدِ ، قَالَ : حَدَّثَنَا شُعْبَةُ ، أَنْبَأَنَا أَبُو إِسْحَاقَ ، قَالَ : سَمِعْتُ حَارِثَةَ بْنَ وَهْبٍ ، قَالَ : \" صَلَّى بِنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ آمَنَ مَا كَانَ بِمِنًى رَكْعَتَيْنِ \" .",
            "englishTranslation":"Narrated Haritha bin Wahab: The Prophet I led us in the prayer at Mina during the peace period by offering two rak`at.",
            "urduTranslation":"´ہم سے ابوالولید نے بیان کیا، کہا کہ ہم سے شعبہ نے بیان کیا، کہا کہ ہمیں ابواسحاق نے خبر دی، انہوں نے حارثہ سے سنا اور انہوں نے وہب رضی اللہ عنہ سے کہ` آپ نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم نے منیٰ میں امن کی حالت میں ہمیں دو رکعت نماز پڑھائی تھی۔"
         },
         {
            "arabic":"حَدَّثَنَا قُتَيْبَةُ ، قَالَ : حَدَّثَنَا عَبْدُ الْوَاحِدِ ، عَنْ الْأَعْمَشِ ، قَالَ : حَدَّثَنَا إِبْرَاهِيمُ ، قَالَ : سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ يَزِيدَ ، يَقُولُ : \" صَلَّى بِنَا عُثْمَانُ بْنُ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ بِمِنًى أَرْبَعَ رَكَعَاتٍ ، فَقِيلَ ذَلِكَ لِعَبْدِ اللَّهِ بْنِ مَسْعُودٍ رَضِيَ اللَّهُ عَنْهُ فَاسْتَرْجَعَ ، ثُمَّ قَالَ : صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى رَكْعَتَيْنِ ، وَصَلَّيْتُ مَعَ أَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ بِمِنًى رَكْعَتَيْنِ ، وَصَلَّيْتُ مَعَ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ بِمِنًى رَكْعَتَيْنِ ، فَلَيْتَ حَظِّي مِنْ أَرْبَعِ رَكَعَاتٍ رَكْعَتَانِ مُتَقَبَّلَتَانِ \" .",
            "englishTranslation":"Narrated `Abdur Rahman bin Yazid: We offered a four rak`at prayer at Mina behind Ibn `Affan . `Abdullah bin Mas`ud was informed about it. He said sadly, \"Truly to Allah we belong and truly to Him we shall return.\" And added, \"I prayed two rak`at with Allah's Apostle at Mina and similarly with Abu Bakr and with `Umar (during their caliphates).\" He further said, \"May I be lucky enough to have two of the four rak`at accepted (by Allah).\"",
            "urduTranslation":"´ہم سے قتیبہ نے بیان کیا، انہوں نے کہا کہ ہم سے عبدالواحد بن زیاد نے بیان کیا، ان سے اعمش نے، انہوں نے کہا کہ ہم سے ابراہیم نخعی نے بیان کیا، انہوں نے کہا کہ` میں نے عبدالرحمٰن بن یزید سے سنا، وہ کہتے تھے کہ ہمیں عثمان بن عفان رضی اللہ عنہ نے منیٰ میں چار رکعت نماز پڑھائی تھی لیکن جب اس کا ذکر عبداللہ بن مسعود رضی اللہ عنہ سے کیا گیا تو انہوں نے کہا کہ «انا لله و انا اليه راجعون» ۔ پھر کہنے لگے میں نے تو نبی کریم صلی اللہ علیہ وسلم کے ساتھ منی ٰ میں دو رکعت نماز پڑھی ہے اور ابوبکر صدیق رضی اللہ عنہ کے ساتھ بھی میں نے دو رکعت ہی پڑھی ہیں اور عمر بن خطاب رضی اللہ عنہ کے ساتھ بھی دو رکعت ہی پڑھی تھی کاش میرے حصہ میں ان چار رکعتوں کے بجائے دو مقبول رکعتیں ہوتیں۔"
         }
      ]
   },
   {
      "hadithName":"Salat-ut-tahajjud Night Prayer",
      "data":[
         {
            "arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ , قَالَ : حَدَّثَنَا سُفْيَانُ , قَالَ : حَدَّثَنَا سُلَيْمَانُ بْنُ أَبِي مُسْلِمٍ ، عَنْ طَاوُسٍ ، سَمِعَ ابْنَ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا , قَالَ : \" كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ مِنَ اللَّيْلِ يَتَهَجَّدُ , قَالَ : اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ قَيِّمُ السَّمَوَاتِ وَالْأَرْضِ وَمَنْ فِيهِنَّ ، وَلَكَ الْحَمْدُ لَكَ مُلْكُ السَّمَوَاتِ وَالْأَرْضِ ، وَمَنْ فِيهِنَّ وَلَكَ الْحَمْدُ أَنْتَ نُورُ السَّمَوَاتِ وَالْأَرْضِ ، وَلَكَ الْحَمْدُ أَنْتَ الْحَقُّ ، وَوَعْدُكَ الْحَقُّ ، وَلِقَاؤُكَ حَقٌّ ، وَقَوْلُكَ حَقٌّ ، وَالْجَنَّةُ حَقٌّ ، وَالنَّارُ حَقٌّ ، وَالنَّبِيُّونَ حَقٌّ , وَمُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَقٌّ , وَالسَّاعَةُ حَقٌّ ، اللَّهُمَّ لَكَ أَسْلَمْتُ وَبِكَ آمَنْتُ وَعَلَيْكَ تَوَكَّلْتُ وَإِلَيْكَ أَنَبْتُ وَبِكَ خَاصَمْتُ وَإِلَيْكَ حَاكَمْتُ ، فَاغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ ، أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ لَا إِلَهَ إِلَّا أَنْتَ ، أَوْ لَا إِلَهَ غَيْرُكَ \" ، قَالَ سُفْيَانُ : وَزَادَ عَبْدُ الْكَرِيمِ أَبُو أُمَيَّةَ ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ , قَالَ سُفْيَانُ : قَالَ سُلَيْمَانُ بْنُ أَبِي مُسْلِمٍ ، سَمِعَهُ مِنْ طَاوُسٍ ، عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ .",
            "englishTranslation":"Narrated Ibn `Abbas: When the Prophet got up at night to offer the Tahajjud prayer, he used to say: Allahumma lakal-hamd. Anta qaiyimus-samawati wal-ard wa man fihinna. Walakal-hamd, Laka mulkus-samawati wal-ard wa man fihinna. Walakal-hamd, anta nurus-samawati wal-ard. Walakalhamd, anta-l-haq wa wa'duka-lhaq, wa liqa'uka Haq, wa qualuka Haq, wal-jannatu Han wan-naru Haq wannabiyuna Haq. Wa Muhammadun, sallal-lahu'alaihi wasallam, Haq, was-sa'atu Haq. Allahumma aslamtu Laka wabika amantu, wa 'Alaika tawakkaltu, wa ilaika anabtu wa bika khasamtu, wa ilaika hakamtu faghfir li ma qaddamtu wama akh-khartu wama as-rartu wama'a lantu, anta-l-muqaddim wa anta-l-mu akh-khir, la ilaha illa anta (or la ilaha ghairuka). (O Allah! All the praises are for you, You are the Holder of the Heavens and the Earth, And whatever is in them. All the praises are for You; You have the possession of the Heavens and the Earth And whatever is in them. All the praises are for You; You are the Light of the Heavens and the Earth And all the praises are for You; You are the King of the Heavens and the Earth; And all the praises are for You; You are the Truth and Your Promise is the truth, And to meet You is true, Your Word is the truth And Paradise is true And Hell is true And all the Prophets (Peace be upon them) are true; And Muhammad is true, And the Day of Resurrection is true. O Allah ! I surrender (my will) to You; I believe in You and depend on You. And repent to You, And with Your help I argue (with my opponents, the non-believers) And I take You as a judge (to judge between us). Please forgive me my previous And future sins; And whatever I concealed or revealed And You are the One who make (some people) forward And (some) backward. There is none to be worshipped but you . Sufyan said that `Abdul Karim Abu Umaiya added to the above, 'Wala haula Wala quwata illa billah' (There is neither might nor power except with Allah).",
            "urduTranslation":"´ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا، کہا کہ ہم سے سلیمان بن ابی مسلم نے بیان کیا، ان سے طاؤس نے اور انہوں نے ابن عباس رضی اللہ عنہما سے سنا کہ` رسول اللہ صلی اللہ علیہ وسلم جب رات میں تہجد کے لیے کھڑے ہوتے تو یہ دعا پڑھتے۔ «اللهم لك الحمد أنت قيم السموات والأرض ومن فيهن ولك الحمد،‏‏‏‏ ‏‏‏‏ لك ملك السموات والأرض ومن فيهن،‏‏‏‏ ‏‏‏‏ ولك الحمد أنت نور السموات والأرض،‏‏‏‏ ‏‏‏‏ ولك الحمد أنت الحق،‏‏‏‏ ‏‏‏‏ ووعدك الحق،‏‏‏‏ ‏‏‏‏ ولقاؤك حق،‏‏‏‏ ‏‏‏‏ وقولك حق،‏‏‏‏ ‏‏‏‏ والجنة حق،‏‏‏‏ ‏‏‏‏ والنار حق،‏‏‏‏ ‏‏‏‏ والنبيون حق،‏‏‏‏ ‏‏‏‏ ومحمد صلى الله عليه وسلم حق،‏‏‏‏ ‏‏‏‏ والساعة حق،‏‏‏‏ ‏‏‏‏ اللهم لك أسلمت،‏‏‏‏ ‏‏‏‏ وبك آمنت وعليك توكلت،‏‏‏‏ ‏‏‏‏ وإليك أنبت،‏‏‏‏ ‏‏‏‏ وبك خاصمت،‏‏‏‏ ‏‏‏‏ وإليك حاكمت،‏‏‏‏ ‏‏‏‏ فاغفر لي ما قدمت وما أخرت،‏‏‏‏ ‏‏‏‏ وما أسررت وما أعلنت،‏‏‏‏ ‏‏‏‏ أنت المقدم وأنت المؤخر،‏‏‏‏ ‏‏‏‏لا إله إلا أنت، لا إله غيرك» (ترجمہ) ”اے میرے اللہ! ہر طرح کی تعریف تیرے ہی لیے زیبا ہے، تو آسمان اور زمین اور ان میں رہنے والی تمام مخلوق کا سنبھالنے والا ہے اور حمد تمام کی تمام بس تیرے ہی لیے مناسب ہے آسمان اور زمین اور ان کی تمام مخلوقات پر حکومت صرف تیرے ہی لیے ہے اور تعریف تیرے ہی لیے ہے، تو آسمان اور زمین کا نور ہے اور تعریف تیرے ہی لیے زیبا ہے، تو سچا ہے، تیرا وعدہ سچا، تیری ملاقات سچی، تیرا فرمان سچا ہے، جنت سچ ہے، دوزخ سچ ہے، انبیاء سچے ہیں۔ محمد صلی اللہ علیہ وسلم سچے ہیں اور قیامت کا ہونا سچ ہے۔ اے میرے اللہ! میں تیرا ہی فرماں بردار ہوں اور تجھی پر ایمان رکھتا ہوں، تجھی پر بھروسہ ہے، تیری ہی طرف رجوع کرتا ہوں، تیرے ہی عطا کئے ہوئے دلائل کے ذریعہ بحث کرتا ہوں اور تجھی کو حکم بناتا ہوں۔ پس جو خطائیں مجھ سے پہلے ہوئیں اور جو بعد میں ہوں گی ان سب کی مغفرت فرما، خواہ وہ ظاہر ہوئی ہوں یا پوشیدہ۔ آگے کرنے والا اور پیچھے رکھنے والا تو ہی ہے۔ معبود صرف تو ہی ہے۔ یا (یہ کہا کہ) تیرے سوا کوئی معبود نہیں“۔ ابوسفیان نے بیان کیا کہ عبدالکریم ابوامیہ نے اس دعا میں یہ زیادتی کی ہے ( «لا حول ولا قوة إلا بالله») سفیان نے بیان کیا کہ سلیمان بن مسلم نے طاؤس سے یہ حدیث سنی تھی، انہوں نے عبداللہ بن عباس رضی اللہ عنہما سے اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے۔"
         },
         {
            "arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ , قَالَ : حَدَّثَنَا هِشَامٌ , قَالَ : أَخْبَرَنَا مَعْمَرٌ . ح وحَدَّثَنِي مَحْمُودٌ , قَالَ : حَدَّثَنَا عَبْدُ الرَّزَّاقِ , قَالَ : أَخْبَرَنَا مَعْمَرٌ ، عَنْ الزُّهْرِيِّ ، عَنْ سَالِمٍ ، عَنْ أَبِيهِ رَضِيَ اللَّهُ عَنْهُ , قَالَ : \" كَانَ الرَّجُلُ فِي حَيَاةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَأَى رُؤْيَا قَصَّهَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَتَمَنَّيْتُ أَنْ أَرَى رُؤْيَا فَأَقُصَّهَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، وَكُنْتُ غُلَامًا شَابًّا ، وَكُنْتُ أَنَامُ فِي الْمَسْجِدِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَرَأَيْتُ فِي النَّوْمِ كَأَنَّ مَلَكَيْنِ أَخَذَانِي فَذَهَبَا بِي إِلَى النَّارِ ، فَإِذَا هِيَ مَطْوِيَّةٌ كَطَيِّ الْبِئْرِ , وَإِذَا لَهَا قَرْنَانِ , وَإِذَا فِيهَا أُنَاسٌ قَدْ عَرَفْتُهُمْ ، فَجَعَلْتُ أَقُولُ أَعُوذُ بِاللَّهِ مِنَ النَّارِ ، قَالَ : فَلَقِيَنَا مَلَكٌ آخَرُ ، فَقَالَ لِي : لَمْ تُرَعْ .",
            "englishTranslation":"Narrated Salim's father: In the lifetime of the Prophet whosoever saw a dream would narrate it to Allah's Apostle. I had a wish of seeing a dream to narrate it to Allah's Apostle (p.b.u.h) I was a grown up boy and used to sleep in the Mosque in the lifetime of the Prophet. I saw in the dream that two angels caught hold of me and took me to the Fire which was built all round like a built well and had two poles in it and the people in it were known to me. I started saying, \"I seek refuge with Allah from the Fire.\" Then I met another angel who told me not to be afraid.",
            "urduTranslation":"´ہم سے عبداللہ بن محمد مسندی نے بیان کیا، انہوں نے کہا کہ ہم سے ہشام بن یوسف صنعانی نے بیان کیا، انہوں نے کہا کہ ہم سے معمر نے حدیث بیان کی (دوسری سند) اور مجھ سے محمود بن غیلان نے بیان کیا، انہوں نے کہا کہ ہم سے عبدالرزاق نے بیان کیا۔ انہوں نے کہا کہ ہمیں معمر نے خبر دی، انہیں زہری نے، انہیں سالم نے، انہیں ان کے باپ عبداللہ بن عمر رضی اللہ عنہما نے بتایا کہ` نبی کریم صلی اللہ علیہ وسلم کی زندگی میں جب کوئی خواب دیکھتا تو آپ صلی اللہ علیہ وسلم سے بیان کرتا (آپ صلی اللہ علیہ وسلم تعبیر دیتے) میرے بھی دل میں یہ خواہش پیدا ہوئی کہ میں بھی کوئی خواب دیکھتا اور آپ صلی اللہ علیہ وسلم سے بیان کرتا، میں ابھی نوجوان تھا اور آپ صلی اللہ علیہ وسلم کے زمانہ میں مسجد میں سوتا تھا۔ چنانچہ میں نے خواب میں دیکھا کہ دو فرشتے مجھے پکڑ کر دوزخ کی طرف لے گئے۔ میں نے دیکھا کہ دوزخ پر کنویں کی طرح بندش ہے (یعنی اس پر کنویں کی سی منڈیر بنی ہوئی ہے) اس کے دو جانب تھے۔ دوزخ میں بہت سے ایسے لوگوں کو دیکھا جنہیں میں پہچانتا تھا۔ میں کہنے لگا دوزخ سے اللہ کی پناہ! انہوں نے بیان کیا کہ پھر ہم کو ایک فرشتہ ملا اور اس نے مجھ سے کہا ڈرو نہیں۔"
         },
         {
            "arabic":"فَقَصَصْتُهَا عَلَى حَفْصَةَ فَقَصَّتْهَا حَفْصَةُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ : نِعْمَ ، الرَّجُلُ عَبْدُ اللَّهِ لَوْ كَانَ يُصَلِّي مِنَ اللَّيْلِ فَكَانَ بَعْدُ لَا يَنَامُ مِنَ اللَّيْلِ إِلَّا قَلِيلًا \" .",
            "englishTranslation":"I narrated the dream to Hafsa who told it to Allah's Apostle. The Prophet said, \"Abdullah is a good man. I wish he prayed Tahajjud.\" After that `Abdullah (i.e. Salim's father) used to sleep but a little at night.",
            "urduTranslation":"یہ خواب میں نے (اپنی بہن) حفصہ رضی اللہ عنہا کو سنایا اور انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو۔ تعبیر میں آپ صلی اللہ علیہ وسلم نے فرمایا کہ عبداللہ بہت خوب لڑکا ہے۔ کاش رات میں نماز پڑھا کرتا۔ (راوی نے کہا کہ آپ کے اس فرمان کے بعد) عبداللہ بن عمر رضی اللہ عنہما رات میں بہت کم سوتے تھے (زیادہ عبادت ہی کرتے رہتے)۔"
         },
         {
            "arabic":"حَدَّثَنَا أَبُو الْيَمَانِ , قَالَ : أَخْبَرَنَا شُعَيْبٌ ، عَنْ الزُّهْرِيِّ , قَالَ : أَخْبَرَنِي عُرْوَةُ ، أَنَّ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَخْبَرَتْهُ ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \" كَانَ يُصَلِّي إِحْدَى عَشْرَةَ رَكْعَةً ، كَانَتْ تِلْكَ صَلَاتَهُ يَسْجُدُ السَّجْدَةَ مِنْ ذَلِكَ قَدْرَ مَا يَقْرَأُ أَحَدُكُمْ خَمْسِينَ آيَةً قَبْلَ أَنْ يَرْفَعَ رَأْسَهُ , وَيَرْكَعُ رَكْعَتَيْنِ قَبْلَ صَلَاةِ الْفَجْرِ ، ثُمَّ يَضْطَجِعُ عَلَى شِقِّهِ الْأَيْمَنِ حَتَّى يَأْتِيَهُ الْمُنَادِي لِلصَّلَاةِ \" .",
            "englishTranslation":"Narrated `Aisha: Allah's Apostle used to offer eleven rak`at and that was his prayer. He used to prolong the prostration to such an extent that one could recite fifty verses (of the Qur'an) before he would lift his head. He used to pray two rak`at (Sunna) before the Fajr prayer and then used to lie down on his right side till the call-maker came and informed him about the prayer.",
            "urduTranslation":"´ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا کہ ہمیں شعیب نے زہری سے خبر دی، انہوں نے کہا کہ مجھے عروہ نے خبر دی اور انہیں ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا نے خبر دی کہ` رسول اللہ صلی اللہ علیہ وسلم (رات میں) گیارہ رکعتیں پڑھتے تھے۔ آپ صلی اللہ علیہ وسلم کی یہی نماز تھی۔ لیکن اس کے سجدے اتنے لمبے ہوا کرتے کہ تم میں سے کوئی نبی کریم صلی اللہ علیہ وسلم کے سر اٹھانے سے قبل پچاس آیتیں پڑھ سکتا تھا (اور طلوع فجر ہونے پر) فجر کی نماز سے پہلے آپ صلی اللہ علیہ وسلم دو رکعت سنت پڑھتے۔ اس کے بعد دائیں پہلو پر لیٹ جاتے۔ آخر مؤذن آپ صلی اللہ علیہ وسلم کو نماز کے لیے بلانے آتا۔"
         },
         {
            "arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ , قَالَ : حَدَّثَنَا سُفْيَانُ ، عَنْ الْأَسْوَدِ , قَالَ : سَمِعْتُ جُنْدَبًا , يَقُولُ : \" اشْتَكَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يَقُمْ لَيْلَةً أَوْ لَيْلَتَيْنِ \" .",
            "englishTranslation":"Narrated Jundab: The Prophet became sick and did not get up (for Tahajjud prayer) for a night or two.",
            "urduTranslation":"´ہم سے ابونعیم نے بیان کیا، کہا کہ ہم سے سفیان ثوری نے اسود بن قیس سے بیان کیا، کہا کہ میں نے جندب رضی اللہ عنہ سے سنا، آپ نے فرمایا کہ` نبی کریم صلی اللہ علیہ وسلم بیمار ہوئے تو ایک یا دو رات تک (نماز کے لیے) نہ اٹھ سکے۔"
         }
      ]
   },
   {
      "hadithName":"The Superiority Of Offering As-salat In The",
      "data":[
         {
            "arabic":"حَدَّثَنَا حَفْصُ بْنُ عُمَرَ ، حَدَّثَنَا شُعْبَةُ , قَالَ : أَخْبَرَنِي عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ ، عَنْ قَزَعَةَ , قَالَ : سَمِعْتُ أَبَا سَعِيدٍ رَضِيَ اللَّهُ عَنْهُ أَرْبَعًا , قَالَ : سَمِعْتُ مِنَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، وَكَانَ غَزَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثِنْتَيْ عَشْرَةَ غَزْوَةً .",
            "englishTranslation":"Narrated Quza'a: I heard Abu Said saying four words. He said, \"I heard the Prophet (saying the following narrative).\" He had participated in twelve holy battles with the Prophet.",
            "urduTranslation":"´ہم سے حفص بن عمر نے بیان کیا، کہا کہ ہم سے شعبہ نے بیان کیا، انہوں نے کہا کہ مجھے عبدالملک نے قزعہ سے خبر دی، انہوں نے کہا کہ میں نے ابوسعید رضی اللہ عنہ سے چار باتیں سنیں اور انہوں نے بتلایا کہ` میں نے انہیں نبی کریم صلی اللہ علیہ وسلم سے سنا تھا، آپ نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ بارہ جہاد کئے تھے۔"
         },
         {
            "arabic":"ح حَدَّثَنَا عَلِيٌّ ، حَدَّثَنَا سُفْيَانُ ، عَنِ الزُّهْرِيِّ ، عَنْ سَعِيدٍ ، عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ , عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ , قَالَ : \" لَا تُشَدُّ الرِّحَالُ إِلَّا إِلَى ثَلَاثَةِ مَسَاجِدَ ، الْمَسْجِدِ الْحَرَامِ ، وَمَسْجِدِ الرَّسُولِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، وَمَسْجِدِ الْأَقْصَى \" .",
            "englishTranslation":"Narrated Abu Huraira: The Prophet said, \"Do not set out on a journey except for three Mosques i.e. Al-Masjid-AI-Haram, the Mosque of Allah's Apostle , and the Mosque of Al-Aqsa, (Mosque of Jerusalem).\"",
            "urduTranslation":"´(دوسری سند) ہم سے علی بن مدینی نے بیان کیا، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا، ان سے زہری نے، ان سے سعید بن مسیب نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ` نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تین مسجدوں کے سوا کسی کے لیے کجاوے نہ باندھے جائیں۔ (یعنی سفر نہ کیا جائے) ایک مسجد الحرام، دوسری رسول اللہ صلی اللہ علیہ وسلم کی مسجد (مسجد نبوی) اور تیسری مسجد الاقصیٰ یعنی بیت المقدس۔"
         },
         {
            "arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ وقَالَ : أَخْبَرَنَا مَالِكٌ ، عَنْ زَيْدِ بْنِ رَبَاحٍ ، وَعُبَيْدِ اللَّهِ بْنِ أَبِي عَبْدِ اللَّهِ الأَغَرِّ , عَنْ أَبِي عَبْدِ اللَّهِ الْأَغَرِّ ، عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ : \" صَلَاةٌ فِي مَسْجِدِي هَذَا خَيْرٌ مِنْ أَلْفِ صَلَاةٍ فِيمَا سِوَاهُ ، إِلَّا الْمَسْجِدَ الْحَرَامَ \" .",
            "englishTranslation":"Narrated Abu Huraira: Allah's Apostle said, \"One prayer in my Mosque is better than one thousand prayers in any other mosque excepting Al-Masjid-AI-Haram.\"",
            "urduTranslation":"´ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، انہوں نے کہا کہ ہمیں امام مالک نے زید بن رباح اور عبیداللہ بن ابی عبداللہ اغر سے خبر دی، انہیں ابوعبدللہ اغر نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ` رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میری اس مسجد میں نماز مسجد الحرام کے سوا تمام مسجدوں میں نماز سے ایک ہزار درجہ زیادہ افضل ہے۔"
         },
         {
            "arabic":"حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ هُوَ الدَّوْرَقِيُّ ، حَدَّثَنَا ابْنُ عُلَيَّةَ ، أَخْبَرَنَا أَيُّوبُ ، عَنْ نَافِعٍ ، أَنَّ ابْنَ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا \" كَانَ لَا يُصَلِّي مِنَ الضُّحَى إِلَّا فِي يَوْمَيْنِ يَوْمَ يَقْدَمُ بِمَكَّةَ ، فَإِنَّهُ كَانَ يَقْدَمُهَا ضُحًى فَيَطُوفُ بِالْبَيْتِ ثُمَّ يُصَلِّي رَكْعَتَيْنِ خَلْفَ الْمَقَامِ ، وَيَوْمَ يَأْتِي مَسْجِدَ قُبَاءٍ فَإِنَّهُ كَانَ يَأْتِيهِ كُلَّ سَبْتٍ ، فَإِذَا دَخَلَ الْمَسْجِدَ كَرِهَ أَنْ يَخْرُجَ مِنْهُ حَتَّى يُصَلِّيَ فِيهِ ، قَالَ : وَكَانَ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَزُورُهُ رَاكِبًا وَمَاشِيًا .",
            "englishTranslation":"Narrated Nafi`: Ibn `Umar never offered the Duha prayer except on two occasions: (1) Whenever he reached Mecca; and he always used to reach Mecca in the forenoon. He would perform Tawaf round the Ka`ba and then offer two rak`at at the rear of Maqam Ibrahim. (2) Whenever he visited Quba, for he used to visit it every Saturday. When he entered the Mosque, he disliked to leave it without offering a prayer. Ibn `Umar narrated that Allah's Apostle used to visit the Mosque of Quba (sometime) walking and (sometime) riding.",
            "urduTranslation":"´ہم سے یعقوب بن ابراہیم نے بیان کیا، انہوں نے کہا کہ ہم سے اسماعیل بن علیہ نے بیان کیا، انہوں نے کہا ہمیں ایوب سختیانی نے خبر دی اور انہیں نافع نے کہ` عبداللہ بن عمر رضی اللہ عنہما چاشت کی نماز صرف دو دن پڑھتے تھے۔ جب مکہ آتے کیونکہ آپ مکہ میں چاشت ہی کے وقت آتے تھے اس وقت پہلے آپ طواف کرتے اور پھر مقام ابراہیم کے پیچھے دو رکعت پڑھتے۔ دوسرے جس دن آپ مسجد قباء میں تشریف لاتے آپ کا یہاں ہر ہفتہ کو آنے کا معمول تھا۔ جب آپ مسجد کے اندر آتے تو نماز پڑھے بغیر باہر نکلنا برا جانتے۔ آپ بیان کرتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم یہاں سوار اور پیدل دونوں طرح آیا کرتے تھے۔"
         },
         {
            "arabic":"قَالَ : وَكَانَ يَقُولُ : إِنَّمَا أَصْنَعُ كَمَا رَأَيْتُ أَصْحَابِي يَصْنَعُونَ ، وَلَا أَمْنَعُ أَحَدًا أَنْ يُصَلِّيَ فِي أَيِّ سَاعَةٍ شَاءَ مِنْ لَيْلٍ أَوْ نَهَارٍ ، غَيْرَ أَنْ لَا تَتَحَرَّوْا طُلُوعَ الشَّمْسِ وَلَا غُرُوبَهَا \" .",
            "englishTranslation":"And he (i.e. Ibn `Umar) used to say, \"I do only what my companions used to do and I don't forbid anybody to pray at any time during the day or night except that one should not intend to pray at sunrise or sunset.\"",
            "urduTranslation":"´نافع نے بیان کیا کہ ابن عمر رضی اللہ عنہما فرمایا کرتے تھے کہ` میں اسی طرح کرتا ہوں جیسے میں نے اپنے ساتھیوں (صحابہ رضی اللہ عنہم) کو کرتے دیکھا ہے۔ لیکن تمہیں رات یا دن کے کسی حصے میں نماز پڑھنے سے نہیں روکتا۔ صرف اتنی بات ہے کہ قصد کر کے تم سورج نکلتے یا ڈوبتے وقت نہ پڑھو۔"
         }
      ]
   }
]
