[
   {
      "day":"Day One",
      "steps":"Miqat:",
      "description":"The pilgrim enters the state of Ihram at one of the five Miqats (entry points), putting on the Ihtam garment and expressing the intention to perform Hajj.\nMakkah:\nPerform the Welcome Tawaf (Tawaf al Qudum).\n Perform Sa'y (passing seven times between the hillocks of Safa and Marwah).\nGo to Mina.\n Mina:\n (8th of Dhu'l-Hijjah to 9th of Dhu'l-Hijjah)\n\nIn Mina, perfrom five prayers starting with the noon (dhur) prayer and ending with dawn (fajr) on the day of Arafat.\n may also collect some of the seventy small pebbles you will need for the \"stoning\" ceremony (ramy)."
   },
   {
      "day":"Day Two",
      "steps":"Arafat\n(9th of Dhu'l-Hijjah)",
      "description":"When you reach Arafat, devote as much of your time as possible to prayer.\n From the afternoon on wards, perform Wuquf at Arafah.\nGo outside your tent, and face towards the Qibla (Holy City of Makkah) and pray to Allah with all your heart.\n When the sun has set, leave Arafat for Muzdalifah.\nMuzdalifah\n (9th to 10th of Dhu'l-Hijjah)\n\nYour stay in Muzdalifah will be under the open sky.\nHere you will offer the evening prayer (Maghreb) and stay over night.\n Collect the pebbles you will need for the \"stoning\" ceremony (ramy). You may have already collected some pebbles in Mina.\n At dawn, offer Fajr prayers.\n Then, before the sun has risen, set off for Mina."
   },
   {
      "day":"Day Three",
      "steps":"Mina\n(10th of Dhu'l-Hijjah)",
      "description":"Perform the stoning (ramy).\nAfter the stoning of the pillars of temptation (signifying the temptations of Satan), a sacrifice is required if you are performing Hajj al-Qiran or Hajj al-Tamattu'. A sacrifice is recommended, although not required, for Hajj al-ifrad.\n Now leave the state of ihram. Most prohibitions are ended.\n Proceed to al Masjid al Haram in Makkah to perform Tawaf al-ifadha.\nMakkah\n(10th of Dhu'l-Hijjah)\n\nPerform the Hajj Tawaf (Tawaf al-Ifadha). Circumambulate the Kaaba seven times and then offer prayers (Rakaat) befind Maqam Ibrahim.\nThen perform Sa'y between Safa and Marwah.\nDrink from the well of Zamzam.\nAs soon as you have completed the Hajj Tawaf (Tawaf al-Ifadha) the state of Ihram is completely ended.\nReturn to Mina"
   },
   {
      "day":"Day Four to Six",
      "steps":"Mina\n(10th to 13th of Dhu'l-Hijjah)",
      "description":"Stay at Mina for two or three days.\nAt Mina, you will stone the tree pillars in a set order, performing ramy al-uula, ramy al-wusta and ramy al-kubra. To avoid over-crowding, the stoning must be performed according to predetermined schedules.\nYou may return to al Masjid al Haram to perfrom the Farewell Tawaf.\nMakkah\n (12th to 13th of Dhu'l-Hijjah)\n\nPerform the Farewell Tawaf;\nThis Tawaf marks the end of your Hajj.\nSpend whatever time you can within the precincts of al Masjid al Haram. Make your prayers and devotions as you wish.\nYour Hajj completed, you should leave Makkah promptly for your next destination."
   }
]
