[
   {
      "azkarName":"Eating",
      "Image":"eating",
      "data":[
         {
            "duatitle":"کھانے سے پہلے کی دعا",
            "arabic":"بِسْمِ اللّٰہِ وَعَلٰی بَرَكَةِ اللّٰہِ",
            "urduTranslation":"میں نے الله کے نام کے ساتھ اور الله کی برکت پر کھانا شروع کیا",
            "englishTranslation":"In the name of Allah and with the blessings of Allah I begin (eating)"
         },
         {
            "duatitle":"کھانے کے بعد کی دعا",
            "arabic":"الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَجَعَلَنَا مِنَ الْمُسْلِمِينَ",
            "urduTranslation":"اللہ عزوجل کا شکر ہے جس نے ہمیں کھلایا پلایا اور مسلمانوں میں سے بنایا",
            "englishTranslation":"Thanks to Allah Azzawajal who fed us and made us among Muslims"
         }
      ]
   },
   {
      "azkarName":"Mosque",
      "Image":"mosque",
      "data":[
         {
            "duatitle":"مسجد میں داخل ہونے کی دعاَ",
            "arabic":"اَللّٰهُمَّ افْتَحْ لِيْ اَبْوَابَ رَحْمَتِکَ",
            "urduTranslation":"اے اللہ! میرے لیے رحمت کے دروازے کھول دے",
            "englishTranslation":"Oh Allah! Open the doors for me of your Blessings"
         },
         {
            "duatitle":"مسجد سے نکلنے کی دعا",
            "arabic":"اَللّٰهُمَّ اِنِّيْ اَسْاَلُکَ مِنْ فَضْلِکَ وَرَحْمَتِکَ",
            "urduTranslation":"اے اللہ! میں تجھ سے تیرا فضل اور تیری رحمت مانگتا ہوں",
            "englishTranslation":"Oh Allah! I ask you of your Favour"
         }
      ]
   },
   {
      "azkarName":"Travelling",
      "Image":"van",
      "data":[
         {
            "duatitle":"سفر اور سواری کی دعا",
            "arabic":"سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَـٰذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَىٰ رَبِّنَا لَمُنقَلِبُونَ",
            "urduTranslation":"اللہ عزوجل کا شکر ہے، پاک ہے وہ جس نے ہمارے لئے اس(سواری کو) مسخر کیا اور ہم اس کو فرمانبردار نہیں بنا سکتے تھے",
            "englishTranslation":"Thanks to Allah Azzawajal. Pure is he who subdude this, other wise we could not make this obedient"
         }
      ]
   },
   {
      "azkarName":"Sleeping",
      "Image":"sleeping",
      "data":[
         {
            "duatitle":"سوتے وقت کی دعا",
            "arabic":"اَللّٰھُمَّ بِاسْمِكَ أَمُوتُ وَأَحْيَاَ",
            "urduTranslation":"الٰہی عزوجل میں تیرے نام پر مرتا ہوں اور جیتا ہوں",
            "englishTranslation":"O Allah (Almighty) I live and die in your name"
         },
         {
            "duatitle":"نیند سے بیدار ہونے کی دعا",
            "arabic":"الْحَمْدُ لِلّٰہِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ",
            "urduTranslation":"تمام تعریفیں اللہ عزوجل کے لئے جس نے ہمیں موت (نیند) کے بعد حیات (بیداری) عطا فرمائی اور ہمیں اسی طرف لوٹنا ہے",
            "englishTranslation":"All Praise onto Allah (Almighty) Who granted us life after death (Sleep) and we are return to him"
         }
      ]
   },
   {
      "azkarName":"Home",
      "Image":"house",
      "data":[
         {
            "duatitle":"گھر میں داخل ہوتے وقت کی دعا",
            "arabic":"اَللّٰھُمَّ اِنِّیْ اَسْئَلُكَ خَیْرَالْمَوْلَجِ وَخَیْرَالْمَخْرَجِ",
            "urduTranslation":"اے اللہ عَزَّ وَجَلَّ ! میں تجھ سے داخل ہونے اور نکلنے کی جگہوں کی بھلائی طلب کرتا ہوں",
            "englishTranslation":"O Allah(عَزَّ وَجَلَّ)! I ask you for the goodness of the places of entering and exiting"
         },
         {
            "duatitle":"گھر سے نکلتے وقت کی دعا",
            "arabic":"بِسْمِ اللّٰہِ تَوَكَّلْتُ عَلَى اللّٰہِ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰہِ",
            "urduTranslation":"اللہ عزوجل کے نام سے (گھر سے نکلتا ہوں) میں نے اللہ عزوجل پر بھروسہ کیا اللہ عزوجل کے بغیر نہ طاقت ہے (گناہوں سے بچنےکی) اور نہ وقت ہے (نیکیاں کرنے کی",
            "englishTranslation":"In the name of Allah Almighty (I comeout of my house) I trust Allah Almighty, there is no capability of saving oneself from sins and neither is there capability to do good deeds but from Allah Almighty"
         }
      ]
   },
   {
      "azkarName":"Sneezing",
      "Image":"sneezing",
      "data":[
         {
            "duatitle":"چھینک آنے کے وقت کی دعا",
            "arabic":"اَلْحَمْدُ لِلّٰہَِ",
            "urduTranslation":"تمام تعریفیں اللہ عزوجل کےلئے ہیں",
            "englishTranslation":"All praise onto Allah Almighty"
         }
      ]
   },
   {
      "azkarName":"Wudu",
      "Image":"moslem wudu hand",
      "data":[
         {
            "duatitle":"وضو سے پہلے کی دعا",
            "arabic":"بِسْمِ اللّٰہِ وَلْحَمْدُ لِلّٰ",
            "urduTranslation":"اللہ عزوجل کے نام سے شروع جو بڑا مہربان اور نہایت رحم والا ہے",
            "englishTranslation":"Allah Azzawajal in the name of the most affectionate, the merciful"
         },
         {
            "duatitle":"وضو کے درمیان پڑھنے کی دعا",
            "arabic":"اَللّٰهُمَّ اغْفِرْ لِي ذَنْبِي وَوَسِّعْ لِي فِي دَارِي وَبَارِكْ لِي فِي رِزْقِي",
            "urduTranslation":"اے اللہ عزوجل مجھے بخش دے اور میرے گھر میں برکت و شادگی دے اور میرے گھر روزی میں برکت عطا فرما",
            "englishTranslation":"O Allah Azzawajal forgive me and give me abundance and blessing in my house and grant me abundance in my livlihood"
         }
      ]
   },
   {
      "azkarName":"Graveyard",
      "Image":"graveyardImage",
      "data":[
         {
            "duatitle":"قبرستان میں داخل ہوتے وقت کی دعا",
            "arabic":"السَّلَامُ عَلَيْكُمُ يَا أَهْلَ الْقُبُورِ يَغْفِرُ اللَّهُ لَنَا وَلَكُمْ أَنْتُمُ سَلَفُنَا وَنَحْنُ بِالْأَثَرِ",
            "urduTranslation":"اے قبر والوں تم پر سلام ہو۔ اللہ عزوجل ہماری اور تمہاری مغفرت فرما۔ اور تم ہم سے پہلے پہنچ گئے اور ہم پیچھے آنےوالے ہیں",
            "englishTranslation":"O dwellers of the graves peace be upon you. May Allah Azzawajal forgive us and you. You reached before us and we will follow behind you"
         },
         {
            "duatitle":"میت کو قبر میں رکھتے وقت کی دعا",
            "arabic":"بِسْمِ اللَّهِ وَعَلٰی سُنَّةِ رَسُولِ اللَّهِ",
            "urduTranslation":"اللہ عزوجل کے نام سے اور رسول اللہ صلی اللہ علیہ وسلم کے طریقہ پر (اسے دفن کرتا ہوں)",
            "englishTranslation":"Allah Azzawajal in the name of and according to the way of Messenger SAW (It is burried)"
         }
      ]
   },
   {
      "azkarName":"Roza",
      "Image":"moonImage",
      "data":[
         {
            "duatitle":"روزہ رکھنے کی نیت",
            "arabic":"وَبِصَوْمِ غَدٍ نَّوَيْتُ مِنْ شَهْرِ رَمَضَانَِ",
            "urduTranslation":"اورمیں نے ماہ رمضان کے کل کے روزے کی نیت کی",
            "englishTranslation":"I Intend to keep the fast for month of Ramadan"
         },
         {
            "duatitle":"روزہ افطار کرنے کی دعا",
            "arabic":"اَللّٰهُمَّ اِنِّی لَکَ صُمْتُ وَبِکَ اٰمَنْتُ وَعَلَيْکَ تَوَکَّلْتُ وَعَلٰی رِزْقِکَ اَفْطَرْتُ",
            "urduTranslation":"اے اللہ!میں نے تیری خاطر روزہ رکھا اور تیرے اوپر ایمان لایا اور تجھ پر بھروسہ کیا اورتیرے رزق سے اسے کھول رہا ہوں",
            "englishTranslation":"O Allah! I fasted for you and I believe in you and I put my trust in You and I break my fast with your sustenance"
         }
      ]
   },
   {
      "azkarName":"Rain",
      "Image":"rainimage",
      "data":[
         {
            "duatitle":"بارش طلب کرنے کی دعا",
            "arabic":"اللَّهُمَّ أَغِثْنَا",
            "urduTranslation":"اے اللہ ہمیں بارش دے",
            "englishTranslation":"O Allah, listen to our plea (request)"
         }
      ]
   }
]
